{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\/indSCE_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 Nov 2023, 14:30:22
{txt}
{com}. 
. 
. *********************************************************
. *** before working with SCE, clean the macro monthly data 
. ********************************************************
. 
. use "${c -(}otherdata_folder{c )-}macroM_raw.dta",clear 
{txt}
{com}. 
. generate new_date = dofc(DATE)
{txt}
{com}. *format new_date %tm
. gen year = year(new_date)
{txt}
{com}. gen month = month(new_date)
{txt}
{com}. gen date_str = string(year)+ "m"+string(month)
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop DATE date_str year month new_date 
{txt}
{com}. label var sp500 "growth rate (%) of sp500 index from last month"
{txt}
{com}. rename ue uerate
{res}{txt}
{com}. label var uerate "unemployment rate"
{txt}
{com}. label var he "quarterly growth in hourly earning"
{txt}
{com}. label var vix "vix indices"
{txt}
{com}. save "${c -(}mainfolder{c )-}/OtherData/macroM.dta",replace 
{txt}{p 0 4 2}
file {bf}
C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\/OtherData/macroM.dta{rm}
saved
{p_end}

{com}. clear 
{txt}
{com}. 
. 
. *****************************************
. ** Prepare estimated income risks data **
. ******************************************
. 
. ** full sample
. use "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed.dta", clear 
{txt}
{com}. 
. drop index 
{txt}
{com}. gen year = floor(YM/100)
{txt}
{com}. gen month = YM - year*100
{txt}
{com}. gen date_str=string(year)+"M"+string(month)
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop date_str 
{txt}
{com}. 
. table date
{res}
{smcl}
{reset}{...}
{hline 9}{c -}{c TT}{c -}{c -}{hline 9}
{space 9} {c |}  Frequency
{hline 9}{c -}{c +}{c -}{c -}{hline 9}
date{space 5} {c |}  {space 9}
  2013m3{space 1} {c |}  {space 8}{result:1}
  2013m4{space 1} {c |}  {space 8}{result:1}
  2013m5{space 1} {c |}  {space 8}{result:1}
  2013m6{space 1} {c |}  {space 8}{result:1}
  2013m7{space 1} {c |}  {space 8}{result:1}
  2013m8{space 1} {c |}  {space 8}{result:1}
  2013m9{space 1} {c |}  {space 8}{result:1}
  2013m10 {c |}  {space 8}{result:1}
  2013m11 {c |}  {space 8}{result:1}
  2013m12 {c |}  {space 8}{result:1}
  2014m1{space 1} {c |}  {space 8}{result:1}
  2014m2{space 1} {c |}  {space 8}{result:1}
  2014m3{space 1} {c |}  {space 8}{result:1}
  2014m4{space 1} {c |}  {space 8}{result:1}
  2014m5{space 1} {c |}  {space 8}{result:1}
  2014m6{space 1} {c |}  {space 8}{result:1}
  2014m7{space 1} {c |}  {space 8}{result:1}
  2014m8{space 1} {c |}  {space 8}{result:1}
  2014m9{space 1} {c |}  {space 8}{result:1}
  2014m10 {c |}  {space 8}{result:1}
  2014m11 {c |}  {space 8}{result:1}
  2014m12 {c |}  {space 8}{result:1}
  2015m1{space 1} {c |}  {space 8}{result:1}
  2015m2{space 1} {c |}  {space 8}{result:1}
  2015m3{space 1} {c |}  {space 8}{result:1}
  2015m4{space 1} {c |}  {space 8}{result:1}
  2015m5{space 1} {c |}  {space 8}{result:1}
  2015m6{space 1} {c |}  {space 8}{result:1}
  2015m7{space 1} {c |}  {space 8}{result:1}
  2015m8{space 1} {c |}  {space 8}{result:1}
  2015m9{space 1} {c |}  {space 8}{result:1}
  2015m10 {c |}  {space 8}{result:1}
  2015m11 {c |}  {space 8}{result:1}
  2015m12 {c |}  {space 8}{result:1}
  2016m1{space 1} {c |}  {space 8}{result:1}
  2016m2{space 1} {c |}  {space 8}{result:1}
  2016m3{space 1} {c |}  {space 8}{result:1}
  2016m4{space 1} {c |}  {space 8}{result:1}
  2016m5{space 1} {c |}  {space 8}{result:1}
  2016m6{space 1} {c |}  {space 8}{result:1}
  2016m7{space 1} {c |}  {space 8}{result:1}
  2016m8{space 1} {c |}  {space 8}{result:1}
  2016m9{space 1} {c |}  {space 8}{result:1}
  2016m10 {c |}  {space 8}{result:1}
  2016m11 {c |}  {space 8}{result:1}
  2016m12 {c |}  {space 8}{result:1}
  2017m1{space 1} {c |}  {space 8}{result:1}
  2017m2{space 1} {c |}  {space 8}{result:1}
  2017m3{space 1} {c |}  {space 8}{result:1}
  2017m4{space 1} {c |}  {space 8}{result:1}
  2017m5{space 1} {c |}  {space 8}{result:1}
  2017m6{space 1} {c |}  {space 8}{result:1}
  2017m7{space 1} {c |}  {space 8}{result:1}
  2017m8{space 1} {c |}  {space 8}{result:1}
  2017m9{space 1} {c |}  {space 8}{result:1}
  2017m10 {c |}  {space 8}{result:1}
  2017m11 {c |}  {space 8}{result:1}
  2017m12 {c |}  {space 8}{result:1}
  2018m1{space 1} {c |}  {space 8}{result:1}
  2018m2{space 1} {c |}  {space 8}{result:1}
  2018m3{space 1} {c |}  {space 8}{result:1}
  2018m4{space 1} {c |}  {space 8}{result:1}
  2018m5{space 1} {c |}  {space 8}{result:1}
  2018m6{space 1} {c |}  {space 8}{result:1}
  2018m7{space 1} {c |}  {space 8}{result:1}
  2018m8{space 1} {c |}  {space 8}{result:1}
  2018m9{space 1} {c |}  {space 8}{result:1}
  2018m10 {c |}  {space 8}{result:1}
  2018m11 {c |}  {space 8}{result:1}
  2018m12 {c |}  {space 8}{result:1}
  2019m1{space 1} {c |}  {space 8}{result:1}
  2019m2{space 1} {c |}  {space 8}{result:1}
  2019m3{space 1} {c |}  {space 8}{result:1}
  2019m4{space 1} {c |}  {space 8}{result:1}
  2019m5{space 1} {c |}  {space 8}{result:1}
  2019m6{space 1} {c |}  {space 8}{result:1}
  2019m7{space 1} {c |}  {space 8}{result:1}
  2019m8{space 1} {c |}  {space 8}{result:1}
  2019m9{space 1} {c |}  {space 8}{result:1}
  2019m10 {c |}  {space 8}{result:1}
  2019m11 {c |}  {space 8}{result:1}
  2019m12 {c |}  {space 8}{result:1}
  2020m1{space 1} {c |}  {space 8}{result:1}
  2020m2{space 1} {c |}  {space 8}{result:1}
  2020m3{space 1} {c |}  {space 8}{result:1}
  2020m4{space 1} {c |}  {space 8}{result:1}
  2020m5{space 1} {c |}  {space 8}{result:1}
  2020m6{space 1} {c |}  {space 8}{result:1}
  2020m7{space 1} {c |}  {space 8}{result:1}
  2020m8{space 1} {c |}  {space 8}{result:1}
  2020m9{space 1} {c |}  {space 8}{result:1}
  2020m10 {c |}  {space 8}{result:1}
  2020m11 {c |}  {space 8}{result:1}
  2020m12 {c |}  {space 8}{result:1}
  2021m1{space 1} {c |}  {space 8}{result:1}
  2021m2{space 1} {c |}  {space 8}{result:1}
  2021m3{space 1} {c |}  {space 8}{result:1}
  2021m4{space 1} {c |}  {space 8}{result:1}
  2021m5{space 1} {c |}  {space 8}{result:1}
  2021m6{space 1} {c |}  {space 8}{result:1}
  2021m7{space 1} {c |}  {space 8}{result:1}
  2021m8{space 1} {c |}  {space 8}{result:1}
  2021m9{space 1} {c |}  {space 8}{result:1}
  2021m10 {c |}  {space 8}{result:1}
  2021m11 {c |}  {space 8}{result:1}
  2021m12 {c |}  {space 8}{result:1}
  Total{space 2} {c |}  {space 6}{result:106}
{hline 9}{c -}{c BT}{c -}{c -}{hline 9}

{com}. 
. tsset date
{res}
{p 0 15 2}{txt:Time variable: }{res:date}{txt:, }{res:{bind:2013m3}}{txt: to }{res:{bind:2021m12}}{p_end}
{txt}{col 9}Delta: {res}1 month
{txt}
{com}. tsfill
{txt}
{com}. replace month=1 if f1.month==2 & month==.
{txt}(0 real changes made)

{com}. replace year = f1.year if f1.month==2 & month==1
{txt}(0 real changes made)

{com}. replace YM = 100*year+month if YM==.
{txt}(0 real changes made)

{com}. 
. 
. rename permanent prisk_all
{res}{txt}
{com}. rename transitory trisk_all
{res}{txt}
{com}. label var prisk_all "estimated full-sample permanent risk(std)"
{txt}
{com}. label var trisk_all "estimated full-sample transitory risk (std)"
{txt}
{com}. 
. ** estimated risks in variances 
. 
. gen prisk2_all=prisk_all^2
{txt}(5 missing values generated)

{com}. gen trisk2_all=trisk_all^2
{txt}
{com}. 
. 
. label var prisk2_all "full sample permanent risk (var)"
{txt}
{com}. label var trisk2_all "full sample transitory risk  (var)"
{txt}
{com}. 
. 
. ***********************************
. ** Fill some estimation risk for january 
. *************************************
. 
. replace prisk2_all=(l1.prisk2_all+f1.prisk2_all)/2 if month==1
{txt}(8 real changes made)

{com}. replace trisk2_all=(l1.trisk2_all+f1.trisk2_all)/2 if month==1
{txt}(8 real changes made)

{com}. 
. ***********************************
. ** Time aggregation of estimation risk
. *************************************
. 
. foreach x in all{c -(}
{txt}  2{com}. gen prisk2_`x'_rl = (f1.prisk2_`x'+f2.prisk2_`x'+f3.prisk2_`x'+f4.prisk2_`x'+ ///
>                       f5.prisk2_`x'+f6.prisk2_`x'+f7.prisk2_`x'+f8.prisk2_`x'+ ///
>                                           f9.prisk2_`x'+ f10.prisk2_`x'+ f11.prisk2_`x'+f12.prisk2_`x') 
{txt}  3{com}. 
. gen trisk2_`x'_rl = (f1.trisk2_`x'+f2.trisk2_`x'+f3.trisk2_`x'+f4.trisk2_`x'+ ///
>                       f5.trisk2_`x'+f6.trisk2_`x'+f7.trisk2_`x'+f8.trisk2_`x'+ ///
>                                           f9.trisk2_`x'+ f10.trisk2_`x'+ f11.trisk2_`x'+f12.trisk2_`x')/12
{txt}  4{com}. 
. gen rincvar_`x'_rl = prisk2_`x'_rl+ trisk2_`x'_rl
{txt}  5{com}. {c )-}
{txt}(12 missing values generated)
(12 missing values generated)
(12 missing values generated)

{com}. 
. label var rincvar_all_rl "realized full-sample annual risk 12 m from now"
{txt}
{com}. 
. 
. gen rincvar_all_now = l12.rincvar_all_rl
{txt}(12 missing values generated)

{com}. label var rincvar_all_now "realized full-sample annual risk since 12 m ago"
{txt}
{com}. 
. drop year month
{txt}
{com}. save "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_annual.dta",replace 
{txt}{p 0 4 2}
file {bf}
C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\OtherData\/sipp/sipp_history_vol_decomposed_annual.dta{rm}
saved
{p_end}

{com}. 
. 
. *****************************
. ** subsample sample
. ******************************
. 
. use "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_edu_gender_age5.dta", clear
{txt}
{com}. 
. drop index 
{txt}
{com}. gen year = floor(YM/100)
{txt}
{com}. gen month = YM - year*100
{txt}
{com}. gen date_str=string(year)+"M"+string(month)
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop date_str 
{txt}
{com}. 
. table date
{res}
{smcl}
{reset}{...}
{hline 9}{c -}{c TT}{c -}{c -}{hline 9}
{space 9} {c |}  Frequency
{hline 9}{c -}{c +}{c -}{c -}{hline 9}
date{space 5} {c |}  {space 9}
  2013m3{space 1} {c |}  {space 7}{result:48}
  2013m4{space 1} {c |}  {space 7}{result:48}
  2013m5{space 1} {c |}  {space 7}{result:48}
  2013m6{space 1} {c |}  {space 7}{result:48}
  2013m7{space 1} {c |}  {space 7}{result:48}
  2013m8{space 1} {c |}  {space 7}{result:48}
  2013m9{space 1} {c |}  {space 7}{result:48}
  2013m10 {c |}  {space 7}{result:48}
  2013m11 {c |}  {space 7}{result:48}
  2013m12 {c |}  {space 7}{result:48}
  2014m1{space 1} {c |}  {space 7}{result:48}
  2014m2{space 1} {c |}  {space 7}{result:48}
  2014m3{space 1} {c |}  {space 7}{result:48}
  2014m4{space 1} {c |}  {space 7}{result:48}
  2014m5{space 1} {c |}  {space 7}{result:48}
  2014m6{space 1} {c |}  {space 7}{result:48}
  2014m7{space 1} {c |}  {space 7}{result:48}
  2014m8{space 1} {c |}  {space 7}{result:48}
  2014m9{space 1} {c |}  {space 7}{result:48}
  2014m10 {c |}  {space 7}{result:48}
  2014m11 {c |}  {space 7}{result:48}
  2014m12 {c |}  {space 7}{result:48}
  2015m1{space 1} {c |}  {space 7}{result:48}
  2015m2{space 1} {c |}  {space 7}{result:48}
  2015m3{space 1} {c |}  {space 7}{result:48}
  2015m4{space 1} {c |}  {space 7}{result:48}
  2015m5{space 1} {c |}  {space 7}{result:48}
  2015m6{space 1} {c |}  {space 7}{result:48}
  2015m7{space 1} {c |}  {space 7}{result:48}
  2015m8{space 1} {c |}  {space 7}{result:48}
  2015m9{space 1} {c |}  {space 7}{result:48}
  2015m10 {c |}  {space 7}{result:48}
  2015m11 {c |}  {space 7}{result:48}
  2015m12 {c |}  {space 7}{result:48}
  2016m1{space 1} {c |}  {space 7}{result:48}
  2016m2{space 1} {c |}  {space 7}{result:48}
  2016m3{space 1} {c |}  {space 7}{result:48}
  2016m4{space 1} {c |}  {space 7}{result:48}
  2016m5{space 1} {c |}  {space 7}{result:48}
  2016m6{space 1} {c |}  {space 7}{result:48}
  2016m7{space 1} {c |}  {space 7}{result:48}
  2016m8{space 1} {c |}  {space 7}{result:48}
  2016m9{space 1} {c |}  {space 7}{result:48}
  2016m10 {c |}  {space 7}{result:48}
  2016m11 {c |}  {space 7}{result:48}
  2016m12 {c |}  {space 7}{result:48}
  2017m1{space 1} {c |}  {space 7}{result:48}
  2017m2{space 1} {c |}  {space 7}{result:48}
  2017m3{space 1} {c |}  {space 7}{result:48}
  2017m4{space 1} {c |}  {space 7}{result:48}
  2017m5{space 1} {c |}  {space 7}{result:48}
  2017m6{space 1} {c |}  {space 7}{result:48}
  2017m7{space 1} {c |}  {space 7}{result:48}
  2017m8{space 1} {c |}  {space 7}{result:48}
  2017m9{space 1} {c |}  {space 7}{result:48}
  2017m10 {c |}  {space 7}{result:48}
  2017m11 {c |}  {space 7}{result:48}
  2017m12 {c |}  {space 7}{result:48}
  2018m1{space 1} {c |}  {space 7}{result:48}
  2018m2{space 1} {c |}  {space 7}{result:48}
  2018m3{space 1} {c |}  {space 7}{result:48}
  2018m4{space 1} {c |}  {space 7}{result:48}
  2018m5{space 1} {c |}  {space 7}{result:48}
  2018m6{space 1} {c |}  {space 7}{result:48}
  2018m7{space 1} {c |}  {space 7}{result:48}
  2018m8{space 1} {c |}  {space 7}{result:48}
  2018m9{space 1} {c |}  {space 7}{result:48}
  2018m10 {c |}  {space 7}{result:48}
  2018m11 {c |}  {space 7}{result:48}
  2018m12 {c |}  {space 7}{result:48}
  2019m1{space 1} {c |}  {space 7}{result:48}
  2019m2{space 1} {c |}  {space 7}{result:48}
  2019m3{space 1} {c |}  {space 7}{result:48}
  2019m4{space 1} {c |}  {space 7}{result:48}
  2019m5{space 1} {c |}  {space 7}{result:48}
  2019m6{space 1} {c |}  {space 7}{result:48}
  2019m7{space 1} {c |}  {space 7}{result:48}
  2019m8{space 1} {c |}  {space 7}{result:48}
  2019m9{space 1} {c |}  {space 7}{result:48}
  2019m10 {c |}  {space 7}{result:48}
  2019m11 {c |}  {space 7}{result:48}
  2019m12 {c |}  {space 7}{result:48}
  2020m1{space 1} {c |}  {space 7}{result:48}
  2020m2{space 1} {c |}  {space 7}{result:48}
  2020m3{space 1} {c |}  {space 7}{result:48}
  2020m4{space 1} {c |}  {space 7}{result:48}
  2020m5{space 1} {c |}  {space 7}{result:48}
  2020m6{space 1} {c |}  {space 7}{result:48}
  2020m7{space 1} {c |}  {space 7}{result:48}
  2020m8{space 1} {c |}  {space 7}{result:48}
  2020m9{space 1} {c |}  {space 7}{result:48}
  2020m10 {c |}  {space 7}{result:48}
  2020m11 {c |}  {space 7}{result:48}
  2020m12 {c |}  {space 7}{result:48}
  2021m1{space 1} {c |}  {space 7}{result:48}
  2021m2{space 1} {c |}  {space 7}{result:48}
  2021m3{space 1} {c |}  {space 7}{result:48}
  2021m4{space 1} {c |}  {space 7}{result:48}
  2021m5{space 1} {c |}  {space 7}{result:48}
  2021m6{space 1} {c |}  {space 7}{result:48}
  2021m7{space 1} {c |}  {space 7}{result:48}
  2021m8{space 1} {c |}  {space 7}{result:48}
  2021m9{space 1} {c |}  {space 7}{result:48}
  2021m10 {c |}  {space 7}{result:48}
  2021m11 {c |}  {space 7}{result:48}
  2021m12 {c |}  {space 7}{result:48}
  Total{space 2} {c |}  {space 4}{result:5,088}
{hline 9}{c -}{c BT}{c -}{c -}{hline 9}

{com}. ************************************************
. egen groupid = group(gender educ age_5yr)
{txt}
{com}. xtset groupid date 
{res}
{col 1}{txt:Panel variable: }{res:groupid}{txt: (strongly balanced)}
{p 1 16 2}{txt:Time variable: }{res:date}{txt:, }{res:{bind:2013m3}}{txt: to }{res:{bind:2021m12}}{p_end}
{txt}{col 10}Delta: {res}1 month
{txt}
{com}. 
. ********************************************
. rename permanent prisk_sub
{res}{txt}
{com}. rename transitory trisk_sub
{res}{txt}
{com}. label var prisk_sub "estimated sub-sample permanent risk(std)"
{txt}
{com}. label var trisk_sub "estimated sub-sample transitory risk (std)"
{txt}
{com}. 
. ** estimated risks in variances 
. gen prisk2_sub=prisk_sub^2
{txt}(240 missing values generated)

{com}. gen trisk2_sub = trisk_sub^2 
{txt}
{com}. 
. label var prisk2_sub "sub sample permanent risk  (var)"
{txt}
{com}. label var trisk2_sub "sub sample transitory risk  (var)"
{txt}
{com}. 
. 
. foreach var in prisk2_sub trisk2_sub{c -(}
{txt}  2{com}.       egen `var'pl=pctile(`var'),p(1) by(date)
{txt}  3{com}.           egen `var'pu=pctile(`var'),p(99) by(date)
{txt}  4{com}.           replace `var' = . if `var' <`var'pl | (`var' >`var'pu & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(240 missing values generated)
(240 missing values generated)
(0 real changes made)
(0 real changes made)

{com}. 
. ***********************************
. ** Fill some estimation risk for january 
. *************************************
. 
. replace prisk2_sub=(l1.prisk2_sub+f1.prisk2_sub)/2 if month==1
{txt}(381 real changes made)

{com}. replace trisk2_sub=(l1.trisk2_sub+f1.trisk2_sub)/2 if month==1
{txt}(375 real changes made)

{com}. 
. ***********************************
. ** Time aggregation of estimation risk
. *************************************
. 
. foreach x in sub{c -(}
{txt}  2{com}. gen prisk2_`x'_rl = (f1.prisk2_`x'+f2.prisk2_`x'+f3.prisk2_`x'+f4.prisk2_`x'+ ///
>                       f5.prisk2_`x'+f6.prisk2_`x'+f7.prisk2_`x'+f8.prisk2_`x'+ ///
>                                           f9.prisk2_`x'+ f10.prisk2_`x'+ f11.prisk2_`x'+f12.prisk2_`x') 
{txt}  3{com}. 
. gen trisk2_`x'_rl = (f1.trisk2_`x'+f2.trisk2_`x'+f3.trisk2_`x'+f4.trisk2_`x'+ ///
>                       f5.trisk2_`x'+f6.trisk2_`x'+f7.trisk2_`x'+f8.trisk2_`x'+ ///
>                                           f9.trisk2_`x'+ f10.trisk2_`x'+ f11.trisk2_`x'+f12.trisk2_`x')/12 
{txt}  4{com}. 
. gen rincvar_`x'_rl = prisk2_`x'_rl+ trisk2_`x'_rl
{txt}  5{com}. {c )-}
{txt}(576 missing values generated)
(576 missing values generated)
(576 missing values generated)

{com}. 
. label var rincvar_sub_rl "realized sub-sample annual risk"
{txt}
{com}. 
. gen rincvar_sub_now = l12.rincvar_sub_rl
{txt}(576 missing values generated)

{com}. label var rincvar_sub_now "realized sub-sample annual risk since 12m ago"
{txt}
{com}. drop year month groupid 
{txt}
{com}. save "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_edu_gender_age5_annual.dta",replace
{txt}{p 0 4 2}
file {bf}
C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\OtherData\/sipp/sipp_history_vol_decomposed_edu_gender_age5_annual.dta{rm}
saved
{p_end}

{com}.  
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   Copies {c |} Observations       Surplus
{hline 10}{c +}{hline 27}
        1 {c |}       {res}134051             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. ************************************
. **  merge with estimated moments **
. ***********************************
. 
. * IncExpSCEDstIndM is the output from ../Pythoncode/DoDensityEst.ipynb
. merge 1:1 userid date using "${c -(}folder{c )-}/SCE/IncExpSCEDstIndM.dta", keep(master match) 
{res}{txt}{p 0 7 2}
(variable
{bf:date} was {bf:float}, now {bf:double} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:month} was {bf:byte}, now {bf:float} to accommodate using data's values)
{p_end}

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}         134,051
{txt}{col 9}from master{col 30}{res}         134,051{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}               0{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge IndEst_merge
{res}{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   Copies {c |} Observations       Surplus
{hline 10}{c +}{hline 27}
        1 {c |}       {res}134051             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. 
. ** merge labor market module  
. merge 1:1 year month userid using "${c -(}otherdata_folder{c )-}/LaborExpSCEIndM", keep(master match)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}         117,446
{txt}{col 9}from master{col 30}{res}         117,446{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}          16,605{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge labor_merge
{res}{txt}
{com}. rename userid ID 
{res}{txt}
{com}. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. rename Q24_mean incmean
{res}{txt}
{com}. rename Q24_var incvar
{res}{txt}
{com}. rename Q24_iqr inciqr
{res}{txt}
{com}. rename IncSkew incskew 
{res}{txt}
{com}. rename Q24_rmean rincmean
{res}{txt}
{com}. rename Q24_rvar rincvar
{res}{txt}
{com}. 
. *rename Q36 educ
. rename D6 HHinc 
{res}{txt}
{com}. rename Q32 age 
{res}{txt}
{com}. rename Q33 gender 
{res}{txt}
{com}. gen fulltime = Q10_1 
{txt}
{com}. gen parttime = Q10_2 
{txt}
{com}. rename Q12new selfemp
{res}{txt}
{com}. gen Stkprob= Q6new/100
{txt}(864 missing values generated)

{com}. gen UEprobAgg=Q4new/100
{txt}(309 missing values generated)

{com}. gen  UEprobInd4m = oo1_5/100
{txt}(125,855 missing values generated)

{com}. gen UEprobInd=Q13new/100
{txt}(47,902 missing values generated)

{com}. rename Q26v2 spending_dum
{res}{txt}
{com}. rename Q26v2part2 spending 
{res}{txt}
{com}. replace spending = spending/100
{txt}(127,088 real changes made)

{com}. gen spending_r = spending - Q9_mean
{txt}(15,519 missing values generated)

{com}. 
. gen exp_offer = oo2u/100
{txt}(130,872 missing values generated)

{com}. gen EUprobInd = Q22new/100
{txt}(47,693 missing values generated)

{com}. 
. ***********************
. ** merge other data ***
. **************************
. 
. 
. **macro data
. merge m:1 date using "${c -(}mainfolder{c )-}/OtherData/macroM.dta",keep(master match)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          36,618
{txt}{col 9}from master{col 30}{res}          36,618{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}          97,433{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename cpi CPIAU
{res}{txt}
{com}. drop _merge 
{txt}
{com}. 
. 
. * flow rate data
. merge m:1 year month using "${c -(}otherdata_folder{c )-}/CPS_worker_flows_SA.dta",keep(master match)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          14,395
{txt}{col 9}from master{col 30}{res}          14,395{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}         119,656{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge 
{txt}
{com}. 
. 
. * income risk estimation data
. gen YM = year*100+month
{txt}
{com}. 
. ** merge population estimation 
. merge m:1 YM using "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_annual.dta", keep(master match)
{res}{txt}{p 0 7 2}
(variable
{bf:YM} was {bf:float}, now {bf:double} to accommodate using data's values)
{p_end}

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          13,250
{txt}{col 9}from master{col 30}{res}          13,250{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}         120,801{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge 
{txt}
{com}. 
. ********************
. ** group variables *
. ********************
. 
. egen byear_5yr = cut(byear), ///
>      at(1915 1920 1925 1930 1935 1940 ///
>             1945 1950 1955 1960 1965 1970 ///
>             1975 1980 1985 1990 1995 2000 ///
>                 2005 2010)
{txt}
{com}. label var byear_5yr "5-year cohort"
{txt}
{com}. 
. egen age_5yr = cut(age), ///
>      at(20 25 30 35 40 45 ///
>             50 55 60)
{txt}(33,715 missing values generated)

{com}. label var age_5yr "5-year age"
{txt}
{com}. 
. 
. gen edu_g = . 
{txt}(134,051 missing values generated)

{com}. replace edu_g = 1 if educ==1
{txt}(1,125 real changes made)

{com}. replace edu_g = 2 if educ==2 | educ ==3 | educ == 4
{txt}(56,982 real changes made)

{com}. replace edu_g = 3 if educ <=9 & educ>4
{txt}(75,944 real changes made)

{com}. 
. label var edu_g "education group"
{txt}
{com}. label define edu_glb 1 "HS dropout" 2 "HS graduate" 3 "College/above"
{txt}
{com}. label value edu_g edu_glb
{txt}
{com}. 
. replace educ = edu_g 
{txt}(119,244 real changes made)

{com}. 
. merge m:1 gender educ age_5yr YM ///
>          using "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_edu_gender_age5_annual.dta", keep(master match)
{res}{txt}{p 0 7 2}
(variable
{bf:educ} was {bf:float}, now {bf:double} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:age_5yr} was {bf:float}, now {bf:double} to accommodate using data's values)
{p_end}

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          56,753
{txt}{col 9}from master{col 30}{res}          56,753{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}          77,298{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge 
{txt}
{com}. 
. ** 
. merge m:1 gender educ age_5yr ///
>          using "${c -(}otherdata_folder{c )-}/sipp/sipp_vol_edu_gender_age5.dta", keep(master match)
{res}{txt}(label {bf:{txt}edu_glb} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          17,868
{txt}{col 9}from master{col 30}{res}          17,868{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}         116,183{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge 
{txt}
{com}. 
. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. 
. xtset ID date
{res}
{col 1}{txt:Panel variable: }{res:ID}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:date}{txt:, }{res:{bind:2013m6}}{txt: to }{res:{bind:2022m12}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 month
{txt}
{com}. sort ID date
{txt}
{com}. 
. *******************************
. ** Exclude youth and retired
. ******************************
. keep if age <= 60 & age >= 20
{txt}(30,275 observations deleted)

{com}. 
. *******************************
. **  Summary Statistics of SCE **
. *******************************
. 
. tabstat ID,s(count) by(date) column(statistics)

{txt}Summary for variables: ID
Group variable: date 

{ralign 9:date} {...}
{c |}         N
{hline 10}{c +}{hline 10}
{ralign 9: 2013m6} {...}
{c |}{...}
 {res}      891
{txt}{ralign 9: 2013m7} {...}
{c |}{...}
 {res}      850
{txt}{ralign 9: 2013m8} {...}
{c |}{...}
 {res}     1233
{txt}{ralign 9: 2013m9} {...}
{c |}{...}
 {res}     1082
{txt}{ralign 9:2013m10} {...}
{c |}{...}
 {res}     1091
{txt}{ralign 9:2013m11} {...}
{c |}{...}
 {res}     1083
{txt}{ralign 9:2013m12} {...}
{c |}{...}
 {res}      947
{txt}{ralign 9: 2014m1} {...}
{c |}{...}
 {res}      938
{txt}{ralign 9: 2014m2} {...}
{c |}{...}
 {res}      915
{txt}{ralign 9: 2014m3} {...}
{c |}{...}
 {res}      938
{txt}{ralign 9: 2014m4} {...}
{c |}{...}
 {res}      927
{txt}{ralign 9: 2014m5} {...}
{c |}{...}
 {res}      892
{txt}{ralign 9: 2014m6} {...}
{c |}{...}
 {res}      910
{txt}{ralign 9: 2014m7} {...}
{c |}{...}
 {res}      954
{txt}{ralign 9: 2014m8} {...}
{c |}{...}
 {res}      936
{txt}{ralign 9: 2014m9} {...}
{c |}{...}
 {res}      915
{txt}{ralign 9:2014m10} {...}
{c |}{...}
 {res}      903
{txt}{ralign 9:2014m11} {...}
{c |}{...}
 {res}      913
{txt}{ralign 9:2014m12} {...}
{c |}{...}
 {res}      882
{txt}{ralign 9: 2015m1} {...}
{c |}{...}
 {res}      900
{txt}{ralign 9: 2015m2} {...}
{c |}{...}
 {res}      907
{txt}{ralign 9: 2015m3} {...}
{c |}{...}
 {res}      869
{txt}{ralign 9: 2015m4} {...}
{c |}{...}
 {res}      885
{txt}{ralign 9: 2015m5} {...}
{c |}{...}
 {res}      891
{txt}{ralign 9: 2015m6} {...}
{c |}{...}
 {res}      885
{txt}{ralign 9: 2015m7} {...}
{c |}{...}
 {res}      869
{txt}{ralign 9: 2015m8} {...}
{c |}{...}
 {res}      848
{txt}{ralign 9: 2015m9} {...}
{c |}{...}
 {res}      879
{txt}{ralign 9:2015m10} {...}
{c |}{...}
 {res}      868
{txt}{ralign 9:2015m11} {...}
{c |}{...}
 {res}      866
{txt}{ralign 9:2015m12} {...}
{c |}{...}
 {res}      843
{txt}{ralign 9: 2016m1} {...}
{c |}{...}
 {res}      861
{txt}{ralign 9: 2016m2} {...}
{c |}{...}
 {res}      815
{txt}{ralign 9: 2016m3} {...}
{c |}{...}
 {res}      872
{txt}{ralign 9: 2016m4} {...}
{c |}{...}
 {res}      841
{txt}{ralign 9: 2016m5} {...}
{c |}{...}
 {res}      879
{txt}{ralign 9: 2016m6} {...}
{c |}{...}
 {res}      877
{txt}{ralign 9: 2016m7} {...}
{c |}{...}
 {res}      918
{txt}{ralign 9: 2016m8} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9: 2016m9} {...}
{c |}{...}
 {res}      911
{txt}{ralign 9:2016m10} {...}
{c |}{...}
 {res}      906
{txt}{ralign 9:2016m11} {...}
{c |}{...}
 {res}      895
{txt}{ralign 9:2016m12} {...}
{c |}{...}
 {res}      933
{txt}{ralign 9: 2017m1} {...}
{c |}{...}
 {res}      936
{txt}{ralign 9: 2017m2} {...}
{c |}{...}
 {res}      932
{txt}{ralign 9: 2017m3} {...}
{c |}{...}
 {res}      949
{txt}{ralign 9: 2017m4} {...}
{c |}{...}
 {res}      886
{txt}{ralign 9: 2017m5} {...}
{c |}{...}
 {res}      944
{txt}{ralign 9: 2017m6} {...}
{c |}{...}
 {res}      941
{txt}{ralign 9: 2017m7} {...}
{c |}{...}
 {res}      948
{txt}{ralign 9: 2017m8} {...}
{c |}{...}
 {res}      942
{txt}{ralign 9: 2017m9} {...}
{c |}{...}
 {res}      919
{txt}{ralign 9:2017m10} {...}
{c |}{...}
 {res}      956
{txt}{ralign 9:2017m11} {...}
{c |}{...}
 {res}      921
{txt}{ralign 9:2017m12} {...}
{c |}{...}
 {res}      870
{txt}{ralign 9: 2018m1} {...}
{c |}{...}
 {res}      906
{txt}{ralign 9: 2018m2} {...}
{c |}{...}
 {res}      908
{txt}{ralign 9: 2018m3} {...}
{c |}{...}
 {res}      896
{txt}{ralign 9: 2018m4} {...}
{c |}{...}
 {res}      875
{txt}{ralign 9: 2018m5} {...}
{c |}{...}
 {res}      878
{txt}{ralign 9: 2018m6} {...}
{c |}{...}
 {res}      873
{txt}{ralign 9: 2018m7} {...}
{c |}{...}
 {res}      910
{txt}{ralign 9: 2018m8} {...}
{c |}{...}
 {res}      897
{txt}{ralign 9: 2018m9} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9:2018m10} {...}
{c |}{...}
 {res}      931
{txt}{ralign 9:2018m11} {...}
{c |}{...}
 {res}      907
{txt}{ralign 9:2018m12} {...}
{c |}{...}
 {res}      855
{txt}{ralign 9: 2019m1} {...}
{c |}{...}
 {res}      937
{txt}{ralign 9: 2019m2} {...}
{c |}{...}
 {res}      917
{txt}{ralign 9: 2019m3} {...}
{c |}{...}
 {res}      925
{txt}{ralign 9: 2019m4} {...}
{c |}{...}
 {res}      912
{txt}{ralign 9: 2019m5} {...}
{c |}{...}
 {res}      895
{txt}{ralign 9: 2019m6} {...}
{c |}{...}
 {res}      896
{txt}{ralign 9: 2019m7} {...}
{c |}{...}
 {res}      908
{txt}{ralign 9: 2019m8} {...}
{c |}{...}
 {res}      894
{txt}{ralign 9: 2019m9} {...}
{c |}{...}
 {res}      904
{txt}{ralign 9:2019m10} {...}
{c |}{...}
 {res}      880
{txt}{ralign 9:2019m11} {...}
{c |}{...}
 {res}      867
{txt}{ralign 9:2019m12} {...}
{c |}{...}
 {res}      874
{txt}{ralign 9: 2020m1} {...}
{c |}{...}
 {res}      896
{txt}{ralign 9: 2020m2} {...}
{c |}{...}
 {res}      913
{txt}{ralign 9: 2020m3} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9: 2020m4} {...}
{c |}{...}
 {res}      895
{txt}{ralign 9: 2020m5} {...}
{c |}{...}
 {res}      872
{txt}{ralign 9: 2020m6} {...}
{c |}{...}
 {res}      802
{txt}{ralign 9: 2020m7} {...}
{c |}{...}
 {res}      807
{txt}{ralign 9: 2020m8} {...}
{c |}{...}
 {res}      797
{txt}{ralign 9: 2020m9} {...}
{c |}{...}
 {res}      783
{txt}{ralign 9:2020m10} {...}
{c |}{...}
 {res}      826
{txt}{ralign 9:2020m11} {...}
{c |}{...}
 {res}      843
{txt}{ralign 9:2020m12} {...}
{c |}{...}
 {res}      931
{txt}{ralign 9: 2021m1} {...}
{c |}{...}
 {res}      873
{txt}{ralign 9: 2021m2} {...}
{c |}{...}
 {res}      869
{txt}{ralign 9: 2021m3} {...}
{c |}{...}
 {res}      855
{txt}{ralign 9: 2021m4} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9: 2021m5} {...}
{c |}{...}
 {res}      872
{txt}{ralign 9: 2021m6} {...}
{c |}{...}
 {res}      930
{txt}{ralign 9: 2021m7} {...}
{c |}{...}
 {res}      881
{txt}{ralign 9: 2021m8} {...}
{c |}{...}
 {res}      917
{txt}{ralign 9: 2021m9} {...}
{c |}{...}
 {res}      900
{txt}{ralign 9:2021m10} {...}
{c |}{...}
 {res}      919
{txt}{ralign 9:2021m11} {...}
{c |}{...}
 {res}      917
{txt}{ralign 9:2021m12} {...}
{c |}{...}
 {res}      923
{txt}{ralign 9: 2022m1} {...}
{c |}{...}
 {res}      891
{txt}{ralign 9: 2022m2} {...}
{c |}{...}
 {res}      873
{txt}{ralign 9: 2022m3} {...}
{c |}{...}
 {res}      915
{txt}{ralign 9: 2022m4} {...}
{c |}{...}
 {res}      916
{txt}{ralign 9: 2022m5} {...}
{c |}{...}
 {res}      893
{txt}{ralign 9: 2022m6} {...}
{c |}{...}
 {res}      892
{txt}{ralign 9: 2022m7} {...}
{c |}{...}
 {res}      950
{txt}{ralign 9: 2022m8} {...}
{c |}{...}
 {res}      942
{txt}{ralign 9: 2022m9} {...}
{c |}{...}
 {res}      932
{txt}{ralign 9:2022m10} {...}
{c |}{...}
 {res}      869
{txt}{ralign 9:2022m11} {...}
{c |}{...}
 {res}      881
{txt}{ralign 9:2022m12} {...}
{c |}{...}
 {res}      858
{txt}{hline 10}{c +}{hline 10}
{ralign 9:Total} {...}
{c |}{...}
 {res}   103776
{txt}{hline 10}{c BT}{hline 10}

{com}. 
. *******************************
. **  Generate Variables       **
. *******************************
. 
. gen Incmean = .
{txt}(103,776 missing values generated)

{com}. gen Incvar = .
{txt}(103,776 missing values generated)

{com}. gen Inciqr = .
{txt}(103,776 missing values generated)

{com}. 
. gen Incmean_ch = .
{txt}(103,776 missing values generated)

{com}. gen Incvar_ch = .
{txt}(103,776 missing values generated)

{com}. gen Inciqr_ch = .
{txt}(103,776 missing values generated)

{com}. 
. 
. gen Inc_mom = .
{txt}(103,776 missing values generated)

{com}. gen Inc_mom_ch = .
{txt}(103,776 missing values generated)

{com}. 
. *** take the log
. 
. foreach mom in var{c -(}
{txt}  2{com}. gen linc`mom'= log(inc`mom') 
{txt}  3{com}. gen lrinc`mom' = log(rinc`mom') 
{txt}  4{com}. {c )-}
{txt}(26,963 missing values generated)
(31,277 missing values generated)

{com}. 
. 
. foreach mom in iqr{c -(}
{txt}  2{com}. gen linc`mom'= log(inc`mom') 
{txt}  3{com}. {c )-}
{txt}(18,757 missing values generated)

{com}. 
. label var linciqr "log perceived iqr"
{txt}
{com}. label var lincvar "log perceived risk"
{txt}
{com}. label var lrincvar "log perceived risk (real)"
{txt}
{com}. label var spending "expected growth in spending"
{txt}
{com}. label var spending_r "expected growth in spending (real)"
{txt}
{com}. 
. 
. *************************************
. *** Poisson rate in expectations 
. **************************************
. 
. 
. gen exp_s = log(1-UEprobInd4m)/(-3) 
{txt}(97,503 missing values generated)

{com}. * can use exp_eu from micro data 
. label var exp_s "expected Poisson separation rate"
{txt}
{com}. 
. gen exp_f =log(1-EUprobInd)/(-4)
{txt}(32,957 missing values generated)

{com}. * can use exp_ue from micro data 
. label var exp_f "expected Poisson job-finding rate"
{txt}
{com}. 
. gen exp_s_1y = log(1-UEprobInd)/(-12) 
{txt}(26,755 missing values generated)

{com}. * can use exp_eu from micro data 
. label var exp_s_1y "expected Poisson separation rate (1 year)"
{txt}
{com}. 
. 
. *************************************
. *** Variables for overreaction test 
. **************************************
. 
. ** earing expectation 
. 
. gen incexp_rv = incmean - l1.incmean
{txt}(46,771 missing values generated)

{com}. label var incexp_rv "revision in nominal wage growth expectation"
{txt}
{com}. 
. gen rincexp_rv = rincmean - l1.rincmean
{txt}(53,553 missing values generated)

{com}. label var rincexp_rv "revision in real wage growth expectation"
{txt}
{com}. 
. ** earning risk 
. 
. gen incvar_rv = incvar - l1.incvar 
{txt}(47,632 missing values generated)

{com}. label var incvar_rv "revision in nominal earning risk"
{txt}
{com}. 
. gen rincvar_rv = rincvar - l1.rincvar
{txt}(52,092 missing values generated)

{com}. label var rincvar "revision in earning risk"
{txt}
{com}. 
. gen rincvar_all_fe = rincvar-rincvar_all_rl
{txt}(46,780 missing values generated)

{com}. label var rincvar_all_fe "forecast error in earning risk"
{txt}
{com}. gen rincvar_sub_fe = rincvar-rincvar_sub_rl
{txt}(56,114 missing values generated)

{com}. label var rincvar_all_fe "forecast error in earning risk"
{txt}
{com}. 
. ** negative fe means underestimation 
. 
. foreach var in prisk2_all trisk2_all prisk2_sub trisk2_sub rincvar_all_now rincvar_sub_now{c -(}
{txt}  2{com}. gen `var'_ch = `var'-l1.`var'
{txt}  3{com}. {c )-}
{txt}(30,417 missing values generated)
(30,417 missing values generated)
(44,449 missing values generated)
(44,449 missing values generated)
(37,412 missing values generated)
(48,176 missing values generated)

{com}. 
. /*
> ** separation risk
> gen exp_s_1y_fe = exp_s_1y - f1.s
> label var exp_s_1y_fe "forecast error of separation rate"
> 
> gen exp_s_1y_rv = exp_s_1y - l1.exp_s_1y
> label var exp_s_1y_rv "revision in separation rate"
> 
> gen exp_s_fe = exp_s - f4.s
> label var exp_s_fe "forecast error of separation rate"
> 
> gen exp_s_rv = exp_s - l4.exp_s
> label var exp_s_rv "revision in separation rate"
> 
> gen exp_f_fe = exp_f - f1.f
> label var exp_s_fe "forecast error of separation rate"
> 
> gen exp_f_rv = exp_f - l1.exp_f
> label var exp_f_rv "revision in separation rate"
> */
. 
. ***********************************************
. **** Job experiences/transitions/search *****
. ***********************************************
. 
. gen emp_status = .
{txt}(103,776 missing values generated)

{com}. 
. replace emp_status = 1 if Q10_1==1|Q10_2==1|Q10_5==1
{txt}(86,481 real changes made)

{com}. replace emp_status = 2 if Q10_3==1|Q10_4==1
{txt}(4,552 real changes made)

{com}. replace emp_status = 3 if Q10_6==1|Q10_7==1|Q10_8==1|Q10_9==1
{txt}(16,566 real changes made)

{com}. 
. label define emp_status_lb 1 "employed" 2 "unemployed" 3 "non-working"
{txt}
{com}. label value emp_status emp_status_lb
{txt}
{com}. 
. gen e2u = cond(emp_status==2 & (l1.emp_status==1|l2.emp_status==1|l3.emp_status==1|l4.emp_status==1),1,0)
{txt}
{com}. label var e2u "employed since m-4 and unemployed now"
{txt}
{com}. 
. gen u2e = cond(emp_status==1 &  (l1.emp_status==2|l2.emp_status==2|l3.emp_status==2|l4.emp_status==2),1,0)
{txt}
{com}. label var u2e "unemployed since m-4 and employed now"
{txt}
{com}. 
. 
. gen e2um8 = cond(emp_status==2 & ///
>                  (l1.emp_status==1|l2.emp_status==1|l3.emp_status==1|l4.emp_status==1| ///
>                                   l5.emp_status==1|l6.emp_status==1|l7.emp_status==1|l8.emp_status==1),1,0)
{txt}
{com}. label var e2um8 "employed since m-8 and unemployed now"
{txt}
{com}. 
. gen u2em8 = cond(emp_status==1 &  ///
>                (l1.emp_status==2|l2.emp_status==2|l3.emp_status==2|l4.emp_status==2| ///
>                            l5.emp_status==2|l6.emp_status==2|l7.emp_status==2|l5.emp_status==2),1,0)
{txt}
{com}. label var u2em8 "unemployed since m-8 and employed now"
{txt}
{com}. 
. 
. gen e2um12 = cond(emp_status==2 & ///
>                  (l1.emp_status==1|l2.emp_status==1|l3.emp_status==1|l4.emp_status==1| ///
>                                   l5.emp_status==1|l6.emp_status==1|l7.emp_status==1|l8.emp_status==1| ///
>                                   l9.emp_status==1|l10.emp_status==1|l11.emp_status==1|l12.emp_status==1),1,0)
{txt}
{com}. label var e2um12 "employed since y-1 and unemployed now"
{txt}
{com}. 
. gen u2em12 = cond(emp_status==1 &  ///
>                (l1.emp_status==2|l2.emp_status==2|l3.emp_status==2|l4.emp_status==2| ///
>                            l5.emp_status==2|l6.emp_status==2|l7.emp_status==2|l5.emp_status==2| ///
>                             l9.emp_status==2|l10.emp_status==2|l11.emp_status==2|l12.emp_status==2),1,0)
{txt}
{com}. label var u2em12 "unemployed since y-1 and employed now"
{txt}
{com}. 
. *************************
. *** Exclude outliers *****
. *************************
. 
. local vars incvar rincvar l3
{txt}
{com}. 
. foreach var in `vars'{c -(}
{txt}  2{com}.       egen `var'pl=pctile(`var'),p(1)
{txt}  3{com}.           egen `var'pu=pctile(`var'),p(99)
{txt}  4{com}.           replace `var' = . if `var' <`var'pl | (`var' >`var'pu & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(2,369 real changes made, 2,369 to missing)
(784 real changes made, 784 to missing)
(201 real changes made, 201 to missing)

{com}. 
. *************************
. ** macro variables normalization
. *****************************
. 
. replace he = he*l3.CPIAU/CPIAU
{txt}(74,668 real changes made, 29,486 to missing)

{com}. label var he "real hourly earning growth"
{txt}
{com}. 
. gen ue_chg = uerate - l3.uerate
{txt}(58,594 missing values generated)

{com}. label var ue_chg "change in unemployment rate"
{txt}
{com}. 
. ************************
. ** group variables ****
. ************************
. ** age square
. gen age2 = age^2
{txt}
{com}. label var age2 "age squared"
{txt}
{com}. 
. 
. ***********************************
. ** new variables SCE realizations **
. **********************************
. 
. * log earning 
. gen wage_1y = l3*100/CPIAU
{txt}(93,640 missing values generated)

{com}. label var wage_1y "average real annual earning from primary job"
{txt}
{com}. 
. ** average earning 
. egen wage_1y_av = mean(wage_1y), by(ID)
{txt}(54,360 missing values generated)

{com}. label var wage_1y_av "average real annual earning across time"
{txt}
{com}. 
. ** income decile
. egen earning_gp = xtile(wage_1y_av), by(date) n(10) 
{txt}(54,360 missing values generated)

{com}. label var earning_gp "decile of earning from low to high"
{txt}
{com}. 
. gen lwage_1y = log(wage_1y)
{txt}(93,640 missing values generated)

{com}. label var lwage_1y "log average annual earning from primary job"
{txt}
{com}. 
. gen lwage_1y_gm4 = lwage_1y-l4.lwage_1y
{txt}(98,863 missing values generated)

{com}. label var lwage_1y_gm4 "log annual earning growth from previous m-4 to m"
{txt}
{com}. 
. egen lwage_1y_gm4_sd = sd(lwage_1y_gm4), by(date)
{txt}(90,164 missing values generated)

{com}. label var lwage_1y_gm4 "std log annual earning growth from previous m-4 to m"
{txt}
{com}. 
. ** generate cross-sectional std
. egen lwage_1y_sd = sd(lwage_1y), by(date)
{txt}(89,226 missing values generated)

{com}. 
. ** mincer regressions 
. reghdfe lwage_1y age age2, a(i.gender i.edu_g) resid
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     8,751
{txt}Absorbing 2 HDFE groups{col 51}F({res}   2{txt},{res}   8745{txt}){col 67}= {res}     58.44
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.1281
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1276
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0132
{txt}{col 51}Root MSE{col 67}= {res}    0.9399

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lwage_1y{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}  .087877{col 26}{space 2} .0085779{col 37}{space 1}   10.24{col 46}{space 3}0.000{col 54}{space 4} .0710623{col 67}{space 3} .1046917
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.0009885{col 26}{space 2}  .000101{col 37}{space 1}   -9.78{col 46}{space 3}0.000{col 54}{space 4}-.0011865{col 67}{space 3}-.0007904
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.991126{col 26}{space 2} .1740459{col 37}{space 1}   45.91{col 46}{space 3}0.000{col 54}{space 4} 7.649955{col 67}{space 3} 8.332297
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}      gender{col 14}{c |}{space 1}        2{col 27}{space 1}        0{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{res}{col 1}{text}       edu_g{col 14}{c |}{space 1}        3{col 27}{space 1}        1{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}
{com}. predict lwage_1y_shk, residuals
{txt}(95,025 missing values generated)

{com}. 
. * including aggregate shock
. reghdfe lwage_1y age age2, a(i.date i.gender i.edu_g) resid
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 4 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     8,751
{txt}Absorbing 3 HDFE groups{col 51}F({res}   2{txt},{res}   8730{txt}){col 67}= {res}     58.40
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.1296
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1276
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0132
{txt}{col 51}Root MSE{col 67}= {res}    0.9399

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lwage_1y{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}  .087862{col 26}{space 2}  .008584{col 37}{space 1}   10.24{col 46}{space 3}0.000{col 54}{space 4} .0710354{col 67}{space 3} .1046886
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.0009881{col 26}{space 2} .0001011{col 37}{space 1}   -9.77{col 46}{space 3}0.000{col 54}{space 4}-.0011863{col 67}{space 3}-.0007899
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.991048{col 26}{space 2} .1741738{col 37}{space 1}   45.88{col 46}{space 3}0.000{col 54}{space 4} 7.649627{col 67}{space 3}  8.33247
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}        date{col 14}{c |}{space 1}       16{col 27}{space 1}        0{col 39}{result}{space 1}       16{col 53}{text} {col 54}{c |}
{res}{col 1}{text}      gender{col 14}{c |}{space 1}        2{col 27}{space 1}        1{col 39}{result}{space 1}        1{col 53}{text} {col 54}{c |}
{res}{col 1}{text}       edu_g{col 14}{c |}{space 1}        3{col 27}{space 1}        1{col 39}{result}{space 1}        2{col 53}{text}?{col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
? = number of redundant parameters may be higher
{res}{txt}
{com}. predict lwage_1y_id_shk, residuals
{txt}(95,025 missing values generated)

{com}. 
. gen lwage_1y_ag_shk = lwage_1y_shk- lwage_1y_id_shk
{txt}(95,025 missing values generated)

{com}. 
. label var lwage_1y_shk "log wage shock"
{txt}
{com}. label var lwage_1y_id_shk "log wage idiosyncratic shock"
{txt}
{com}. label var lwage_1y_ag_shk "log wage aggregate shock"
{txt}
{com}. 
. ** first difference
. foreach var in lwage_1y_shk lwage_1y_id_shk lwage_1y_ag_shk{c -(}
{txt}  2{com}. gen `var'_gr = `var'- l4.`var'
{txt}  3{com}. {c )-}
{txt}(99,682 missing values generated)
(99,682 missing values generated)
(99,682 missing values generated)

{com}. 
. label var lwage_1y_shk_gr "log growth of unexplained wage"
{txt}
{com}. label var lwage_1y_id_shk_gr "log growth of idiosyncratic unexplained wage"
{txt}
{com}. label var lwage_1y_ag_shk_gr "log growth of aggregate unexplained wage"
{txt}
{com}. 
. 
. ** inequality  
. gen lwage_1y_shk2 = log(lwage_1y_shk^2)
{txt}(95,025 missing values generated)

{com}. label var lwage_1y_shk2 "squared log residuals"
{txt}
{com}. 
. ** volatility 
. gen lwage_1y_shk_gr2 = log(lwage_1y_shk_gr^2)
{txt}(99,682 missing values generated)

{com}. label var lwage_1y_shk_gr2 "squared log shocks"
{txt}
{com}. 
. egen lwage_1y_shk_gr_sd = sd(lwage_1y_shk_gr), by(date)
{txt}(90,164 missing values generated)

{com}. label var lwage_1y_shk_gr_sd "standard deviation of log shocks"
{txt}
{com}. 
. gen lwage_1y_shk_gr_var = lwage_1y_shk_gr_sd^2
{txt}(90,164 missing values generated)

{com}. label var lwage_1y_shk_gr_sd "var of log shocks"
{txt}
{com}. 
. 
. /*
> ***********************************************
> ** summary chart of unconditional wages ********
> ************************************************
> 
> preserve
> 
> collapse (mean) lwage_1y lwage_1y_sd, by(date year month) 
> ** average log wage whole sample
> twoway  (connected lwage_1y date) if lwage_1y!=., title("The mean of log real wages") 
> graph export "${c -(}graph_folder{c )-}/log_wage_av.png", as(png) replace 
> 
> ** std log wage whole sample
> twoway  (connected lwage_1y_sd date) if lwage_1y_sd!=., title("The standard deviation of log real wages") 
> graph export "${c -(}graph_folder{c )-}/log_wage_sd.png", as(png) replace 
> restore 
> 
> 
> ************************************************
> ** summary chart of conditional wages ********
> ************************************************
> 
> preserve
> 
> collapse (mean) lwage_1y_shk_gr lwage_1y_shk_gr_sd, by(year month date) 
> ** average log wage shock whole sample
> twoway  (connected lwage_1y_shk_gr date) if lwage_1y_shk_gr!=., title("The mean of log real wage shocks") 
> graph export "${c -(}graph_folder{c )-}/log_wage_shk_gr.png", as(png) replace 
> 
> ** std log wage whole sample
> twoway  (connected lwage_1y_shk_gr_sd date) if lwage_1y_shk_gr_sd!=., title("The standard deviation of log real wage shocks") 
> graph export "${c -(}graph_folder{c )-}/log_wage_shk_gr_sd.png", as(png) replace
> restore 
> */
. 
. ***************************************
. **** earning level and risk perceptions
. ***************************************
. 
. gen incsd = sqrt(incvar)
{txt}(29,332 missing values generated)

{com}. gen rincsd = sqrt(rincvar)
{txt}(32,061 missing values generated)

{com}. gen rincsd_all_rl = sqrt(rincvar_all_rl)
{txt}(21,552 missing values generated)

{com}. gen psd2_all_rl = sqrt(prisk2_all_rl)
{txt}(21,552 missing values generated)

{com}. gen tsd2_all_rl = sqrt(trisk2_all_rl)
{txt}(21,552 missing values generated)

{com}. 
. gen rincsd_sub_rl = sqrt(rincvar_sub_rl)
{txt}(35,853 missing values generated)

{com}. gen psd2_sub_rl = sqrt(prisk2_sub_rl)
{txt}(35,853 missing values generated)

{com}. gen tsd2_sub_rl = sqrt(trisk2_sub_rl)
{txt}(35,853 missing values generated)

{com}. 
. 
. graph bar rincsd, ///
>            over(earning_gp,relabel(1 "10%" 2 "20%" 3 "30%" 4 "40%" 5 "50%" 6 "60%" 7 "70%" 8 "80%" 9 "90%" 10 "100%")) ///
>                    bar(1, color(navy)) ///
>                    title("Perceived risk by real earning") ///
>                    b1title("earning decile") ///
>                    ytitle("Average perceived risk (std)") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_earning.png", as(png) replace 
{txt}{p 0 4 2}
file {bf}
C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Graphs\ind\/boxplot_rvar_earning.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. graph bar rincsd rincsd_sub_rl, ///
>                    bar(1, color(red) ) ///
>                    bar(2, lcolor(navy) fcolor(gs15) lpattern(dash) lwidth(medium)) ///
>                    title("Perceived and calibrated risk",size(med)) ///
>                    ytitle("Average risk (std)")  ///
>                    legend(pos(6) row(2) label(1 "perceived risk") label(2 "calibrated risk") )
{res}{p 0 4 2}
{txt}(note:  named style
med not found in class
gsize,  default attributes used)
{p_end}
{res}{txt}
{com}. 
. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_compare_simple.png", as(png) replace 
{txt}{p 0 4 2}
file {bf}
C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Graphs\ind\/boxplot_rvar_compare_simple.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. 
. graph bar rincsd incsd lwage_shk_gr_sd_age_sex rincsd_sub_rl psd2_sub_rl, ///
>                    bar(1, color(navy) ) ///
>                    bar(2, color(khaki)) ///
>                    bar(3, color(gray)) ///
>                    bar(4, color(cranberry)) ///
>                    bar(5, color(orange)) ///
>                    title("Perceived and calibrated risk by education",size(med)) ///
>                    ytitle("Average risk (std)")  ///
>                    legend(pos(6) row(2) label(1 "PR") label(2 "PR (nominal)") label(3 "volatility")  label(4 "calibrated risk") label(5 "calibrated permanent risk"))
{res}{p 0 4 2}
{txt}(note:  named style
med not found in class
gsize,  default attributes used)
{p_end}
{res}{txt}
{com}. 
. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_compare.png", as(png) replace 
{txt}{p 0 4 2}
file {bf}
C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Graphs\ind\/boxplot_rvar_compare.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. graph bar rincsd incsd lwage_shk_gr_sd_age_sex rincsd_sub_rl psd2_sub_rl if educ!=1 & age_5yr>25, ///
>            over(age_5yr) over(gender,relabel(1 "Male" 2 "Female")) ///
>                    bar(1, color(navy)) ///
>                    bar(2, color(khaki)) ///
>                    bar(3, color(gray)) ///
>                    bar(4, color(cranberry)) ///
>                    bar(5, color(orange)) ///
>                    title("Perceived and calibrated risk by age",size(med)) ///
>                    ytitle("Average risk (std)")  ///
>                    legend(pos(6)  row(2) label(1 "PR") label(2 "PR (nominal)") label(3 "volatility") label(4 "calibrated risk") label(5 "calibrated permanent risk"))
{res}{p 0 4 2}
{txt}(note:  named style
med not found in class
gsize,  default attributes used)
{p_end}
{res}{txt}
{com}. 
. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_compare_age.png", as(png) replace 
{txt}{p 0 4 2}
file {bf}
C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Graphs\ind\/boxplot_rvar_compare_age.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. 
. graph bar rincsd rincsd_sub_rl, ///
>            over(educ,relabel(1 "HS dropout" 2 "HS" 3 "College")) over(gender,relabel(1 "Male" 2 "Female")) ///
>                    bar(1, fcolor(red)) ///
>                    bar(2, lcolor(navy) fcolor(gs15) lpattern(dash) lwidth(medium)) ///
>                    title("Perceived and calibrated risk by education",size(med)) ///
>                    ytitle("Average risk (std)")  ///
>                    legend(pos(6) row(2) label(1 "perceived risk") label(2 "calibrated risk"))
{res}{p 0 4 2}
{txt}(note:  named style
med not found in class
gsize,  default attributes used)
{p_end}
{res}{txt}
{com}. 
. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_compare_educ_simple.png", as(png) replace 
{txt}{p 0 4 2}
file {bf}
C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Graphs\ind\/boxplot_rvar_compare_educ_simple.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. graph bar rincsd incsd lwage_shk_gr_sd_age_sex rincsd_sub_rl psd2_sub_rl, ///
>            over(educ,relabel(1 "HS dropout" 2 "HS" 3 "College")) over(gender,relabel(1 "Male" 2 "Female")) ///
>                    bar(1, color(navy) ) ///
>                    bar(2, color(khaki)) ///
>                    bar(3, color(gray)) ///
>                    bar(4, color(cranberry)) ///
>                    bar(5, color(orange)) ///
>                    title("Perceived and calibrated risk by education",size(med)) ///
>                    ytitle("Average risk (std)")  ///
>                    legend(pos(6) row(2) label(1 "PR") label(2 "PR (nominal)") label(3 "volatility")  label(4 "calibrated risk") label(5 "calibrated permanent risk"))
{res}{p 0 4 2}
{txt}(note:  named style
med not found in class
gsize,  default attributes used)
{p_end}
{res}{txt}
{com}. 
. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_compare_educ.png", as(png) replace 
{txt}{p 0 4 2}
file {bf}
C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Graphs\ind\/boxplot_rvar_compare_educ.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. 
. ********************************************************
. ** Compare risks between perception and realization **
. ********************************************************
. 
. tabout gender edu_g age_5 using "${c -(}sum_table_folder{c )-}/risks_compare.csv", ///
>             c(mean rincsd median rincsd mean lwage_shk_gr_sd_age_sex mean rincsd_sub_rl mean psd2_sub_rl mean tsd2_sub_rl ) ///
>                         f(3c 3c 3c 3c 3c 4c 4c) ///
>                         clab(PR(mean) PR(median) Volatility(median) CalibratedRisk PermanentRisk TransitoryRisk) ///
>                         sum npos(tufte) rep style(csv) bt cl2(2-4 5-6) cltr2(.75em 1.5em) 
{res}
{txt}Table output written to: C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Tables\/risks_compare.csv

{res},Mean,Median,Mean,Mean,Mean,Mean
,PR(mean),PR(median),Volatility(median),CalibratedRisk,PermanentRisk,TransitoryRisk
gender,,,,,,
1 (50%),0.031,0.024,0.356,0.103,0.097,0.0226
2 (49%),0.030,0.024,0.397,0.113,0.106,0.0270
Total (100%),0.030,0.024,0.376,0.108,0.101,0.0248

education group,,,,,,
HS dropout (0%),0.036,0.021,0.359,0.052,0.050,0.0067
HS graduate (40%),0.032,0.024,0.380,0.087,0.083,0.0160
College/above (58%),0.029,0.023,0.373,0.124,0.115,0.0311
Total (100%),0.030,0.023,0.376,0.108,0.101,0.0248

5-year age,,,,,,
20 (2%),0.038,0.032,0.382,0.069,0.068,0.0063
25 (12%),0.033,0.028,0.359,0.135,0.132,0.0107
30 (13%),0.031,0.025,0.338,0.104,0.096,0.0245
35 (14%),0.031,0.024,0.338,0.141,0.128,0.0476
40 (13%),0.030,0.023,0.433,0.102,0.093,0.0302
45 (14%),0.029,0.022,0.370,0.090,0.085,0.0195
50 (14%),0.029,0.021,0.351,0.099,0.095,0.0188
55 (15%),0.029,0.020,0.434,0.098,0.092,0.0230
Total (100%),0.030,0.023,0.376,0.108,0.101,0.0248
{txt}
{com}. 
. ***************************************
. **** unemployment experience and risk perceptions
. ***************************************
. 
. 
. graph bar rincsd, over(u2e,relabel(1 "other" 2 "recently unemployed")) ///
>          title("Perceived risk by unemployment experience") ///
>                  ytitle("Average perceived risk (std)") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_ue_peperience.png", as(png) replace 
{txt}{p 0 4 2}
file {bf}
C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Graphs\ind\/boxplot_rvar_ue_peperience.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. 
. graph bar rincsd, over(u2em12,relabel(1 "other" 2 "unemployed within past year")) ///
>          title("Perceived risk by unemployment experience") ///
>                  ytitle("Average perceived risk (std)") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_ue_peperience_m12.png", as(png) replace 
{txt}{p 0 4 2}
file {bf}
C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Graphs\ind\/boxplot_rvar_ue_peperience_m12.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. 
. 
. ************************************************
. ** exploring seasonal patterns ********
. ************************************************
. 
. ** charts 
. 
. graph bar incexp_rv, ///
>            over(month) ///
>                    bar(1, color(navy)) ///
>                    title("Revision in Expected Nominal Wage Growth") ///
>                    b1title("month") ///
>                    ytitle("Average revision in expected wage growth") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_exp_revision_month_of_year.png", as(png) replace 
{txt}{p 0 4 2}
file {bf}
C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Graphs\ind\/boxplot_exp_revision_month_of_year.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. 
. graph bar rincexp_rv, ///
>            over(month) ///
>                    bar(1, color(navy)) ///
>                    title("Revision in Expected Real Wage Growth") ///
>                    b1title("month") ///
>                    ytitle("Average revision in expected wage growth") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rexp_revision_month_of_year.png", as(png) replace 
{txt}{p 0 4 2}
file {bf}
C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Graphs\ind\/boxplot_rexp_revision_month_of_year.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. 
. graph bar incvar_rv, ///
>            over(month) ///
>                    bar(1, color(navy)) ///
>                    title("Revision in Expected Nominal Wage Risks") ///
>                    b1title("month") ///
>                    ytitle("Average perceived risk") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_var_revision_month_of_year.png", as(png) replace 
{txt}{p 0 4 2}
file {bf}
C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Graphs\ind\/boxplot_var_revision_month_of_year.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. 
. graph bar rincvar_rv, ///
>            over(month) ///
>                    bar(1, color(navy)) ///
>                    title("Revision in Expected Wage Risks") ///
>                    b1title("month") ///
>                    ytitle("Average perceived risk") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_revision_month_of_year.png", as(png) replace 
{txt}{p 0 4 2}
file {bf}
C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Graphs\ind\/boxplot_rvar_revision_month_of_year.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. 
. graph bar rincsd, ///
>            over(month) ///
>                    bar(1, color(navy)) ///
>                    title("Perceived risk by month of the year") ///
>                    b1title("month") ///
>                    ytitle("Average perceived risk (std)") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_month_of_year.png", as(png) replace 
{txt}{p 0 4 2}
file {bf}
C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Graphs\ind\/boxplot_rvar_month_of_year.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. ** regressions
. 
. eststo clear
{txt}
{com}. 
. eststo: reghdfe incexp i.month, a(ID)
{res}{txt}(dropped 1270 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    55,735
{txt}Absorbing 1 HDFE group{col 51}F({res}  11{txt},{res}  47694{txt}){col 67}= {res}      1.36
{txt}{col 51}Prob > F{col 67}= {res}    0.1833
{txt}{col 51}R-squared{col 67}= {res}    0.0667
{txt}{col 51}Adj R-squared{col 67}= {res}   -0.0906
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0003
{txt}{col 51}Root MSE{col 67}= {res}    0.0194

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   incexp_rv{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0005827{col 26}{space 2} .0004235{col 37}{space 1}   -1.38{col 46}{space 3}0.169{col 54}{space 4}-.0014128{col 67}{space 3} .0002474
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0001173{col 26}{space 2} .0004288{col 37}{space 1}    0.27{col 46}{space 3}0.784{col 54}{space 4}-.0007231{col 67}{space 3} .0009576
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-9.82e-06{col 26}{space 2} .0004313{col 37}{space 1}   -0.02{col 46}{space 3}0.982{col 54}{space 4}-.0008551{col 67}{space 3} .0008354
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.0001998{col 26}{space 2} .0004325{col 37}{space 1}   -0.46{col 46}{space 3}0.644{col 54}{space 4}-.0010475{col 67}{space 3}  .000648
{txt}{space 10}6  {c |}{col 14}{res}{space 2}  .000156{col 26}{space 2} .0004329{col 37}{space 1}    0.36{col 46}{space 3}0.719{col 54}{space 4}-.0006925{col 67}{space 3} .0010045
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.0003222{col 26}{space 2} .0004242{col 37}{space 1}   -0.76{col 46}{space 3}0.448{col 54}{space 4}-.0011537{col 67}{space 3} .0005092
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.0003238{col 26}{space 2} .0004239{col 37}{space 1}   -0.76{col 46}{space 3}0.445{col 54}{space 4}-.0011547{col 67}{space 3}  .000507
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.0002493{col 26}{space 2}  .000421{col 37}{space 1}   -0.59{col 46}{space 3}0.554{col 54}{space 4}-.0010746{col 67}{space 3} .0005759
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .0001844{col 26}{space 2} .0004202{col 37}{space 1}    0.44{col 46}{space 3}0.661{col 54}{space 4}-.0006391{col 67}{space 3}  .001008
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .0002216{col 26}{space 2} .0004194{col 37}{space 1}    0.53{col 46}{space 3}0.597{col 54}{space 4}-.0006005{col 67}{space 3} .0010436
{txt}{space 9}12  {c |}{col 14}{res}{space 2}  .000739{col 26}{space 2} .0004188{col 37}{space 1}    1.76{col 46}{space 3}0.078{col 54}{space 4}-.0000818{col 67}{space 3} .0015598
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0002642{col 26}{space 2} .0003054{col 37}{space 1}   -0.87{col 46}{space 3}0.387{col 54}{space 4}-.0008627{col 67}{space 3} .0003344
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     8030{col 27}{space 1}        0{col 39}{result}{space 1}     8030{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({res}est1{txt} stored)

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. estadd local hastid "Yes",replace

{txt}added macro:
             e(hastid) : "{res:Yes}"

{com}. 
. eststo: reghdfe rincexp i.month, a(ID)
{res}{txt}(dropped 1326 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    48,897
{txt}Absorbing 1 HDFE group{col 51}F({res}  11{txt},{res}  41449{txt}){col 67}= {res}      1.82
{txt}{col 51}Prob > F{col 67}= {res}    0.0457
{txt}{col 51}R-squared{col 67}= {res}    0.0766
{txt}{col 51}Adj R-squared{col 67}= {res}   -0.0893
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0005
{txt}{col 51}Root MSE{col 67}= {res}    0.0277

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  rincexp_rv{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0017303{col 26}{space 2} .0006433{col 37}{space 1}   -2.69{col 46}{space 3}0.007{col 54}{space 4}-.0029911{col 67}{space 3}-.0004695
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0010934{col 26}{space 2} .0006532{col 37}{space 1}   -1.67{col 46}{space 3}0.094{col 54}{space 4}-.0023737{col 67}{space 3}  .000187
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.0013459{col 26}{space 2} .0006603{col 37}{space 1}   -2.04{col 46}{space 3}0.042{col 54}{space 4}-.0026401{col 67}{space 3}-.0000517
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.0012982{col 26}{space 2} .0006635{col 37}{space 1}   -1.96{col 46}{space 3}0.050{col 54}{space 4}-.0025987{col 67}{space 3} 2.25e-06
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.0001644{col 26}{space 2} .0006627{col 37}{space 1}   -0.25{col 46}{space 3}0.804{col 54}{space 4}-.0014634{col 67}{space 3} .0011346
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.0005568{col 26}{space 2} .0006492{col 37}{space 1}   -0.86{col 46}{space 3}0.391{col 54}{space 4}-.0018292{col 67}{space 3} .0007155
{txt}{space 10}8  {c |}{col 14}{res}{space 2} -.000393{col 26}{space 2} .0006492{col 37}{space 1}   -0.61{col 46}{space 3}0.545{col 54}{space 4}-.0016655{col 67}{space 3} .0008796
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.0007605{col 26}{space 2} .0006432{col 37}{space 1}   -1.18{col 46}{space 3}0.237{col 54}{space 4}-.0020213{col 67}{space 3} .0005002
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.0008646{col 26}{space 2} .0006416{col 37}{space 1}   -1.35{col 46}{space 3}0.178{col 54}{space 4}-.0021221{col 67}{space 3}  .000393
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.0010296{col 26}{space 2} .0006416{col 37}{space 1}   -1.60{col 46}{space 3}0.109{col 54}{space 4}-.0022871{col 67}{space 3} .0002279
{txt}{space 9}12  {c |}{col 14}{res}{space 2} .0003877{col 26}{space 2} .0006396{col 37}{space 1}    0.61{col 46}{space 3}0.544{col 54}{space 4}-.0008659{col 67}{space 3} .0016414
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0010207{col 26}{space 2} .0004662{col 37}{space 1}    2.19{col 46}{space 3}0.029{col 54}{space 4}  .000107{col 67}{space 3} .0019344
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     7437{col 27}{space 1}        0{col 39}{result}{space 1}     7437{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({res}est2{txt} stored)

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. estadd local hastid "Yes",replace

{txt}added macro:
             e(hastid) : "{res:Yes}"

{com}. 
. eststo: reghdfe incvar i.month, a(ID)
{res}{txt}(dropped 2157 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    72,287
{txt}Absorbing 1 HDFE group{col 51}F({res}  11{txt},{res}  62535{txt}){col 67}= {res}      1.95
{txt}{col 51}Prob > F{col 67}= {res}    0.0291
{txt}{col 51}R-squared{col 67}= {res}    0.5884
{txt}{col 51}Adj R-squared{col 67}= {res}    0.5242
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0003
{txt}{col 51}Root MSE{col 67}= {res}    0.0006

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      incvar{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2} 2.42e-06{col 26}{space 2} .0000111{col 37}{space 1}    0.22{col 46}{space 3}0.828{col 54}{space 4}-.0000193{col 67}{space 3} .0000242
{txt}{space 10}3  {c |}{col 14}{res}{space 2} 8.06e-06{col 26}{space 2} .0000111{col 37}{space 1}    0.73{col 46}{space 3}0.468{col 54}{space 4}-.0000137{col 67}{space 3} .0000299
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0000122{col 26}{space 2} .0000112{col 37}{space 1}    1.09{col 46}{space 3}0.275{col 54}{space 4}-9.70e-06{col 67}{space 3} .0000341
{txt}{space 10}5  {c |}{col 14}{res}{space 2} 3.55e-07{col 26}{space 2} .0000112{col 37}{space 1}    0.03{col 46}{space 3}0.975{col 54}{space 4}-.0000216{col 67}{space 3} .0000223
{txt}{space 10}6  {c |}{col 14}{res}{space 2} 4.79e-06{col 26}{space 2}  .000011{col 37}{space 1}    0.43{col 46}{space 3}0.665{col 54}{space 4}-.0000168{col 67}{space 3} .0000264
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.0000169{col 26}{space 2}  .000011{col 37}{space 1}   -1.54{col 46}{space 3}0.122{col 54}{space 4}-.0000384{col 67}{space 3} 4.55e-06
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.0000169{col 26}{space 2} .0000109{col 37}{space 1}   -1.54{col 46}{space 3}0.123{col 54}{space 4}-.0000383{col 67}{space 3} 4.57e-06
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.0000232{col 26}{space 2} .0000109{col 37}{space 1}   -2.13{col 46}{space 3}0.033{col 54}{space 4}-.0000445{col 67}{space 3}-1.81e-06
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-7.75e-06{col 26}{space 2} .0000109{col 37}{space 1}   -0.71{col 46}{space 3}0.475{col 54}{space 4} -.000029{col 67}{space 3} .0000135
{txt}{space 9}11  {c |}{col 14}{res}{space 2} -.000011{col 26}{space 2} .0000109{col 37}{space 1}   -1.01{col 46}{space 3}0.311{col 54}{space 4}-.0000323{col 67}{space 3} .0000103
{txt}{space 9}12  {c |}{col 14}{res}{space 2}-3.99e-06{col 26}{space 2} .0000109{col 37}{space 1}   -0.37{col 46}{space 3}0.714{col 54}{space 4}-.0000254{col 67}{space 3} .0000174
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0004561{col 26}{space 2} 7.88e-06{col 37}{space 1}   57.87{col 46}{space 3}0.000{col 54}{space 4} .0004407{col 67}{space 3} .0004716
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     9741{col 27}{space 1}        0{col 39}{result}{space 1}     9741{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({res}est3{txt} stored)

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. estadd local hastid "Yes",replace

{txt}added macro:
             e(hastid) : "{res:Yes}"

{com}. 
. eststo: reghdfe rincvar i.month, a(ID)
{res}{txt}(dropped 2105 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    69,610
{txt}Absorbing 1 HDFE group{col 51}F({res}  11{txt},{res}  60094{txt}){col 67}= {res}      2.61
{txt}{col 51}Prob > F{col 67}= {res}    0.0025
{txt}{col 51}R-squared{col 67}= {res}    0.5530
{txt}{col 51}Adj R-squared{col 67}= {res}    0.4822
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0005
{txt}{col 51}Root MSE{col 67}= {res}    0.0013

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     rincvar{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0000594{col 26}{space 2} .0000253{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4}-.0001089{col 67}{space 3}-9.94e-06
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0000217{col 26}{space 2} .0000253{col 37}{space 1}    0.86{col 46}{space 3}0.391{col 54}{space 4}-.0000279{col 67}{space 3} .0000713
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0000358{col 26}{space 2} .0000254{col 37}{space 1}    1.41{col 46}{space 3}0.159{col 54}{space 4} -.000014{col 67}{space 3} .0000856
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .0000165{col 26}{space 2} .0000255{col 37}{space 1}    0.65{col 46}{space 3}0.517{col 54}{space 4}-.0000334{col 67}{space 3} .0000664
{txt}{space 10}6  {c |}{col 14}{res}{space 2} .0000219{col 26}{space 2} .0000251{col 37}{space 1}    0.87{col 46}{space 3}0.382{col 54}{space 4}-.0000273{col 67}{space 3} .0000711
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.0000219{col 26}{space 2} .0000249{col 37}{space 1}   -0.88{col 46}{space 3}0.380{col 54}{space 4}-.0000707{col 67}{space 3}  .000027
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.0000285{col 26}{space 2} .0000248{col 37}{space 1}   -1.15{col 46}{space 3}0.252{col 54}{space 4}-.0000771{col 67}{space 3} .0000202
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.0000235{col 26}{space 2} .0000248{col 37}{space 1}   -0.95{col 46}{space 3}0.343{col 54}{space 4}-.0000721{col 67}{space 3} .0000251
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.0000352{col 26}{space 2} .0000247{col 37}{space 1}   -1.43{col 46}{space 3}0.154{col 54}{space 4}-.0000835{col 67}{space 3} .0000132
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.0000196{col 26}{space 2} .0000247{col 37}{space 1}   -0.79{col 46}{space 3}0.428{col 54}{space 4}-.0000681{col 67}{space 3} .0000289
{txt}{space 9}12  {c |}{col 14}{res}{space 2}-.0000314{col 26}{space 2} .0000248{col 37}{space 1}   -1.27{col 46}{space 3}0.205{col 54}{space 4}-.0000801{col 67}{space 3} .0000172
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0013374{col 26}{space 2} .0000179{col 37}{space 1}   74.54{col 46}{space 3}0.000{col 54}{space 4} .0013022{col 67}{space 3} .0013726
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     9505{col 27}{space 1}        0{col 39}{result}{space 1}     9505{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({res}est4{txt} stored)

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. estadd local hastid "Yes",replace

{txt}added macro:
             e(hastid) : "{res:Yes}"

{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/ind/month_of_year_effect.csv", ///
>        stats(hasid hastid r2 N, label("Individual FE" "Time FE" "R-squared" "Sample Size")) ///
>            label mtitles se r2 ///
>            replace
{res}{txt}(output written to {browse  `"C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Tables\/ind/month_of_year_effect.csv"'})

{com}. 
. eststo clear
{txt}
{com}. 
. ************************************************
. ** time series dynamics of risk perceptions *****
. ************************************************
. 
. eststo clear
{txt}
{com}. 
. eststo: reghdfe lrincvar l1.lrincvar, a(ID)
{res}{txt}(dropped 1272 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    50,412
{txt}Absorbing 1 HDFE group{col 51}F({res}   1{txt},{res}  42677{txt}){col 67}= {res}    721.47
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.6866
{txt}{col 51}Adj R-squared{col 67}= {res}    0.6298
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0166
{txt}{col 51}Root MSE{col 67}= {res}    0.8047

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lrincvar{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}lrincvar {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1203909{col 26}{space 2} .0044821{col 37}{space 1}   26.86{col 46}{space 3}0.000{col 54}{space 4} .1116058{col 67}{space 3}  .129176
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} -6.62089{col 26}{space 2}  .033526{col 37}{space 1} -197.49{col 46}{space 3}0.000{col 54}{space 4}-6.686602{col 67}{space 3}-6.555178
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     7734{col 27}{space 1}        0{col 39}{result}{space 1}     7734{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({res}est1{txt} stored)

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. estadd local hastid "No",replace

{txt}added macro:
             e(hastid) : "{res:No}"

{com}. 
. eststo: reghdfe lrincvar l1.lrincvar l2.lrincvar , a(ID)
{res}{txt}(dropped 1103 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    37,843
{txt}Absorbing 1 HDFE group{col 51}F({res}   2{txt},{res}  31498{txt}){col 67}= {res}     74.48
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.7193
{txt}{col 51}Adj R-squared{col 67}= {res}    0.6628
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0047
{txt}{col 51}Root MSE{col 67}= {res}    0.7547

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lrincvar{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}lrincvar {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}  .050525{col 26}{space 2} .0053751{col 37}{space 1}    9.40{col 46}{space 3}0.000{col 54}{space 4} .0399895{col 67}{space 3} .0610605
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .0346728{col 26}{space 2} .0050028{col 37}{space 1}    6.93{col 46}{space 3}0.000{col 54}{space 4} .0248671{col 67}{space 3} .0444785
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-6.911223{col 26}{space 2} .0524795{col 37}{space 1} -131.69{col 46}{space 3}0.000{col 54}{space 4}-7.014085{col 67}{space 3}-6.808361
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     6343{col 27}{space 1}        0{col 39}{result}{space 1}     6343{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({res}est2{txt} stored)

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. estadd local hastid "No",replace

{txt}added macro:
             e(hastid) : "{res:No}"

{com}. 
. eststo: reghdfe lrincvar l1.lrincvar i.date, a(ID)
{res}{txt}(dropped 1272 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    50,412
{txt}Absorbing 1 HDFE group{col 51}F({res} 114{txt},{res}  42564{txt}){col 67}= {res}     15.61
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.6941
{txt}{col 51}Adj R-squared{col 67}= {res}    0.6377
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0401
{txt}{col 51}Root MSE{col 67}= {res}    0.7960

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lrincvar{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}lrincvar {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0914249{col 26}{space 2} .0045548{col 37}{space 1}   20.07{col 46}{space 3}0.000{col 54}{space 4} .0824974{col 67}{space 3} .1003524
{txt}{space 12} {c |}
{space 8}date {c |}
{space 8}643  {c |}{col 14}{res}{space 2} .0687114{col 26}{space 2} .0597837{col 37}{space 1}    1.15{col 46}{space 3}0.250{col 54}{space 4}-.0484658{col 67}{space 3} .1858886
{txt}{space 8}644  {c |}{col 14}{res}{space 2} .0037978{col 26}{space 2} .0615728{col 37}{space 1}    0.06{col 46}{space 3}0.951{col 54}{space 4}-.1168861{col 67}{space 3} .1244817
{txt}{space 8}645  {c |}{col 14}{res}{space 2}  -.02236{col 26}{space 2} .0619576{col 37}{space 1}   -0.36{col 46}{space 3}0.718{col 54}{space 4}-.1437982{col 67}{space 3} .0990782
{txt}{space 8}646  {c |}{col 14}{res}{space 2}-.1028436{col 26}{space 2} .0626399{col 37}{space 1}   -1.64{col 46}{space 3}0.101{col 54}{space 4} -.225619{col 67}{space 3} .0199319
{txt}{space 8}647  {c |}{col 14}{res}{space 2}-.1008301{col 26}{space 2} .0675029{col 37}{space 1}   -1.49{col 46}{space 3}0.135{col 54}{space 4}-.2331371{col 67}{space 3}  .031477
{txt}{space 8}648  {c |}{col 14}{res}{space 2}-.2412948{col 26}{space 2} .0685741{col 37}{space 1}   -3.52{col 46}{space 3}0.000{col 54}{space 4}-.3757013{col 67}{space 3}-.1068883
{txt}{space 8}649  {c |}{col 14}{res}{space 2} -.201835{col 26}{space 2} .0693127{col 37}{space 1}   -2.91{col 46}{space 3}0.004{col 54}{space 4}-.3376893{col 67}{space 3}-.0659807
{txt}{space 8}650  {c |}{col 14}{res}{space 2}-.2345885{col 26}{space 2}  .070704{col 37}{space 1}   -3.32{col 46}{space 3}0.001{col 54}{space 4}-.3731697{col 67}{space 3}-.0960073
{txt}{space 8}651  {c |}{col 14}{res}{space 2}-.3267325{col 26}{space 2} .0724724{col 37}{space 1}   -4.51{col 46}{space 3}0.000{col 54}{space 4}-.4687799{col 67}{space 3}-.1846852
{txt}{space 8}652  {c |}{col 14}{res}{space 2}-.3288128{col 26}{space 2} .0737493{col 37}{space 1}   -4.46{col 46}{space 3}0.000{col 54}{space 4}-.4733629{col 67}{space 3}-.1842626
{txt}{space 8}653  {c |}{col 14}{res}{space 2}-.3282203{col 26}{space 2} .0747748{col 37}{space 1}   -4.39{col 46}{space 3}0.000{col 54}{space 4}-.4747803{col 67}{space 3}-.1816603
{txt}{space 8}654  {c |}{col 14}{res}{space 2}-.3922164{col 26}{space 2} .0748601{col 37}{space 1}   -5.24{col 46}{space 3}0.000{col 54}{space 4}-.5389437{col 67}{space 3} -.245489
{txt}{space 8}655  {c |}{col 14}{res}{space 2}-.4032705{col 26}{space 2} .0757893{col 37}{space 1}   -5.32{col 46}{space 3}0.000{col 54}{space 4} -.551819{col 67}{space 3} -.254722
{txt}{space 8}656  {c |}{col 14}{res}{space 2}-.4161967{col 26}{space 2} .0774274{col 37}{space 1}   -5.38{col 46}{space 3}0.000{col 54}{space 4} -.567956{col 67}{space 3}-.2644374
{txt}{space 8}657  {c |}{col 14}{res}{space 2}-.5080311{col 26}{space 2} .0789322{col 37}{space 1}   -6.44{col 46}{space 3}0.000{col 54}{space 4}-.6627397{col 67}{space 3}-.3533224
{txt}{space 8}658  {c |}{col 14}{res}{space 2} -.501087{col 26}{space 2} .0803438{col 37}{space 1}   -6.24{col 46}{space 3}0.000{col 54}{space 4}-.6585624{col 67}{space 3}-.3436115
{txt}{space 8}659  {c |}{col 14}{res}{space 2}-.5242546{col 26}{space 2} .0816922{col 37}{space 1}   -6.42{col 46}{space 3}0.000{col 54}{space 4}-.6843729{col 67}{space 3}-.3641363
{txt}{space 8}660  {c |}{col 14}{res}{space 2}-.6208112{col 26}{space 2} .0833889{col 37}{space 1}   -7.44{col 46}{space 3}0.000{col 54}{space 4} -.784255{col 67}{space 3}-.4573673
{txt}{space 8}661  {c |}{col 14}{res}{space 2}-.6538674{col 26}{space 2} .0843781{col 37}{space 1}   -7.75{col 46}{space 3}0.000{col 54}{space 4}-.8192502{col 67}{space 3}-.4884847
{txt}{space 8}662  {c |}{col 14}{res}{space 2}-.6234763{col 26}{space 2} .0856842{col 37}{space 1}   -7.28{col 46}{space 3}0.000{col 54}{space 4} -.791419{col 67}{space 3}-.4555337
{txt}{space 8}663  {c |}{col 14}{res}{space 2}-.6502759{col 26}{space 2} .0871268{col 37}{space 1}   -7.46{col 46}{space 3}0.000{col 54}{space 4}-.8210462{col 67}{space 3}-.4795056
{txt}{space 8}664  {c |}{col 14}{res}{space 2}-.7458025{col 26}{space 2} .0876124{col 37}{space 1}   -8.51{col 46}{space 3}0.000{col 54}{space 4}-.9175246{col 67}{space 3}-.5740805
{txt}{space 8}665  {c |}{col 14}{res}{space 2}-.6454743{col 26}{space 2} .0879683{col 37}{space 1}   -7.34{col 46}{space 3}0.000{col 54}{space 4} -.817894{col 67}{space 3}-.4730547
{txt}{space 8}666  {c |}{col 14}{res}{space 2}-.6840585{col 26}{space 2} .0890138{col 37}{space 1}   -7.68{col 46}{space 3}0.000{col 54}{space 4}-.8585273{col 67}{space 3}-.5095898
{txt}{space 8}667  {c |}{col 14}{res}{space 2}-.7587944{col 26}{space 2} .0904877{col 37}{space 1}   -8.39{col 46}{space 3}0.000{col 54}{space 4} -.936152{col 67}{space 3}-.5814367
{txt}{space 8}668  {c |}{col 14}{res}{space 2}-.8077993{col 26}{space 2} .0917257{col 37}{space 1}   -8.81{col 46}{space 3}0.000{col 54}{space 4}-.9875836{col 67}{space 3}-.6280151
{txt}{space 8}669  {c |}{col 14}{res}{space 2}-.9388747{col 26}{space 2} .0923044{col 37}{space 1}  -10.17{col 46}{space 3}0.000{col 54}{space 4}-1.119793{col 67}{space 3}-.7579562
{txt}{space 8}670  {c |}{col 14}{res}{space 2}-.9324552{col 26}{space 2} .0931848{col 37}{space 1}  -10.01{col 46}{space 3}0.000{col 54}{space 4}-1.115099{col 67}{space 3}-.7498112
{txt}{space 8}671  {c |}{col 14}{res}{space 2}-1.003407{col 26}{space 2} .0943622{col 37}{space 1}  -10.63{col 46}{space 3}0.000{col 54}{space 4}-1.188359{col 67}{space 3}-.8184554
{txt}{space 8}672  {c |}{col 14}{res}{space 2}-1.024445{col 26}{space 2} .0951759{col 37}{space 1}  -10.76{col 46}{space 3}0.000{col 54}{space 4}-1.210991{col 67}{space 3} -.837898
{txt}{space 8}673  {c |}{col 14}{res}{space 2} -1.11917{col 26}{space 2} .0965397{col 37}{space 1}  -11.59{col 46}{space 3}0.000{col 54}{space 4} -1.30839{col 67}{space 3}-.9299505
{txt}{space 8}674  {c |}{col 14}{res}{space 2}-1.059293{col 26}{space 2} .0974786{col 37}{space 1}  -10.87{col 46}{space 3}0.000{col 54}{space 4}-1.250353{col 67}{space 3}-.8682329
{txt}{space 8}675  {c |}{col 14}{res}{space 2}-1.134785{col 26}{space 2} .0983046{col 37}{space 1}  -11.54{col 46}{space 3}0.000{col 54}{space 4}-1.327464{col 67}{space 3}-.9421061
{txt}{space 8}676  {c |}{col 14}{res}{space 2}-1.154079{col 26}{space 2} .0992057{col 37}{space 1}  -11.63{col 46}{space 3}0.000{col 54}{space 4}-1.348524{col 67}{space 3}-.9596336
{txt}{space 8}677  {c |}{col 14}{res}{space 2}-1.185731{col 26}{space 2} .0995325{col 37}{space 1}  -11.91{col 46}{space 3}0.000{col 54}{space 4}-1.380817{col 67}{space 3}-.9906455
{txt}{space 8}678  {c |}{col 14}{res}{space 2} -1.17446{col 26}{space 2} .1003198{col 37}{space 1}  -11.71{col 46}{space 3}0.000{col 54}{space 4}-1.371089{col 67}{space 3}-.9778311
{txt}{space 8}679  {c |}{col 14}{res}{space 2}-1.164806{col 26}{space 2} .1019742{col 37}{space 1}  -11.42{col 46}{space 3}0.000{col 54}{space 4}-1.364678{col 67}{space 3}-.9649348
{txt}{space 8}680  {c |}{col 14}{res}{space 2}-1.271047{col 26}{space 2} .1024798{col 37}{space 1}  -12.40{col 46}{space 3}0.000{col 54}{space 4} -1.47191{col 67}{space 3}-1.070185
{txt}{space 8}681  {c |}{col 14}{res}{space 2}-1.236981{col 26}{space 2} .1032005{col 37}{space 1}  -11.99{col 46}{space 3}0.000{col 54}{space 4}-1.439256{col 67}{space 3}-1.034706
{txt}{space 8}682  {c |}{col 14}{res}{space 2}-1.195523{col 26}{space 2} .1043924{col 37}{space 1}  -11.45{col 46}{space 3}0.000{col 54}{space 4}-1.400134{col 67}{space 3}-.9909121
{txt}{space 8}683  {c |}{col 14}{res}{space 2}-1.264237{col 26}{space 2} .1049108{col 37}{space 1}  -12.05{col 46}{space 3}0.000{col 54}{space 4}-1.469864{col 67}{space 3}-1.058609
{txt}{space 8}684  {c |}{col 14}{res}{space 2}-1.203309{col 26}{space 2} .1058807{col 37}{space 1}  -11.36{col 46}{space 3}0.000{col 54}{space 4}-1.410837{col 67}{space 3}-.9957807
{txt}{space 8}685  {c |}{col 14}{res}{space 2} -1.32446{col 26}{space 2} .1068018{col 37}{space 1}  -12.40{col 46}{space 3}0.000{col 54}{space 4}-1.533794{col 67}{space 3}-1.115127
{txt}{space 8}686  {c |}{col 14}{res}{space 2}-1.446519{col 26}{space 2} .1077983{col 37}{space 1}  -13.42{col 46}{space 3}0.000{col 54}{space 4}-1.657806{col 67}{space 3}-1.235232
{txt}{space 8}687  {c |}{col 14}{res}{space 2}-1.527619{col 26}{space 2} .1083985{col 37}{space 1}  -14.09{col 46}{space 3}0.000{col 54}{space 4}-1.740082{col 67}{space 3}-1.315156
{txt}{space 8}688  {c |}{col 14}{res}{space 2} -1.62109{col 26}{space 2} .1094315{col 37}{space 1}  -14.81{col 46}{space 3}0.000{col 54}{space 4}-1.835578{col 67}{space 3}-1.406603
{txt}{space 8}689  {c |}{col 14}{res}{space 2} -1.52848{col 26}{space 2} .1099191{col 37}{space 1}  -13.91{col 46}{space 3}0.000{col 54}{space 4}-1.743924{col 67}{space 3}-1.313037
{txt}{space 8}690  {c |}{col 14}{res}{space 2}-1.620571{col 26}{space 2} .1105826{col 37}{space 1}  -14.65{col 46}{space 3}0.000{col 54}{space 4}-1.837315{col 67}{space 3}-1.403827
{txt}{space 8}691  {c |}{col 14}{res}{space 2} -1.72997{col 26}{space 2} .1115281{col 37}{space 1}  -15.51{col 46}{space 3}0.000{col 54}{space 4}-1.948567{col 67}{space 3}-1.511372
{txt}{space 8}692  {c |}{col 14}{res}{space 2}-1.654693{col 26}{space 2} .1125683{col 37}{space 1}  -14.70{col 46}{space 3}0.000{col 54}{space 4} -1.87533{col 67}{space 3}-1.434057
{txt}{space 8}693  {c |}{col 14}{res}{space 2}-1.774675{col 26}{space 2} .1133111{col 37}{space 1}  -15.66{col 46}{space 3}0.000{col 54}{space 4}-1.996767{col 67}{space 3}-1.552583
{txt}{space 8}694  {c |}{col 14}{res}{space 2}-1.791387{col 26}{space 2} .1139797{col 37}{space 1}  -15.72{col 46}{space 3}0.000{col 54}{space 4} -2.01479{col 67}{space 3}-1.567985
{txt}{space 8}695  {c |}{col 14}{res}{space 2} -1.83105{col 26}{space 2}  .115112{col 37}{space 1}  -15.91{col 46}{space 3}0.000{col 54}{space 4}-2.056672{col 67}{space 3}-1.605428
{txt}{space 8}696  {c |}{col 14}{res}{space 2}-1.859564{col 26}{space 2} .1164831{col 37}{space 1}  -15.96{col 46}{space 3}0.000{col 54}{space 4}-2.087874{col 67}{space 3}-1.631255
{txt}{space 8}697  {c |}{col 14}{res}{space 2}-1.880366{col 26}{space 2}  .117086{col 37}{space 1}  -16.06{col 46}{space 3}0.000{col 54}{space 4}-2.109857{col 67}{space 3}-1.650875
{txt}{space 8}698  {c |}{col 14}{res}{space 2}-2.031488{col 26}{space 2} .1175954{col 37}{space 1}  -17.28{col 46}{space 3}0.000{col 54}{space 4}-2.261978{col 67}{space 3}-1.800999
{txt}{space 8}699  {c |}{col 14}{res}{space 2} -1.96908{col 26}{space 2} .1187969{col 37}{space 1}  -16.58{col 46}{space 3}0.000{col 54}{space 4}-2.201924{col 67}{space 3}-1.736235
{txt}{space 8}700  {c |}{col 14}{res}{space 2} -2.03027{col 26}{space 2}  .119673{col 37}{space 1}  -16.97{col 46}{space 3}0.000{col 54}{space 4}-2.264831{col 67}{space 3}-1.795709
{txt}{space 8}701  {c |}{col 14}{res}{space 2} -2.00902{col 26}{space 2} .1206838{col 37}{space 1}  -16.65{col 46}{space 3}0.000{col 54}{space 4}-2.245562{col 67}{space 3}-1.772477
{txt}{space 8}702  {c |}{col 14}{res}{space 2}-2.146993{col 26}{space 2} .1213276{col 37}{space 1}  -17.70{col 46}{space 3}0.000{col 54}{space 4}-2.384797{col 67}{space 3}-1.909189
{txt}{space 8}703  {c |}{col 14}{res}{space 2}-2.284278{col 26}{space 2} .1217245{col 37}{space 1}  -18.77{col 46}{space 3}0.000{col 54}{space 4} -2.52286{col 67}{space 3}-2.045695
{txt}{space 8}704  {c |}{col 14}{res}{space 2}-2.261519{col 26}{space 2} .1229333{col 37}{space 1}  -18.40{col 46}{space 3}0.000{col 54}{space 4}-2.502471{col 67}{space 3}-2.020568
{txt}{space 8}705  {c |}{col 14}{res}{space 2}-2.317076{col 26}{space 2} .1236494{col 37}{space 1}  -18.74{col 46}{space 3}0.000{col 54}{space 4}-2.559431{col 67}{space 3} -2.07472
{txt}{space 8}706  {c |}{col 14}{res}{space 2}-2.330667{col 26}{space 2} .1243478{col 37}{space 1}  -18.74{col 46}{space 3}0.000{col 54}{space 4}-2.574391{col 67}{space 3}-2.086943
{txt}{space 8}707  {c |}{col 14}{res}{space 2}-2.355343{col 26}{space 2} .1256632{col 37}{space 1}  -18.74{col 46}{space 3}0.000{col 54}{space 4}-2.601646{col 67}{space 3}-2.109041
{txt}{space 8}708  {c |}{col 14}{res}{space 2}-2.375498{col 26}{space 2} .1259964{col 37}{space 1}  -18.85{col 46}{space 3}0.000{col 54}{space 4}-2.622453{col 67}{space 3}-2.128543
{txt}{space 8}709  {c |}{col 14}{res}{space 2}-2.502127{col 26}{space 2} .1264934{col 37}{space 1}  -19.78{col 46}{space 3}0.000{col 54}{space 4}-2.750056{col 67}{space 3}-2.254197
{txt}{space 8}710  {c |}{col 14}{res}{space 2} -2.58409{col 26}{space 2}  .127053{col 37}{space 1}  -20.34{col 46}{space 3}0.000{col 54}{space 4}-2.833117{col 67}{space 3}-2.335064
{txt}{space 8}711  {c |}{col 14}{res}{space 2}-2.666146{col 26}{space 2} .1282247{col 37}{space 1}  -20.79{col 46}{space 3}0.000{col 54}{space 4}-2.917468{col 67}{space 3}-2.414823
{txt}{space 8}712  {c |}{col 14}{res}{space 2}-2.604488{col 26}{space 2} .1290517{col 37}{space 1}  -20.18{col 46}{space 3}0.000{col 54}{space 4}-2.857432{col 67}{space 3}-2.351544
{txt}{space 8}713  {c |}{col 14}{res}{space 2}-2.687871{col 26}{space 2} .1298548{col 37}{space 1}  -20.70{col 46}{space 3}0.000{col 54}{space 4}-2.942389{col 67}{space 3}-2.433353
{txt}{space 8}714  {c |}{col 14}{res}{space 2}-2.851215{col 26}{space 2} .1301819{col 37}{space 1}  -21.90{col 46}{space 3}0.000{col 54}{space 4}-3.106375{col 67}{space 3}-2.596056
{txt}{space 8}715  {c |}{col 14}{res}{space 2}-2.898405{col 26}{space 2} .1313014{col 37}{space 1}  -22.07{col 46}{space 3}0.000{col 54}{space 4}-3.155759{col 67}{space 3}-2.641052
{txt}{space 8}716  {c |}{col 14}{res}{space 2}-2.852076{col 26}{space 2} .1320993{col 37}{space 1}  -21.59{col 46}{space 3}0.000{col 54}{space 4}-3.110993{col 67}{space 3}-2.593159
{txt}{space 8}717  {c |}{col 14}{res}{space 2}-2.882037{col 26}{space 2} .1323286{col 37}{space 1}  -21.78{col 46}{space 3}0.000{col 54}{space 4}-3.141404{col 67}{space 3}-2.622671
{txt}{space 8}718  {c |}{col 14}{res}{space 2}-3.023634{col 26}{space 2} .1331965{col 37}{space 1}  -22.70{col 46}{space 3}0.000{col 54}{space 4}-3.284702{col 67}{space 3}-2.762566
{txt}{space 8}719  {c |}{col 14}{res}{space 2}-3.021094{col 26}{space 2} .1344192{col 37}{space 1}  -22.48{col 46}{space 3}0.000{col 54}{space 4}-3.284558{col 67}{space 3} -2.75763
{txt}{space 8}720  {c |}{col 14}{res}{space 2}-3.116396{col 26}{space 2} .1348357{col 37}{space 1}  -23.11{col 46}{space 3}0.000{col 54}{space 4}-3.380677{col 67}{space 3}-2.852116
{txt}{space 8}721  {c |}{col 14}{res}{space 2}-3.198545{col 26}{space 2} .1353559{col 37}{space 1}  -23.63{col 46}{space 3}0.000{col 54}{space 4}-3.463846{col 67}{space 3}-2.933245
{txt}{space 8}722  {c |}{col 14}{res}{space 2}-2.930139{col 26}{space 2} .1363049{col 37}{space 1}  -21.50{col 46}{space 3}0.000{col 54}{space 4}-3.197299{col 67}{space 3}-2.662978
{txt}{space 8}723  {c |}{col 14}{res}{space 2}-2.876276{col 26}{space 2} .1367897{col 37}{space 1}  -21.03{col 46}{space 3}0.000{col 54}{space 4}-3.144386{col 67}{space 3}-2.608165
{txt}{space 8}724  {c |}{col 14}{res}{space 2} -2.95847{col 26}{space 2} .1374858{col 37}{space 1}  -21.52{col 46}{space 3}0.000{col 54}{space 4}-3.227945{col 67}{space 3}-2.688995
{txt}{space 8}725  {c |}{col 14}{res}{space 2}-3.229522{col 26}{space 2} .1385313{col 37}{space 1}  -23.31{col 46}{space 3}0.000{col 54}{space 4}-3.501046{col 67}{space 3}-2.957998
{txt}{space 8}726  {c |}{col 14}{res}{space 2}-3.283842{col 26}{space 2} .1399524{col 37}{space 1}  -23.46{col 46}{space 3}0.000{col 54}{space 4}-3.558151{col 67}{space 3}-3.009532
{txt}{space 8}727  {c |}{col 14}{res}{space 2}-3.271595{col 26}{space 2} .1407862{col 37}{space 1}  -23.24{col 46}{space 3}0.000{col 54}{space 4}-3.547539{col 67}{space 3}-2.995651
{txt}{space 8}728  {c |}{col 14}{res}{space 2} -3.34507{col 26}{space 2} .1416465{col 37}{space 1}  -23.62{col 46}{space 3}0.000{col 54}{space 4}  -3.6227{col 67}{space 3} -3.06744
{txt}{space 8}729  {c |}{col 14}{res}{space 2}-3.289514{col 26}{space 2} .1417494{col 37}{space 1}  -23.21{col 46}{space 3}0.000{col 54}{space 4}-3.567345{col 67}{space 3}-3.011682
{txt}{space 8}730  {c |}{col 14}{res}{space 2}-3.345018{col 26}{space 2} .1417961{col 37}{space 1}  -23.59{col 46}{space 3}0.000{col 54}{space 4}-3.622942{col 67}{space 3}-3.067095
{txt}{space 8}731  {c |}{col 14}{res}{space 2}-3.328689{col 26}{space 2} .1419741{col 37}{space 1}  -23.45{col 46}{space 3}0.000{col 54}{space 4}-3.606961{col 67}{space 3}-3.050417
{txt}{space 8}732  {c |}{col 14}{res}{space 2}-3.370912{col 26}{space 2} .1427911{col 37}{space 1}  -23.61{col 46}{space 3}0.000{col 54}{space 4}-3.650786{col 67}{space 3}-3.091039
{txt}{space 8}733  {c |}{col 14}{res}{space 2} -3.45373{col 26}{space 2} .1437771{col 37}{space 1}  -24.02{col 46}{space 3}0.000{col 54}{space 4}-3.735536{col 67}{space 3}-3.171924
{txt}{space 8}734  {c |}{col 14}{res}{space 2}-3.534059{col 26}{space 2} .1452482{col 37}{space 1}  -24.33{col 46}{space 3}0.000{col 54}{space 4}-3.818749{col 67}{space 3} -3.24937
{txt}{space 8}735  {c |}{col 14}{res}{space 2}-3.513381{col 26}{space 2} .1453687{col 37}{space 1}  -24.17{col 46}{space 3}0.000{col 54}{space 4}-3.798306{col 67}{space 3}-3.228456
{txt}{space 8}736  {c |}{col 14}{res}{space 2}-3.477793{col 26}{space 2} .1457303{col 37}{space 1}  -23.86{col 46}{space 3}0.000{col 54}{space 4}-3.763428{col 67}{space 3}-3.192159
{txt}{space 8}737  {c |}{col 14}{res}{space 2}-3.471138{col 26}{space 2} .1459943{col 37}{space 1}  -23.78{col 46}{space 3}0.000{col 54}{space 4} -3.75729{col 67}{space 3}-3.184986
{txt}{space 8}738  {c |}{col 14}{res}{space 2} -3.54381{col 26}{space 2} .1464216{col 37}{space 1}  -24.20{col 46}{space 3}0.000{col 54}{space 4}-3.830799{col 67}{space 3}-3.256821
{txt}{space 8}739  {c |}{col 14}{res}{space 2}-3.567561{col 26}{space 2} .1468523{col 37}{space 1}  -24.29{col 46}{space 3}0.000{col 54}{space 4}-3.855395{col 67}{space 3}-3.279728
{txt}{space 8}740  {c |}{col 14}{res}{space 2}-3.528934{col 26}{space 2} .1473894{col 37}{space 1}  -23.94{col 46}{space 3}0.000{col 54}{space 4} -3.81782{col 67}{space 3}-3.240048
{txt}{space 8}741  {c |}{col 14}{res}{space 2}-3.536494{col 26}{space 2} .1481586{col 37}{space 1}  -23.87{col 46}{space 3}0.000{col 54}{space 4}-3.826888{col 67}{space 3}  -3.2461
{txt}{space 8}742  {c |}{col 14}{res}{space 2}-3.478583{col 26}{space 2}  .148521{col 37}{space 1}  -23.42{col 46}{space 3}0.000{col 54}{space 4}-3.769687{col 67}{space 3}-3.187479
{txt}{space 8}743  {c |}{col 14}{res}{space 2} -3.56672{col 26}{space 2} .1489871{col 37}{space 1}  -23.94{col 46}{space 3}0.000{col 54}{space 4}-3.858737{col 67}{space 3}-3.274702
{txt}{space 8}744  {c |}{col 14}{res}{space 2}-3.564704{col 26}{space 2} .1495378{col 37}{space 1}  -23.84{col 46}{space 3}0.000{col 54}{space 4}-3.857801{col 67}{space 3}-3.271607
{txt}{space 8}745  {c |}{col 14}{res}{space 2}-3.589248{col 26}{space 2} .1500221{col 37}{space 1}  -23.92{col 46}{space 3}0.000{col 54}{space 4}-3.883294{col 67}{space 3}-3.295202
{txt}{space 8}746  {c |}{col 14}{res}{space 2}-3.584553{col 26}{space 2}  .150216{col 37}{space 1}  -23.86{col 46}{space 3}0.000{col 54}{space 4} -3.87898{col 67}{space 3}-3.290127
{txt}{space 8}747  {c |}{col 14}{res}{space 2}-3.527102{col 26}{space 2}  .150628{col 37}{space 1}  -23.42{col 46}{space 3}0.000{col 54}{space 4}-3.822336{col 67}{space 3}-3.231869
{txt}{space 8}748  {c |}{col 14}{res}{space 2}-3.620869{col 26}{space 2} .1512521{col 37}{space 1}  -23.94{col 46}{space 3}0.000{col 54}{space 4}-3.917326{col 67}{space 3}-3.324412
{txt}{space 8}749  {c |}{col 14}{res}{space 2}-3.608528{col 26}{space 2} .1520099{col 37}{space 1}  -23.74{col 46}{space 3}0.000{col 54}{space 4}-3.906471{col 67}{space 3}-3.310586
{txt}{space 8}750  {c |}{col 14}{res}{space 2} -3.64658{col 26}{space 2} .1516861{col 37}{space 1}  -24.04{col 46}{space 3}0.000{col 54}{space 4}-3.943887{col 67}{space 3}-3.349272
{txt}{space 8}751  {c |}{col 14}{res}{space 2}-3.728975{col 26}{space 2} .1522084{col 37}{space 1}  -24.50{col 46}{space 3}0.000{col 54}{space 4}-4.027306{col 67}{space 3}-3.430643
{txt}{space 8}752  {c |}{col 14}{res}{space 2}-3.824506{col 26}{space 2} .1526807{col 37}{space 1}  -25.05{col 46}{space 3}0.000{col 54}{space 4}-4.123764{col 67}{space 3}-3.525249
{txt}{space 8}753  {c |}{col 14}{res}{space 2}-3.789804{col 26}{space 2} .1542059{col 37}{space 1}  -24.58{col 46}{space 3}0.000{col 54}{space 4} -4.09205{col 67}{space 3}-3.487557
{txt}{space 8}754  {c |}{col 14}{res}{space 2} -3.83076{col 26}{space 2}  .154681{col 37}{space 1}  -24.77{col 46}{space 3}0.000{col 54}{space 4}-4.133938{col 67}{space 3}-3.527582
{txt}{space 8}755  {c |}{col 14}{res}{space 2}-4.009721{col 26}{space 2} .1558995{col 37}{space 1}  -25.72{col 46}{space 3}0.000{col 54}{space 4}-4.315287{col 67}{space 3}-3.704155
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-4.794844{col 26}{space 2} .0968656{col 37}{space 1}  -49.50{col 46}{space 3}0.000{col 54}{space 4}-4.984702{col 67}{space 3}-4.604985
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     7734{col 27}{space 1}        0{col 39}{result}{space 1}     7734{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({res}est3{txt} stored)

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. estadd local hastid "Yes",replace

{txt}added macro:
             e(hastid) : "{res:Yes}"

{com}. 
. eststo: reghdfe lrincvar l1.lrincvar l2.lrincvar i.date, a(ID)
{res}{txt}(dropped 1103 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    37,843
{txt}Absorbing 1 HDFE group{col 51}F({res} 114{txt},{res}  31386{txt}){col 67}= {res}      6.64
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.7246
{txt}{col 51}Adj R-squared{col 67}= {res}    0.6679
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0235
{txt}{col 51}Root MSE{col 67}= {res}    0.7488

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lrincvar{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}lrincvar {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0351911{col 26}{space 2} .0054002{col 37}{space 1}    6.52{col 46}{space 3}0.000{col 54}{space 4} .0246064{col 67}{space 3} .0457758
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}  .018008{col 26}{space 2}  .005078{col 37}{space 1}    3.55{col 46}{space 3}0.000{col 54}{space 4} .0080549{col 67}{space 3}  .027961
{txt}{space 12} {c |}
{space 8}date {c |}
{space 8}644  {c |}{col 14}{res}{space 2}-.1098058{col 26}{space 2} .0685735{col 37}{space 1}   -1.60{col 46}{space 3}0.109{col 54}{space 4}-.2442125{col 67}{space 3} .0246009
{txt}{space 8}645  {c |}{col 14}{res}{space 2}-.1606102{col 26}{space 2} .0685347{col 37}{space 1}   -2.34{col 46}{space 3}0.019{col 54}{space 4}-.2949409{col 67}{space 3}-.0262795
{txt}{space 8}646  {c |}{col 14}{res}{space 2}-.2127503{col 26}{space 2} .0700315{col 37}{space 1}   -3.04{col 46}{space 3}0.002{col 54}{space 4}-.3500147{col 67}{space 3}-.0754858
{txt}{space 8}647  {c |}{col 14}{res}{space 2}-.2519475{col 26}{space 2} .0751024{col 37}{space 1}   -3.35{col 46}{space 3}0.001{col 54}{space 4}-.3991512{col 67}{space 3}-.1047439
{txt}{space 8}648  {c |}{col 14}{res}{space 2}-.3671856{col 26}{space 2}  .077505{col 37}{space 1}   -4.74{col 46}{space 3}0.000{col 54}{space 4}-.5190986{col 67}{space 3}-.2152727
{txt}{space 8}649  {c |}{col 14}{res}{space 2}-.3551604{col 26}{space 2} .0788577{col 37}{space 1}   -4.50{col 46}{space 3}0.000{col 54}{space 4}-.5097247{col 67}{space 3}-.2005961
{txt}{space 8}650  {c |}{col 14}{res}{space 2}-.3326364{col 26}{space 2} .0802206{col 37}{space 1}   -4.15{col 46}{space 3}0.000{col 54}{space 4}-.4898719{col 67}{space 3}-.1754009
{txt}{space 8}651  {c |}{col 14}{res}{space 2}-.4551069{col 26}{space 2} .0815328{col 37}{space 1}   -5.58{col 46}{space 3}0.000{col 54}{space 4}-.6149145{col 67}{space 3}-.2952993
{txt}{space 8}652  {c |}{col 14}{res}{space 2}-.4509317{col 26}{space 2} .0841557{col 37}{space 1}   -5.36{col 46}{space 3}0.000{col 54}{space 4}-.6158802{col 67}{space 3}-.2859831
{txt}{space 8}653  {c |}{col 14}{res}{space 2}-.3876101{col 26}{space 2} .0852866{col 37}{space 1}   -4.54{col 46}{space 3}0.000{col 54}{space 4}-.5547752{col 67}{space 3}-.2204449
{txt}{space 8}654  {c |}{col 14}{res}{space 2}-.4630657{col 26}{space 2} .0855282{col 37}{space 1}   -5.41{col 46}{space 3}0.000{col 54}{space 4}-.6307044{col 67}{space 3} -.295427
{txt}{space 8}655  {c |}{col 14}{res}{space 2} -.422452{col 26}{space 2} .0869801{col 37}{space 1}   -4.86{col 46}{space 3}0.000{col 54}{space 4}-.5929365{col 67}{space 3}-.2519675
{txt}{space 8}656  {c |}{col 14}{res}{space 2}-.4925273{col 26}{space 2} .0884441{col 37}{space 1}   -5.57{col 46}{space 3}0.000{col 54}{space 4}-.6658812{col 67}{space 3}-.3191734
{txt}{space 8}657  {c |}{col 14}{res}{space 2}-.5561674{col 26}{space 2} .0909562{col 37}{space 1}   -6.11{col 46}{space 3}0.000{col 54}{space 4}-.7344452{col 67}{space 3}-.3778895
{txt}{space 8}658  {c |}{col 14}{res}{space 2}-.5641666{col 26}{space 2} .0929055{col 37}{space 1}   -6.07{col 46}{space 3}0.000{col 54}{space 4} -.746265{col 67}{space 3}-.3820681
{txt}{space 8}659  {c |}{col 14}{res}{space 2}-.6029747{col 26}{space 2} .0945625{col 37}{space 1}   -6.38{col 46}{space 3}0.000{col 54}{space 4} -.788321{col 67}{space 3}-.4176285
{txt}{space 8}660  {c |}{col 14}{res}{space 2}-.7075573{col 26}{space 2} .0966396{col 37}{space 1}   -7.32{col 46}{space 3}0.000{col 54}{space 4}-.8969747{col 67}{space 3}-.5181399
{txt}{space 8}661  {c |}{col 14}{res}{space 2}-.7481764{col 26}{space 2} .0982298{col 37}{space 1}   -7.62{col 46}{space 3}0.000{col 54}{space 4}-.9407108{col 67}{space 3}-.5556421
{txt}{space 8}662  {c |}{col 14}{res}{space 2}-.6916542{col 26}{space 2} .0996464{col 37}{space 1}   -6.94{col 46}{space 3}0.000{col 54}{space 4}-.8869651{col 67}{space 3}-.4963433
{txt}{space 8}663  {c |}{col 14}{res}{space 2}-.6698156{col 26}{space 2} .1012711{col 37}{space 1}   -6.61{col 46}{space 3}0.000{col 54}{space 4} -.868311{col 67}{space 3}-.4713203
{txt}{space 8}664  {c |}{col 14}{res}{space 2}-.7813054{col 26}{space 2} .1022983{col 37}{space 1}   -7.64{col 46}{space 3}0.000{col 54}{space 4}-.9818141{col 67}{space 3}-.5807967
{txt}{space 8}665  {c |}{col 14}{res}{space 2}-.6542277{col 26}{space 2} .1031304{col 37}{space 1}   -6.34{col 46}{space 3}0.000{col 54}{space 4}-.8563674{col 67}{space 3}-.4520881
{txt}{space 8}666  {c |}{col 14}{res}{space 2}-.6807629{col 26}{space 2} .1040171{col 37}{space 1}   -6.54{col 46}{space 3}0.000{col 54}{space 4}-.8846405{col 67}{space 3}-.4768852
{txt}{space 8}667  {c |}{col 14}{res}{space 2}-.7892293{col 26}{space 2} .1055494{col 37}{space 1}   -7.48{col 46}{space 3}0.000{col 54}{space 4}-.9961104{col 67}{space 3}-.5823482
{txt}{space 8}668  {c |}{col 14}{res}{space 2}-.8521011{col 26}{space 2}  .107529{col 37}{space 1}   -7.92{col 46}{space 3}0.000{col 54}{space 4}-1.062862{col 67}{space 3}-.6413401
{txt}{space 8}669  {c |}{col 14}{res}{space 2} -.912516{col 26}{space 2} .1085853{col 37}{space 1}   -8.40{col 46}{space 3}0.000{col 54}{space 4}-1.125347{col 67}{space 3}-.6996846
{txt}{space 8}670  {c |}{col 14}{res}{space 2}-.9406737{col 26}{space 2} .1094508{col 37}{space 1}   -8.59{col 46}{space 3}0.000{col 54}{space 4}-1.155202{col 67}{space 3}-.7261457
{txt}{space 8}671  {c |}{col 14}{res}{space 2}-1.003109{col 26}{space 2} .1105627{col 37}{space 1}   -9.07{col 46}{space 3}0.000{col 54}{space 4}-1.219816{col 67}{space 3}-.7864015
{txt}{space 8}672  {c |}{col 14}{res}{space 2}-1.043474{col 26}{space 2} .1118694{col 37}{space 1}   -9.33{col 46}{space 3}0.000{col 54}{space 4}-1.262743{col 67}{space 3}-.8242059
{txt}{space 8}673  {c |}{col 14}{res}{space 2}-1.088885{col 26}{space 2} .1139176{col 37}{space 1}   -9.56{col 46}{space 3}0.000{col 54}{space 4}-1.312168{col 67}{space 3}-.8656021
{txt}{space 8}674  {c |}{col 14}{res}{space 2} -1.07654{col 26}{space 2} .1147077{col 37}{space 1}   -9.39{col 46}{space 3}0.000{col 54}{space 4}-1.301372{col 67}{space 3}-.8517086
{txt}{space 8}675  {c |}{col 14}{res}{space 2}-1.144575{col 26}{space 2} .1159273{col 37}{space 1}   -9.87{col 46}{space 3}0.000{col 54}{space 4}-1.371797{col 67}{space 3}-.9173524
{txt}{space 8}676  {c |}{col 14}{res}{space 2}-1.154043{col 26}{space 2} .1171429{col 37}{space 1}   -9.85{col 46}{space 3}0.000{col 54}{space 4}-1.383648{col 67}{space 3}-.9244385
{txt}{space 8}677  {c |}{col 14}{res}{space 2}-1.146854{col 26}{space 2} .1178424{col 37}{space 1}   -9.73{col 46}{space 3}0.000{col 54}{space 4} -1.37783{col 67}{space 3}-.9158785
{txt}{space 8}678  {c |}{col 14}{res}{space 2}-1.189203{col 26}{space 2} .1186697{col 37}{space 1}  -10.02{col 46}{space 3}0.000{col 54}{space 4}  -1.4218{col 67}{space 3}-.9566054
{txt}{space 8}679  {c |}{col 14}{res}{space 2}-1.128423{col 26}{space 2} .1203355{col 37}{space 1}   -9.38{col 46}{space 3}0.000{col 54}{space 4}-1.364285{col 67}{space 3}-.8925608
{txt}{space 8}680  {c |}{col 14}{res}{space 2}-1.234465{col 26}{space 2} .1215022{col 37}{space 1}  -10.16{col 46}{space 3}0.000{col 54}{space 4}-1.472614{col 67}{space 3}-.9963154
{txt}{space 8}681  {c |}{col 14}{res}{space 2}-1.126131{col 26}{space 2} .1223927{col 37}{space 1}   -9.20{col 46}{space 3}0.000{col 54}{space 4}-1.366025{col 67}{space 3}-.8862361
{txt}{space 8}682  {c |}{col 14}{res}{space 2}-1.063311{col 26}{space 2} .1236378{col 37}{space 1}   -8.60{col 46}{space 3}0.000{col 54}{space 4}-1.305646{col 67}{space 3}-.8209763
{txt}{space 8}683  {c |}{col 14}{res}{space 2}-1.138881{col 26}{space 2} .1244507{col 37}{space 1}   -9.15{col 46}{space 3}0.000{col 54}{space 4} -1.38281{col 67}{space 3}-.8949531
{txt}{space 8}684  {c |}{col 14}{res}{space 2}-1.122052{col 26}{space 2} .1255479{col 37}{space 1}   -8.94{col 46}{space 3}0.000{col 54}{space 4}-1.368131{col 67}{space 3}-.8759734
{txt}{space 8}685  {c |}{col 14}{res}{space 2}-1.210103{col 26}{space 2} .1267934{col 37}{space 1}   -9.54{col 46}{space 3}0.000{col 54}{space 4}-1.458624{col 67}{space 3}-.9615833
{txt}{space 8}686  {c |}{col 14}{res}{space 2}-1.339347{col 26}{space 2} .1279778{col 37}{space 1}  -10.47{col 46}{space 3}0.000{col 54}{space 4}-1.590189{col 67}{space 3}-1.088506
{txt}{space 8}687  {c |}{col 14}{res}{space 2}-1.406831{col 26}{space 2} .1293313{col 37}{space 1}  -10.88{col 46}{space 3}0.000{col 54}{space 4}-1.660325{col 67}{space 3}-1.153336
{txt}{space 8}688  {c |}{col 14}{res}{space 2}-1.495229{col 26}{space 2}  .130162{col 37}{space 1}  -11.49{col 46}{space 3}0.000{col 54}{space 4}-1.750352{col 67}{space 3}-1.240107
{txt}{space 8}689  {c |}{col 14}{res}{space 2}-1.416515{col 26}{space 2} .1312198{col 37}{space 1}  -10.79{col 46}{space 3}0.000{col 54}{space 4}-1.673711{col 67}{space 3}-1.159319
{txt}{space 8}690  {c |}{col 14}{res}{space 2}-1.456372{col 26}{space 2} .1320581{col 37}{space 1}  -11.03{col 46}{space 3}0.000{col 54}{space 4}-1.715211{col 67}{space 3}-1.197533
{txt}{space 8}691  {c |}{col 14}{res}{space 2}-1.576129{col 26}{space 2}  .133117{col 37}{space 1}  -11.84{col 46}{space 3}0.000{col 54}{space 4}-1.837044{col 67}{space 3}-1.315214
{txt}{space 8}692  {c |}{col 14}{res}{space 2}-1.509179{col 26}{space 2} .1345481{col 37}{space 1}  -11.22{col 46}{space 3}0.000{col 54}{space 4}-1.772898{col 67}{space 3}-1.245459
{txt}{space 8}693  {c |}{col 14}{res}{space 2}-1.580339{col 26}{space 2} .1355037{col 37}{space 1}  -11.66{col 46}{space 3}0.000{col 54}{space 4}-1.845932{col 67}{space 3}-1.314747
{txt}{space 8}694  {c |}{col 14}{res}{space 2}-1.607381{col 26}{space 2} .1364808{col 37}{space 1}  -11.78{col 46}{space 3}0.000{col 54}{space 4}-1.874888{col 67}{space 3}-1.339873
{txt}{space 8}695  {c |}{col 14}{res}{space 2}-1.636228{col 26}{space 2} .1376105{col 37}{space 1}  -11.89{col 46}{space 3}0.000{col 54}{space 4} -1.90595{col 67}{space 3}-1.366506
{txt}{space 8}696  {c |}{col 14}{res}{space 2}-1.648913{col 26}{space 2} .1393633{col 37}{space 1}  -11.83{col 46}{space 3}0.000{col 54}{space 4}-1.922071{col 67}{space 3}-1.375755
{txt}{space 8}697  {c |}{col 14}{res}{space 2}-1.617556{col 26}{space 2} .1402746{col 37}{space 1}  -11.53{col 46}{space 3}0.000{col 54}{space 4}  -1.8925{col 67}{space 3}-1.342612
{txt}{space 8}698  {c |}{col 14}{res}{space 2}-1.762512{col 26}{space 2}  .141398{col 37}{space 1}  -12.46{col 46}{space 3}0.000{col 54}{space 4}-2.039658{col 67}{space 3}-1.485366
{txt}{space 8}699  {c |}{col 14}{res}{space 2}-1.770874{col 26}{space 2} .1424703{col 37}{space 1}  -12.43{col 46}{space 3}0.000{col 54}{space 4}-2.050121{col 67}{space 3}-1.491626
{txt}{space 8}700  {c |}{col 14}{res}{space 2}-1.709526{col 26}{space 2} .1435003{col 37}{space 1}  -11.91{col 46}{space 3}0.000{col 54}{space 4}-1.990792{col 67}{space 3} -1.42826
{txt}{space 8}701  {c |}{col 14}{res}{space 2}-1.730585{col 26}{space 2} .1446748{col 37}{space 1}  -11.96{col 46}{space 3}0.000{col 54}{space 4}-2.014153{col 67}{space 3}-1.447016
{txt}{space 8}702  {c |}{col 14}{res}{space 2}-1.794877{col 26}{space 2} .1456889{col 37}{space 1}  -12.32{col 46}{space 3}0.000{col 54}{space 4}-2.080433{col 67}{space 3}-1.509321
{txt}{space 8}703  {c |}{col 14}{res}{space 2}-1.962311{col 26}{space 2} .1464876{col 37}{space 1}  -13.40{col 46}{space 3}0.000{col 54}{space 4}-2.249432{col 67}{space 3}-1.675189
{txt}{space 8}704  {c |}{col 14}{res}{space 2}-1.929268{col 26}{space 2} .1473317{col 37}{space 1}  -13.09{col 46}{space 3}0.000{col 54}{space 4}-2.218044{col 67}{space 3}-1.640492
{txt}{space 8}705  {c |}{col 14}{res}{space 2}-1.955068{col 26}{space 2} .1486929{col 37}{space 1}  -13.15{col 46}{space 3}0.000{col 54}{space 4}-2.246512{col 67}{space 3}-1.663624
{txt}{space 8}706  {c |}{col 14}{res}{space 2} -1.91074{col 26}{space 2} .1498875{col 37}{space 1}  -12.75{col 46}{space 3}0.000{col 54}{space 4}-2.204526{col 67}{space 3}-1.616955
{txt}{space 8}707  {c |}{col 14}{res}{space 2}-1.995818{col 26}{space 2} .1506565{col 37}{space 1}  -13.25{col 46}{space 3}0.000{col 54}{space 4} -2.29111{col 67}{space 3}-1.700525
{txt}{space 8}708  {c |}{col 14}{res}{space 2}-1.927156{col 26}{space 2} .1515578{col 37}{space 1}  -12.72{col 46}{space 3}0.000{col 54}{space 4}-2.224215{col 67}{space 3}-1.630096
{txt}{space 8}709  {c |}{col 14}{res}{space 2}-2.124126{col 26}{space 2} .1527065{col 37}{space 1}  -13.91{col 46}{space 3}0.000{col 54}{space 4}-2.423436{col 67}{space 3}-1.824815
{txt}{space 8}710  {c |}{col 14}{res}{space 2}-2.142298{col 26}{space 2} .1529023{col 37}{space 1}  -14.01{col 46}{space 3}0.000{col 54}{space 4}-2.441993{col 67}{space 3}-1.842604
{txt}{space 8}711  {c |}{col 14}{res}{space 2}-2.191634{col 26}{space 2} .1544643{col 37}{space 1}  -14.19{col 46}{space 3}0.000{col 54}{space 4} -2.49439{col 67}{space 3}-1.888878
{txt}{space 8}712  {c |}{col 14}{res}{space 2}-2.196426{col 26}{space 2} .1553608{col 37}{space 1}  -14.14{col 46}{space 3}0.000{col 54}{space 4}-2.500939{col 67}{space 3}-1.891913
{txt}{space 8}713  {c |}{col 14}{res}{space 2} -2.23696{col 26}{space 2} .1566231{col 37}{space 1}  -14.28{col 46}{space 3}0.000{col 54}{space 4}-2.543947{col 67}{space 3}-1.929972
{txt}{space 8}714  {c |}{col 14}{res}{space 2} -2.35742{col 26}{space 2} .1575963{col 37}{space 1}  -14.96{col 46}{space 3}0.000{col 54}{space 4}-2.666314{col 67}{space 3}-2.048525
{txt}{space 8}715  {c |}{col 14}{res}{space 2}-2.442289{col 26}{space 2} .1587178{col 37}{space 1}  -15.39{col 46}{space 3}0.000{col 54}{space 4}-2.753382{col 67}{space 3}-2.131196
{txt}{space 8}716  {c |}{col 14}{res}{space 2}-2.402845{col 26}{space 2} .1595699{col 37}{space 1}  -15.06{col 46}{space 3}0.000{col 54}{space 4}-2.715609{col 67}{space 3}-2.090082
{txt}{space 8}717  {c |}{col 14}{res}{space 2}-2.405252{col 26}{space 2}  .160117{col 37}{space 1}  -15.02{col 46}{space 3}0.000{col 54}{space 4}-2.719088{col 67}{space 3}-2.091417
{txt}{space 8}718  {c |}{col 14}{res}{space 2}-2.514485{col 26}{space 2} .1610587{col 37}{space 1}  -15.61{col 46}{space 3}0.000{col 54}{space 4}-2.830167{col 67}{space 3}-2.198804
{txt}{space 8}719  {c |}{col 14}{res}{space 2}-2.582215{col 26}{space 2} .1625034{col 37}{space 1}  -15.89{col 46}{space 3}0.000{col 54}{space 4}-2.900728{col 67}{space 3}-2.263702
{txt}{space 8}720  {c |}{col 14}{res}{space 2}-2.618128{col 26}{space 2} .1634592{col 37}{space 1}  -16.02{col 46}{space 3}0.000{col 54}{space 4}-2.938514{col 67}{space 3}-2.297741
{txt}{space 8}721  {c |}{col 14}{res}{space 2} -2.72081{col 26}{space 2} .1640139{col 37}{space 1}  -16.59{col 46}{space 3}0.000{col 54}{space 4}-3.042284{col 67}{space 3}-2.399336
{txt}{space 8}722  {c |}{col 14}{res}{space 2}-2.430803{col 26}{space 2} .1649026{col 37}{space 1}  -14.74{col 46}{space 3}0.000{col 54}{space 4}-2.754019{col 67}{space 3}-2.107588
{txt}{space 8}723  {c |}{col 14}{res}{space 2}-2.339348{col 26}{space 2} .1657679{col 37}{space 1}  -14.11{col 46}{space 3}0.000{col 54}{space 4} -2.66426{col 67}{space 3}-2.014437
{txt}{space 8}724  {c |}{col 14}{res}{space 2}-2.401448{col 26}{space 2} .1662406{col 37}{space 1}  -14.45{col 46}{space 3}0.000{col 54}{space 4}-2.727286{col 67}{space 3} -2.07561
{txt}{space 8}725  {c |}{col 14}{res}{space 2}-2.737025{col 26}{space 2} .1674898{col 37}{space 1}  -16.34{col 46}{space 3}0.000{col 54}{space 4}-3.065312{col 67}{space 3}-2.408739
{txt}{space 8}726  {c |}{col 14}{res}{space 2}-2.762049{col 26}{space 2} .1688651{col 37}{space 1}  -16.36{col 46}{space 3}0.000{col 54}{space 4}-3.093032{col 67}{space 3}-2.431067
{txt}{space 8}727  {c |}{col 14}{res}{space 2}-2.750921{col 26}{space 2} .1701543{col 37}{space 1}  -16.17{col 46}{space 3}0.000{col 54}{space 4} -3.08443{col 67}{space 3}-2.417412
{txt}{space 8}728  {c |}{col 14}{res}{space 2}-2.919344{col 26}{space 2} .1711634{col 37}{space 1}  -17.06{col 46}{space 3}0.000{col 54}{space 4}-3.254831{col 67}{space 3}-2.583857
{txt}{space 8}729  {c |}{col 14}{res}{space 2}-2.806922{col 26}{space 2} .1717287{col 37}{space 1}  -16.35{col 46}{space 3}0.000{col 54}{space 4}-3.143517{col 67}{space 3}-2.470326
{txt}{space 8}730  {c |}{col 14}{res}{space 2}-2.840227{col 26}{space 2} .1719734{col 37}{space 1}  -16.52{col 46}{space 3}0.000{col 54}{space 4}-3.177302{col 67}{space 3}-2.503153
{txt}{space 8}731  {c |}{col 14}{res}{space 2}-2.788005{col 26}{space 2} .1719187{col 37}{space 1}  -16.22{col 46}{space 3}0.000{col 54}{space 4}-3.124973{col 67}{space 3}-2.451038
{txt}{space 8}732  {c |}{col 14}{res}{space 2}-2.824814{col 26}{space 2} .1732045{col 37}{space 1}  -16.31{col 46}{space 3}0.000{col 54}{space 4}-3.164302{col 67}{space 3}-2.485326
{txt}{space 8}733  {c |}{col 14}{res}{space 2}-2.893507{col 26}{space 2} .1739929{col 37}{space 1}  -16.63{col 46}{space 3}0.000{col 54}{space 4} -3.23454{col 67}{space 3}-2.552474
{txt}{space 8}734  {c |}{col 14}{res}{space 2}-2.950869{col 26}{space 2} .1756063{col 37}{space 1}  -16.80{col 46}{space 3}0.000{col 54}{space 4}-3.295064{col 67}{space 3}-2.606673
{txt}{space 8}735  {c |}{col 14}{res}{space 2}-2.947914{col 26}{space 2} .1764227{col 37}{space 1}  -16.71{col 46}{space 3}0.000{col 54}{space 4} -3.29371{col 67}{space 3}-2.602119
{txt}{space 8}736  {c |}{col 14}{res}{space 2} -2.92345{col 26}{space 2} .1768269{col 37}{space 1}  -16.53{col 46}{space 3}0.000{col 54}{space 4}-3.270038{col 67}{space 3}-2.576862
{txt}{space 8}737  {c |}{col 14}{res}{space 2}-2.957791{col 26}{space 2} .1770146{col 37}{space 1}  -16.71{col 46}{space 3}0.000{col 54}{space 4}-3.304747{col 67}{space 3}-2.610836
{txt}{space 8}738  {c |}{col 14}{res}{space 2}-2.974442{col 26}{space 2} .1776054{col 37}{space 1}  -16.75{col 46}{space 3}0.000{col 54}{space 4}-3.322556{col 67}{space 3}-2.626328
{txt}{space 8}739  {c |}{col 14}{res}{space 2}-3.010569{col 26}{space 2} .1780167{col 37}{space 1}  -16.91{col 46}{space 3}0.000{col 54}{space 4}-3.359489{col 67}{space 3}-2.661649
{txt}{space 8}740  {c |}{col 14}{res}{space 2}-2.947927{col 26}{space 2} .1788129{col 37}{space 1}  -16.49{col 46}{space 3}0.000{col 54}{space 4}-3.298408{col 67}{space 3}-2.597447
{txt}{space 8}741  {c |}{col 14}{res}{space 2}-2.963134{col 26}{space 2} .1794398{col 37}{space 1}  -16.51{col 46}{space 3}0.000{col 54}{space 4}-3.314843{col 67}{space 3}-2.611425
{txt}{space 8}742  {c |}{col 14}{res}{space 2}-2.891342{col 26}{space 2}   .18017{col 37}{space 1}  -16.05{col 46}{space 3}0.000{col 54}{space 4}-3.244482{col 67}{space 3}-2.538202
{txt}{space 8}743  {c |}{col 14}{res}{space 2}-2.988841{col 26}{space 2} .1804921{col 37}{space 1}  -16.56{col 46}{space 3}0.000{col 54}{space 4}-3.342613{col 67}{space 3} -2.63507
{txt}{space 8}744  {c |}{col 14}{res}{space 2}-2.996435{col 26}{space 2} .1811834{col 37}{space 1}  -16.54{col 46}{space 3}0.000{col 54}{space 4}-3.351562{col 67}{space 3}-2.641308
{txt}{space 8}745  {c |}{col 14}{res}{space 2}-3.016805{col 26}{space 2} .1816869{col 37}{space 1}  -16.60{col 46}{space 3}0.000{col 54}{space 4}-3.372919{col 67}{space 3}-2.660692
{txt}{space 8}746  {c |}{col 14}{res}{space 2}-2.999401{col 26}{space 2} .1820444{col 37}{space 1}  -16.48{col 46}{space 3}0.000{col 54}{space 4}-3.356215{col 67}{space 3}-2.642587
{txt}{space 8}747  {c |}{col 14}{res}{space 2}-2.909823{col 26}{space 2} .1824153{col 37}{space 1}  -15.95{col 46}{space 3}0.000{col 54}{space 4}-3.267364{col 67}{space 3}-2.552282
{txt}{space 8}748  {c |}{col 14}{res}{space 2}-3.035525{col 26}{space 2} .1830622{col 37}{space 1}  -16.58{col 46}{space 3}0.000{col 54}{space 4}-3.394334{col 67}{space 3}-2.676716
{txt}{space 8}749  {c |}{col 14}{res}{space 2}-3.030518{col 26}{space 2} .1838141{col 37}{space 1}  -16.49{col 46}{space 3}0.000{col 54}{space 4}-3.390801{col 67}{space 3}-2.670236
{txt}{space 8}750  {c |}{col 14}{res}{space 2}-3.065185{col 26}{space 2} .1837096{col 37}{space 1}  -16.68{col 46}{space 3}0.000{col 54}{space 4}-3.425263{col 67}{space 3}-2.705107
{txt}{space 8}751  {c |}{col 14}{res}{space 2}-3.098485{col 26}{space 2} .1841619{col 37}{space 1}  -16.82{col 46}{space 3}0.000{col 54}{space 4} -3.45945{col 67}{space 3}-2.737521
{txt}{space 8}752  {c |}{col 14}{res}{space 2}-3.226908{col 26}{space 2} .1846961{col 37}{space 1}  -17.47{col 46}{space 3}0.000{col 54}{space 4}-3.588919{col 67}{space 3}-2.864896
{txt}{space 8}753  {c |}{col 14}{res}{space 2} -3.14573{col 26}{space 2} .1863399{col 37}{space 1}  -16.88{col 46}{space 3}0.000{col 54}{space 4}-3.510964{col 67}{space 3}-2.780496
{txt}{space 8}754  {c |}{col 14}{res}{space 2}-3.183087{col 26}{space 2}  .187026{col 37}{space 1}  -17.02{col 46}{space 3}0.000{col 54}{space 4}-3.549666{col 67}{space 3}-2.816509
{txt}{space 8}755  {c |}{col 14}{res}{space 2} -3.29381{col 26}{space 2}  .188241{col 37}{space 1}  -17.50{col 46}{space 3}0.000{col 54}{space 4} -3.66277{col 67}{space 3} -2.92485
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-5.331918{col 26}{space 2} .1202652{col 37}{space 1}  -44.33{col 46}{space 3}0.000{col 54}{space 4}-5.567642{col 67}{space 3}-5.096193
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     6343{col 27}{space 1}        0{col 39}{result}{space 1}     6343{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({res}est4{txt} stored)

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. estadd local hastid "Yes",replace

{txt}added macro:
             e(hastid) : "{res:Yes}"

{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/ind/autoreg_perceived_risk.csv", ///
>        stats(hasid hastid r2 N, label("Individual FE" "Time FE" "R-squared" "Sample Size")) ///
>            label mtitles se r2 ///
>            drop(*.date) replace
{res}{txt}(output written to {browse  `"C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Tables\/ind/autoreg_perceived_risk.csv"'})

{com}. 
. eststo clear
{txt}
{com}. 
. 
. ************************************************
. ** spending decisions and perceived risks **
. ************************************************
. 
. eststo clear
{txt}
{com}. xtset ID date
{res}
{col 1}{txt:Panel variable: }{res:ID}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:date}{txt:, }{res:{bind:2013m6}}{txt: to }{res:{bind:2022m12}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 month
{txt}
{com}. label var incmean "expected wage growth"
{txt}
{com}. label var rincvar "perceived wage risk"
{txt}
{com}. label var incvar "perceived wage risk (nominal)"
{txt}
{com}. label var exp_s "perceived UE risk next 4m"
{txt}
{com}. label var exp_s_1y "perceived UE risk next 1y"
{txt}
{com}. 
. 
. eststo: reg spending incmean rincvar

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    66,363
{txt}{hline 13}{c +}{hline 34}   F(2, 66360)     = {res}    40.75
{txt}       Model {c |} {res} 14.0661256         2  7.03306282   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 11453.3949    66,360   .17259486   {txt}R-squared       ={res}    0.0012
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0012
{txt}       Total {c |} {res}  11467.461    66,362  .172801619   {txt}Root MSE        =   {res} .41545

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}incmean {c |}{col 14}{res}{space 2} .2616081{col 26}{space 2} .0702532{col 37}{space 1}    3.72{col 46}{space 3}0.000{col 54}{space 4} .1239118{col 67}{space 3} .3993043
{txt}{space 5}rincvar {c |}{col 14}{res}{space 2} 7.215917{col 26}{space 2} .9742687{col 37}{space 1}    7.41{col 46}{space 3}0.000{col 54}{space 4}  5.30635{col 67}{space 3} 9.125483
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0308141{col 26}{space 2} .0027597{col 37}{space 1}   11.17{col 46}{space 3}0.000{col 54}{space 4} .0254052{col 67}{space 3} .0362231
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

{com}. 
. estadd local hast "No",replace

{txt}added macro:
               e(hast) : "{res:No}"

{com}. estadd local hasid "No",replace

{txt}added macro:
              e(hasid) : "{res:No}"

{com}. 
. eststo: areg spending incmean rincvar, a(date)
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 53}{lalign 17:Number of obs}{col 70} = {res}{ralign 6:66,363}
{txt}{col 1}Absorbed variable: {res:date}{col 53}{lalign 17:No. of categories}{col 70} = {res}{ralign 6:115}
{txt}{col 53}{lalign 17:F({res:2}, {res:66246})}{col 70} = {res}{ralign 6:34.01}
{txt}{col 53}{lalign 17:Prob > F}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 53}{lalign 17:R-squared}{col 70} = {res}{ralign 6:0.0041}
{txt}{col 53}{lalign 17:Adj R-squared}{col 70} = {res}{ralign 6:0.0023}
{txt}{col 53}{lalign 17:Root MSE}{col 70} = {res}{ralign 6:0.4152}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}incmean {c |}{col 14}{res}{space 2} .2165755{col 26}{space 2}  .070554{col 37}{space 1}    3.07{col 46}{space 3}0.002{col 54}{space 4} .0782898{col 67}{space 3} .3548613
{txt}{space 5}rincvar {c |}{col 14}{res}{space 2} 6.838009{col 26}{space 2} .9785873{col 37}{space 1}    6.99{col 46}{space 3}0.000{col 54}{space 4} 4.919978{col 67}{space 3}  8.75604
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0326386{col 26}{space 2} .0027714{col 37}{space 1}   11.78{col 46}{space 3}0.000{col 54}{space 4} .0272067{col 67}{space 3} .0380705
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of absorbed indicators: F({res}114{txt}, {res}66246{txt}) = {res}1.660{col 62}{txt} Prob > F = {res}0.000
{txt}({res}est2{txt} stored)

{com}. 
. estadd local hast "Yes",replace

{txt}added macro:
               e(hast) : "{res:Yes}"

{com}. estadd local hasid "No",replace

{txt}added macro:
              e(hasid) : "{res:No}"

{com}. 
. eststo: areg spending incmean rincvar, a(ID)
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 53}{lalign 17:Number of obs}{col 70} = {res}{ralign 6:66,363}
{txt}{col 1}Absorbed variable: {res:ID}{col 53}{lalign 17:No. of categories}{col 70} = {res}{ralign 6:11,196}
{txt}{col 53}{lalign 17:F({res:2}, {res:55165})}{col 70} = {res}{ralign 6:56.17}
{txt}{col 53}{lalign 17:Prob > F}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 53}{lalign 17:R-squared}{col 70} = {res}{ralign 6:0.9405}
{txt}{col 53}{lalign 17:Adj R-squared}{col 70} = {res}{ralign 6:0.9284}
{txt}{col 53}{lalign 17:Root MSE}{col 70} = {res}{ralign 6:0.1112}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}incmean {c |}{col 14}{res}{space 2} .2253473{col 26}{space 2} .0317006{col 37}{space 1}    7.11{col 46}{space 3}0.000{col 54}{space 4} .1632138{col 67}{space 3} .2874807
{txt}{space 5}rincvar {c |}{col 14}{res}{space 2} 2.805128{col 26}{space 2} .4110345{col 37}{space 1}    6.82{col 46}{space 3}0.000{col 54}{space 4} 1.999498{col 67}{space 3} 3.610759
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0372893{col 26}{space 2} .0011084{col 37}{space 1}   33.64{col 46}{space 3}0.000{col 54}{space 4} .0351169{col 67}{space 3} .0394618
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of absorbed indicators: F({res}11195{txt}, {res}55165{txt}) = {res}77.773{col 62}{txt} Prob > F = {res}0.000
{txt}({res}est3{txt} stored)

{com}. 
. estadd local hast "No",replace

{txt}added macro:
               e(hast) : "{res:No}"

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. 
. eststo: areg spending incmean rincvar i.year, a(ID)
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 53}{lalign 17:Number of obs}{col 70} = {res}{ralign 6:66,363}
{txt}{col 1}Absorbed variable: {res:ID}{col 53}{lalign 17:No. of categories}{col 70} = {res}{ralign 6:11,196}
{txt}{col 53}{lalign 17:F({res:11}, {res:55156})}{col 70} = {res}{ralign 6:18.54}
{txt}{col 53}{lalign 17:Prob > F}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 53}{lalign 17:R-squared}{col 70} = {res}{ralign 6:0.9406}
{txt}{col 53}{lalign 17:Adj R-squared}{col 70} = {res}{ralign 6:0.9285}
{txt}{col 53}{lalign 17:Root MSE}{col 70} = {res}{ralign 6:0.1111}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}incmean {c |}{col 14}{res}{space 2} .2148608{col 26}{space 2} .0317124{col 37}{space 1}    6.78{col 46}{space 3}0.000{col 54}{space 4} .1527043{col 67}{space 3} .2770174
{txt}{space 5}rincvar {c |}{col 14}{res}{space 2} 2.536669{col 26}{space 2} .4132263{col 37}{space 1}    6.14{col 46}{space 3}0.000{col 54}{space 4} 1.726743{col 67}{space 3} 3.346596
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2014  {c |}{col 14}{res}{space 2}-.0061752{col 26}{space 2} .0038352{col 37}{space 1}   -1.61{col 46}{space 3}0.107{col 54}{space 4}-.0136922{col 67}{space 3} .0013417
{txt}{space 7}2015  {c |}{col 14}{res}{space 2}-.0214834{col 26}{space 2} .0052944{col 37}{space 1}   -4.06{col 46}{space 3}0.000{col 54}{space 4}-.0318606{col 67}{space 3}-.0111063
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0370221{col 26}{space 2} .0064066{col 37}{space 1}   -5.78{col 46}{space 3}0.000{col 54}{space 4}-.0495791{col 67}{space 3}-.0244652
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0520773{col 26}{space 2} .0073091{col 37}{space 1}   -7.12{col 46}{space 3}0.000{col 54}{space 4}-.0664032{col 67}{space 3}-.0377513
{txt}{space 7}2018  {c |}{col 14}{res}{space 2} -.061923{col 26}{space 2}  .008145{col 37}{space 1}   -7.60{col 46}{space 3}0.000{col 54}{space 4}-.0778873{col 67}{space 3}-.0459587
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0636703{col 26}{space 2} .0088921{col 37}{space 1}   -7.16{col 46}{space 3}0.000{col 54}{space 4}-.0810988{col 67}{space 3}-.0462418
{txt}{space 7}2020  {c |}{col 14}{res}{space 2}-.0787404{col 26}{space 2} .0096025{col 37}{space 1}   -8.20{col 46}{space 3}0.000{col 54}{space 4}-.0975614{col 67}{space 3}-.0599195
{txt}{space 7}2021  {c |}{col 14}{res}{space 2}-.0708434{col 26}{space 2} .0102792{col 37}{space 1}   -6.89{col 46}{space 3}0.000{col 54}{space 4}-.0909907{col 67}{space 3}-.0506962
{txt}{space 7}2022  {c |}{col 14}{res}{space 2} -.063619{col 26}{space 2} .0108292{col 37}{space 1}   -5.87{col 46}{space 3}0.000{col 54}{space 4}-.0848442{col 67}{space 3}-.0423938
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0851526{col 26}{space 2} .0066018{col 37}{space 1}   12.90{col 46}{space 3}0.000{col 54}{space 4}  .072213{col 67}{space 3} .0980922
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of absorbed indicators: F({res}11195{txt}, {res}55156{txt}) = {res}77.808{col 62}{txt} Prob > F = {res}0.000
{txt}({res}est4{txt} stored)

{com}. 
. estadd local hast "Yes",replace

{txt}added macro:
               e(hast) : "{res:Yes}"

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. 
. eststo: areg spending exp_s i.year, a(ID)
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 53}{lalign 17:Number of obs}{col 70} = {res}{ralign 6:6,269}
{txt}{col 1}Absorbed variable: {res:ID}{col 53}{lalign 17:No. of categories}{col 70} = {res}{ralign 6:3,743}
{txt}{col 53}{lalign 17:F({res:6}, {res:2520})}{col 70} = {res}{ralign 6:7.68}
{txt}{col 53}{lalign 17:Prob > F}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 53}{lalign 17:R-squared}{col 70} = {res}{ralign 6:0.6327}
{txt}{col 53}{lalign 17:Adj R-squared}{col 70} = {res}{ralign 6:0.0865}
{txt}{col 53}{lalign 17:Root MSE}{col 70} = {res}{ralign 6:0.2038}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    spending{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}exp_s {c |}{col 14}{res}{space 2} .3530927{col 26}{space 2} .0553248{col 37}{space 1}    6.38{col 46}{space 3}0.000{col 54}{space 4}  .244606{col 67}{space 3} .4615794
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2015  {c |}{col 14}{res}{space 2} .0001617{col 26}{space 2} .0190614{col 37}{space 1}    0.01{col 46}{space 3}0.993{col 54}{space 4}-.0372159{col 67}{space 3} .0375393
{txt}{space 7}2016  {c |}{col 14}{res}{space 2}-.0432982{col 26}{space 2} .0273991{col 37}{space 1}   -1.58{col 46}{space 3}0.114{col 54}{space 4}-.0970253{col 67}{space 3}  .010429
{txt}{space 7}2017  {c |}{col 14}{res}{space 2}-.0555205{col 26}{space 2} .0332908{col 37}{space 1}   -1.67{col 46}{space 3}0.095{col 54}{space 4}-.1208007{col 67}{space 3} .0097597
{txt}{space 7}2018  {c |}{col 14}{res}{space 2}-.0651334{col 26}{space 2} .0384579{col 37}{space 1}   -1.69{col 46}{space 3}0.090{col 54}{space 4}-.1405458{col 67}{space 3}  .010279
{txt}{space 7}2019  {c |}{col 14}{res}{space 2}-.0614008{col 26}{space 2} .0434352{col 37}{space 1}   -1.41{col 46}{space 3}0.158{col 54}{space 4}-.1465731{col 67}{space 3} .0237715
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0657521{col 26}{space 2} .0235141{col 37}{space 1}    2.80{col 46}{space 3}0.005{col 54}{space 4} .0196431{col 67}{space 3} .1118611
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of absorbed indicators: F({res}3742{txt}, {res}2520{txt}) = {res}1.155{col 62}{txt} Prob > F = {res}0.000
{txt}({res}est5{txt} stored)

{com}. 
. estadd local hast "Yes",replace

{txt}added macro:
               e(hast) : "{res:Yes}"

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/ind/spending_reg_fe.csv", ///
>               label mtitles se  stats(r2 N hast hasid, label("R-squared" "Sample Size" "Time FE" "Individual FE"))  ///
>              drop(_cons *.year) replace
{res}{txt}(output written to {browse  `"C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Tables\/ind/spending_reg_fe.csv"'})

{com}. eststo clear
{txt}
{com}. 
. 
. ************************************************
. ** pesistence of the individual perceived risks **
. ************************************************
. 
. eststo clear
{txt}
{com}. 
. foreach mom in mean var{c -(}
{txt}  2{com}.     xtset ID date
{txt}  3{com}.         replace Inc_mom = inc`mom' 
{txt}  4{com}.     *replace Incmom_ch = Inc`mom'- l1.Inc`mom'
. 
.         eststo `mom'1: reg Inc_mom l(1/3).Inc_mom, vce(cluster date)
{txt}  5{com}.         eststo `mom'2: reg Inc_mom l(1/6).Inc_mom, vce(cluster date)
{txt}  6{com}.         eststo `mom'3: reg Inc_mom l(1/8).Inc_mom, vce(cluster date)
{txt}  7{com}.         
.         replace Inc_mom = rinc`mom'
{txt}  8{com}.         eststo r`mom'1: reg Inc_mom l(1/3).Inc_mom, vce(cluster date)
{txt}  9{com}.         eststo r`mom'2: reg Inc_mom l(1/6).Inc_mom, vce(cluster date)
{txt} 10{com}.         eststo r`mom'3: reg Inc_mom l(1/8).Inc_mom, vce(cluster date)
{txt} 11{com}.  {c )-}
{res}
{col 1}{txt:Panel variable: }{res:ID}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:date}{txt:, }{res:{bind:2013m6}}{txt: to }{res:{bind:2022m12}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 month
{txt}(77,195 real changes made)

Linear regression                               Number of obs     = {res}    35,035
                                                {txt}F(3, 111)         =  {res}  7412.29
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.5386
                                                {txt}Root MSE          =    {res} .01436

{txt}{ralign 78:(Std. err. adjusted for {res:112} clusters in {res:date})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Inc_mom{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Inc_mom {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .3901907{col 26}{space 2} .0085804{col 37}{space 1}   45.47{col 46}{space 3}0.000{col 54}{space 4} .3731881{col 67}{space 3} .4071933
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .2614152{col 26}{space 2} .0087028{col 37}{space 1}   30.04{col 46}{space 3}0.000{col 54}{space 4}   .24417{col 67}{space 3} .2786603
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1793451{col 26}{space 2}  .007238{col 37}{space 1}   24.78{col 46}{space 3}0.000{col 54}{space 4} .1650026{col 67}{space 3} .1936877
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0044367{col 26}{space 2} .0001407{col 37}{space 1}   31.53{col 46}{space 3}0.000{col 54}{space 4} .0041579{col 67}{space 3} .0047155
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}    17,067
                                                {txt}F(6, 108)         =  {res}  2585.64
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.5782
                                                {txt}Root MSE          =    {res} .01321

{txt}{ralign 78:(Std. err. adjusted for {res:109} clusters in {res:date})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Inc_mom{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Inc_mom {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .3480239{col 26}{space 2} .0139942{col 37}{space 1}   24.87{col 46}{space 3}0.000{col 54}{space 4}  .320285{col 67}{space 3} .3757629
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .2126426{col 26}{space 2} .0136237{col 37}{space 1}   15.61{col 46}{space 3}0.000{col 54}{space 4} .1856381{col 67}{space 3} .2396471
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1229639{col 26}{space 2} .0104435{col 37}{space 1}   11.77{col 46}{space 3}0.000{col 54}{space 4} .1022631{col 67}{space 3} .1436647
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .1064956{col 26}{space 2}  .011994{col 37}{space 1}    8.88{col 46}{space 3}0.000{col 54}{space 4} .0827214{col 67}{space 3} .1302697
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0548068{col 26}{space 2} .0106091{col 37}{space 1}    5.17{col 46}{space 3}0.000{col 54}{space 4} .0337776{col 67}{space 3}  .075836
{txt}{space 9}L6. {c |}{col 14}{res}{space 2} .0487509{col 26}{space 2} .0083284{col 37}{space 1}    5.85{col 46}{space 3}0.000{col 54}{space 4} .0322425{col 67}{space 3} .0652593
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  .002829{col 26}{space 2} .0001841{col 37}{space 1}   15.37{col 46}{space 3}0.000{col 54}{space 4} .0024641{col 67}{space 3} .0031938
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     9,585
                                                {txt}F(8, 106)         =  {res}  1223.59
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.5878
                                                {txt}Root MSE          =    {res} .01275

{txt}{ralign 78:(Std. err. adjusted for {res:107} clusters in {res:date})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Inc_mom{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Inc_mom {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .3592204{col 26}{space 2} .0194651{col 37}{space 1}   18.45{col 46}{space 3}0.000{col 54}{space 4} .3206289{col 67}{space 3} .3978119
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .2071588{col 26}{space 2} .0164081{col 37}{space 1}   12.63{col 46}{space 3}0.000{col 54}{space 4} .1746282{col 67}{space 3} .2396894
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1442942{col 26}{space 2} .0141817{col 37}{space 1}   10.17{col 46}{space 3}0.000{col 54}{space 4} .1161776{col 67}{space 3} .1724108
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0801354{col 26}{space 2} .0148303{col 37}{space 1}    5.40{col 46}{space 3}0.000{col 54}{space 4} .0507329{col 67}{space 3} .1095379
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0608897{col 26}{space 2} .0139011{col 37}{space 1}    4.38{col 46}{space 3}0.000{col 54}{space 4} .0333294{col 67}{space 3}   .08845
{txt}{space 9}L6. {c |}{col 14}{res}{space 2} .0233161{col 26}{space 2} .0114097{col 37}{space 1}    2.04{col 46}{space 3}0.043{col 54}{space 4} .0006953{col 67}{space 3}  .045937
{txt}{space 9}L7. {c |}{col 14}{res}{space 2} .0031585{col 26}{space 2} .0106386{col 37}{space 1}    0.30{col 46}{space 3}0.767{col 54}{space 4}-.0179336{col 67}{space 3} .0242505
{txt}{space 9}L8. {c |}{col 14}{res}{space 2} .0191228{col 26}{space 2} .0122925{col 37}{space 1}    1.56{col 46}{space 3}0.123{col 54}{space 4}-.0052482{col 67}{space 3} .0434938
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0027793{col 26}{space 2} .0002398{col 37}{space 1}   11.59{col 46}{space 3}0.000{col 54}{space 4} .0023039{col 67}{space 3} .0032546
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(75,559 real changes made, 6,641 to missing)

Linear regression                               Number of obs     = {res}    29,530
                                                {txt}F(3, 111)         =  {res}  4345.82
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.4940
                                                {txt}Root MSE          =    {res} .02002

{txt}{ralign 78:(Std. err. adjusted for {res:112} clusters in {res:date})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Inc_mom{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Inc_mom {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .3991338{col 26}{space 2} .0100776{col 37}{space 1}   39.61{col 46}{space 3}0.000{col 54}{space 4} .3791644{col 67}{space 3} .4191032
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .2347711{col 26}{space 2} .0069364{col 37}{space 1}   33.85{col 46}{space 3}0.000{col 54}{space 4} .2210261{col 67}{space 3} .2485161
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1587213{col 26}{space 2} .0062605{col 37}{space 1}   25.35{col 46}{space 3}0.000{col 54}{space 4} .1463157{col 67}{space 3} .1711269
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0011982{col 26}{space 2} .0002146{col 37}{space 1}   -5.58{col 46}{space 3}0.000{col 54}{space 4}-.0016234{col 67}{space 3} -.000773
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}    13,754
                                                {txt}F(6, 108)         =  {res}  1728.59
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.5410
                                                {txt}Root MSE          =    {res}  .0182

{txt}{ralign 78:(Std. err. adjusted for {res:109} clusters in {res:date})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Inc_mom{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Inc_mom {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .3688902{col 26}{space 2} .0138932{col 37}{space 1}   26.55{col 46}{space 3}0.000{col 54}{space 4} .3413514{col 67}{space 3}  .396429
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .1964429{col 26}{space 2} .0117528{col 37}{space 1}   16.71{col 46}{space 3}0.000{col 54}{space 4} .1731468{col 67}{space 3}  .219739
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1043223{col 26}{space 2} .0109568{col 37}{space 1}    9.52{col 46}{space 3}0.000{col 54}{space 4}  .082604{col 67}{space 3} .1260406
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0987537{col 26}{space 2} .0119946{col 37}{space 1}    8.23{col 46}{space 3}0.000{col 54}{space 4} .0749784{col 67}{space 3}  .122529
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0489439{col 26}{space 2} .0093688{col 37}{space 1}    5.22{col 46}{space 3}0.000{col 54}{space 4} .0303734{col 67}{space 3} .0675144
{txt}{space 9}L6. {c |}{col 14}{res}{space 2} .0428398{col 26}{space 2} .0086581{col 37}{space 1}    4.95{col 46}{space 3}0.000{col 54}{space 4}  .025678{col 67}{space 3} .0600016
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0008352{col 26}{space 2} .0002204{col 37}{space 1}   -3.79{col 46}{space 3}0.000{col 54}{space 4} -.001272{col 67}{space 3}-.0003983
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     7,505
                                                {txt}F(8, 106)         =  {res}   821.11
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.5621
                                                {txt}Root MSE          =    {res}  .0173

{txt}{ralign 78:(Std. err. adjusted for {res:107} clusters in {res:date})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Inc_mom{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Inc_mom {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .3484938{col 26}{space 2} .0174165{col 37}{space 1}   20.01{col 46}{space 3}0.000{col 54}{space 4}  .313964{col 67}{space 3} .3830237
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .1974623{col 26}{space 2} .0140157{col 37}{space 1}   14.09{col 46}{space 3}0.000{col 54}{space 4} .1696747{col 67}{space 3} .2252498
{txt}{space 9}L3. {c |}{col 14}{res}{space 2}  .124661{col 26}{space 2} .0145973{col 37}{space 1}    8.54{col 46}{space 3}0.000{col 54}{space 4} .0957205{col 67}{space 3} .1536015
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0752665{col 26}{space 2} .0168825{col 37}{space 1}    4.46{col 46}{space 3}0.000{col 54}{space 4} .0417952{col 67}{space 3} .1087378
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0651944{col 26}{space 2} .0145014{col 37}{space 1}    4.50{col 46}{space 3}0.000{col 54}{space 4}  .036444{col 67}{space 3} .0939447
{txt}{space 9}L6. {c |}{col 14}{res}{space 2} .0419143{col 26}{space 2}  .014988{col 37}{space 1}    2.80{col 46}{space 3}0.006{col 54}{space 4} .0121991{col 67}{space 3} .0716294
{txt}{space 9}L7. {c |}{col 14}{res}{space 2} .0029443{col 26}{space 2} .0126404{col 37}{space 1}    0.23{col 46}{space 3}0.816{col 54}{space 4}-.0221164{col 67}{space 3} .0280051
{txt}{space 9}L8. {c |}{col 14}{res}{space 2} .0197179{col 26}{space 2} .0092578{col 37}{space 1}    2.13{col 46}{space 3}0.035{col 54}{space 4} .0013634{col 67}{space 3} .0380725
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0008745{col 26}{space 2}  .000265{col 37}{space 1}   -3.30{col 46}{space 3}0.001{col 54}{space 4}-.0013999{col 67}{space 3} -.000349
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{col 1}{txt:Panel variable: }{res:ID}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:date}{txt:, }{res:{bind:2013m6}}{txt: to }{res:{bind:2022m12}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 month
{txt}(81,243 real changes made, 6,799 to missing)

Linear regression                               Number of obs     = {res}    31,211
                                                {txt}F(3, 111)         =  {res}  2424.74
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.4608
                                                {txt}Root MSE          =    {res} .00053

{txt}{ralign 78:(Std. err. adjusted for {res:112} clusters in {res:date})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Inc_mom{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Inc_mom {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .3464731{col 26}{space 2} .0114996{col 37}{space 1}   30.13{col 46}{space 3}0.000{col 54}{space 4} .3236859{col 67}{space 3} .3692604
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}  .249163{col 26}{space 2} .0114502{col 37}{space 1}   21.76{col 46}{space 3}0.000{col 54}{space 4} .2264737{col 67}{space 3} .2718524
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1787904{col 26}{space 2} .0098748{col 37}{space 1}   18.11{col 46}{space 3}0.000{col 54}{space 4} .1592228{col 67}{space 3}  .198358
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0000751{col 26}{space 2} 3.34e-06{col 37}{space 1}   22.46{col 46}{space 3}0.000{col 54}{space 4} .0000685{col 67}{space 3} .0000817
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}    14,241
                                                {txt}F(6, 108)         =  {res}   648.67
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.5143
                                                {txt}Root MSE          =    {res} .00049

{txt}{ralign 78:(Std. err. adjusted for {res:109} clusters in {res:date})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Inc_mom{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Inc_mom {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .3070565{col 26}{space 2} .0185552{col 37}{space 1}   16.55{col 46}{space 3}0.000{col 54}{space 4} .2702769{col 67}{space 3}  .343836
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .2084384{col 26}{space 2} .0173007{col 37}{space 1}   12.05{col 46}{space 3}0.000{col 54}{space 4} .1741455{col 67}{space 3} .2427314
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1552649{col 26}{space 2} .0132989{col 37}{space 1}   11.68{col 46}{space 3}0.000{col 54}{space 4} .1289042{col 67}{space 3} .1816256
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0977185{col 26}{space 2} .0151678{col 37}{space 1}    6.44{col 46}{space 3}0.000{col 54}{space 4} .0676533{col 67}{space 3} .1277836
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0662453{col 26}{space 2} .0139626{col 37}{space 1}    4.74{col 46}{space 3}0.000{col 54}{space 4} .0385691{col 67}{space 3} .0939215
{txt}{space 9}L6. {c |}{col 14}{res}{space 2} .0510316{col 26}{space 2} .0117651{col 37}{space 1}    4.34{col 46}{space 3}0.000{col 54}{space 4} .0277111{col 67}{space 3} .0743521
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0000363{col 26}{space 2} 4.54e-06{col 37}{space 1}    8.00{col 46}{space 3}0.000{col 54}{space 4} .0000273{col 67}{space 3} .0000453
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     7,673
                                                {txt}F(8, 106)         =  {res}   317.73
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.5300
                                                {txt}Root MSE          =    {res} .00046

{txt}{ralign 78:(Std. err. adjusted for {res:107} clusters in {res:date})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Inc_mom{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Inc_mom {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .2936904{col 26}{space 2} .0273985{col 37}{space 1}   10.72{col 46}{space 3}0.000{col 54}{space 4} .2393703{col 67}{space 3} .3480106
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .1783694{col 26}{space 2}  .022326{col 37}{space 1}    7.99{col 46}{space 3}0.000{col 54}{space 4}  .134106{col 67}{space 3} .2226329
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1786078{col 26}{space 2} .0207934{col 37}{space 1}    8.59{col 46}{space 3}0.000{col 54}{space 4} .1373828{col 67}{space 3} .2198328
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .0460427{col 26}{space 2} .0235512{col 37}{space 1}    1.96{col 46}{space 3}0.053{col 54}{space 4}-.0006498{col 67}{space 3} .0927352
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0600529{col 26}{space 2}  .022227{col 37}{space 1}    2.70{col 46}{space 3}0.008{col 54}{space 4} .0159857{col 67}{space 3} .1041202
{txt}{space 9}L6. {c |}{col 14}{res}{space 2} .0554892{col 26}{space 2} .0165146{col 37}{space 1}    3.36{col 46}{space 3}0.001{col 54}{space 4} .0227475{col 67}{space 3}  .088231
{txt}{space 9}L7. {c |}{col 14}{res}{space 2} .0330065{col 26}{space 2}  .013895{col 37}{space 1}    2.38{col 46}{space 3}0.019{col 54}{space 4} .0054583{col 67}{space 3} .0605546
{txt}{space 9}L8. {c |}{col 14}{res}{space 2} .0444748{col 26}{space 2} .0133814{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4}  .017945{col 67}{space 3} .0710046
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0000265{col 26}{space 2} 5.97e-06{col 37}{space 1}    4.45{col 46}{space 3}0.000{col 54}{space 4} .0000147{col 67}{space 3} .0000384
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(76,135 real changes made, 4,420 to missing)

Linear regression                               Number of obs     = {res}    29,382
                                                {txt}F(3, 111)         =  {res}  2629.74
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.4424
                                                {txt}Root MSE          =    {res} .00111

{txt}{ralign 78:(Std. err. adjusted for {res:112} clusters in {res:date})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Inc_mom{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Inc_mom {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}  .372481{col 26}{space 2} .0093309{col 37}{space 1}   39.92{col 46}{space 3}0.000{col 54}{space 4} .3539912{col 67}{space 3} .3909708
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .2313161{col 26}{space 2} .0088915{col 37}{space 1}   26.02{col 46}{space 3}0.000{col 54}{space 4} .2136971{col 67}{space 3} .2489352
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1465751{col 26}{space 2} .0086461{col 37}{space 1}   16.95{col 46}{space 3}0.000{col 54}{space 4} .1294422{col 67}{space 3}  .163708
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0002124{col 26}{space 2} 9.03e-06{col 37}{space 1}   23.53{col 46}{space 3}0.000{col 54}{space 4} .0001945{col 67}{space 3} .0002303
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}    13,260
                                                {txt}F(6, 108)         =  {res}   870.02
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.5030
                                                {txt}Root MSE          =    {res}   .001

{txt}{ralign 78:(Std. err. adjusted for {res:109} clusters in {res:date})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Inc_mom{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Inc_mom {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .3282721{col 26}{space 2} .0152392{col 37}{space 1}   21.54{col 46}{space 3}0.000{col 54}{space 4} .2980654{col 67}{space 3} .3584787
{txt}{space 9}L2. {c |}{col 14}{res}{space 2} .1824968{col 26}{space 2}  .016844{col 37}{space 1}   10.83{col 46}{space 3}0.000{col 54}{space 4} .1491091{col 67}{space 3} .2158845
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1516762{col 26}{space 2} .0164514{col 37}{space 1}    9.22{col 46}{space 3}0.000{col 54}{space 4} .1190667{col 67}{space 3} .1842857
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .1199526{col 26}{space 2} .0138597{col 37}{space 1}    8.65{col 46}{space 3}0.000{col 54}{space 4} .0924803{col 67}{space 3} .1474248
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0413021{col 26}{space 2} .0127617{col 37}{space 1}    3.24{col 46}{space 3}0.002{col 54}{space 4} .0160061{col 67}{space 3} .0665981
{txt}{space 9}L6. {c |}{col 14}{res}{space 2} .0384697{col 26}{space 2} .0105279{col 37}{space 1}    3.65{col 46}{space 3}0.000{col 54}{space 4} .0176016{col 67}{space 3} .0593379
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0001052{col 26}{space 2} .0000123{col 37}{space 1}    8.57{col 46}{space 3}0.000{col 54}{space 4} .0000809{col 67}{space 3} .0001296
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     7,086
                                                {txt}F(8, 106)         =  {res}   375.09
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.5177
                                                {txt}Root MSE          =    {res} .00095

{txt}{ralign 78:(Std. err. adjusted for {res:107} clusters in {res:date})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     Inc_mom{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Inc_mom {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .3032586{col 26}{space 2}  .020558{col 37}{space 1}   14.75{col 46}{space 3}0.000{col 54}{space 4} .2625004{col 67}{space 3} .3440169
{txt}{space 9}L2. {c |}{col 14}{res}{space 2}  .157875{col 26}{space 2} .0208979{col 37}{space 1}    7.55{col 46}{space 3}0.000{col 54}{space 4}  .116443{col 67}{space 3} .1993071
{txt}{space 9}L3. {c |}{col 14}{res}{space 2} .1584439{col 26}{space 2} .0258344{col 37}{space 1}    6.13{col 46}{space 3}0.000{col 54}{space 4} .1072247{col 67}{space 3}  .209663
{txt}{space 9}L4. {c |}{col 14}{res}{space 2} .1210106{col 26}{space 2} .0237444{col 37}{space 1}    5.10{col 46}{space 3}0.000{col 54}{space 4}  .073935{col 67}{space 3} .1680862
{txt}{space 9}L5. {c |}{col 14}{res}{space 2} .0610368{col 26}{space 2} .0211561{col 37}{space 1}    2.89{col 46}{space 3}0.005{col 54}{space 4} .0190927{col 67}{space 3} .1029809
{txt}{space 9}L6. {c |}{col 14}{res}{space 2} .0468002{col 26}{space 2} .0150547{col 37}{space 1}    3.11{col 46}{space 3}0.002{col 54}{space 4} .0169528{col 67}{space 3} .0766476
{txt}{space 9}L7. {c |}{col 14}{res}{space 2} .0327697{col 26}{space 2} .0141726{col 37}{space 1}    2.31{col 46}{space 3}0.023{col 54}{space 4} .0046712{col 67}{space 3} .0608683
{txt}{space 9}L8. {c |}{col 14}{res}{space 2}-.0043812{col 26}{space 2} .0097856{col 37}{space 1}   -0.45{col 46}{space 3}0.655{col 54}{space 4} -.023782{col 67}{space 3} .0150197
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0000936{col 26}{space 2} .0000162{col 37}{space 1}    5.76{col 46}{space 3}0.000{col 54}{space 4} .0000614{col 67}{space 3} .0001257
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.  
.   
. esttab using "${c -(}sum_table_folder{c )-}/ind/autoregIndM.csv", mtitles se  r2 replace
{res}{txt}(output written to {browse  `"C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\Tables\/ind/autoregIndM.csv"'})

{com}. eststo clear
{txt}
{com}. 
. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\want\OneDrive - Bank of Canada\MyDocs\GitHub\PIR\WorkingFolder\/indSCE_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 3 Nov 2023, 14:31:00
{txt}{.-}
{smcl}
{txt}{sf}{ul off}