{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/PIR/WorkingFolder/indSCE_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}13 Jun 2022, 18:34:21
{txt}
{com}. 
. 
. *********************************************************
. *** before working with SCE, clean the macro monthly data 
. ********************************************************
. 
. use "${c -(}mainfolder{c )-}/OtherData/macroM_raw.dta",clear 
{txt}
{com}. 
. generate new_date = dofc(DATE)
{txt}
{com}. *format new_date %tm
. gen year = year(new_date)
{txt}
{com}. gen month = month(new_date)
{txt}
{com}. gen date_str = string(year)+ "m"+string(month)
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop DATE date_str year month new_date 
{txt}
{com}. label var sp500 "growth rate (%) of sp500 index from last month"
{txt}
{com}. rename ue uerate
{res}{txt}
{com}. label var uerate "unemployment rate"
{txt}
{com}. label var he "quarterly growth in hourly earning"
{txt}
{com}. label var vix "vix indices"
{txt}
{com}. save "${c -(}mainfolder{c )-}/OtherData/macroM.dta",replace 
{txt}file /Users/Myworld/Dropbox/PIR/WorkingFolder/OtherData/macroM.dta saved

{com}. clear 
{txt}
{com}. 
. 
. *****************************************
. ** Prepare estimated income risks data **
. ******************************************
. 
. ** full sample
. use "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed.dta", clear 
{txt}
{com}. 
. drop index 
{txt}
{com}. gen year = floor(YM/100)
{txt}
{com}. gen month = YM - year*100
{txt}
{com}. gen date_str=string(year)+"M"+string(month)
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop date_str 
{txt}
{com}. 
. table date

{txt}{hline 10}{c TT}{hline 11}
     date {c |}      Freq.
{hline 10}{c +}{hline 11}
   2013m3 {c |}          {res}1
   {txt}2013m4 {c |}          {res}1
   {txt}2013m5 {c |}          {res}1
   {txt}2013m6 {c |}          {res}1
   {txt}2013m7 {c |}          {res}1
   {txt}2013m8 {c |}          {res}1
   {txt}2013m9 {c |}          {res}1
  {txt}2013m10 {c |}          {res}1
  {txt}2013m11 {c |}          {res}1
  {txt}2013m12 {c |}          {res}1
   {txt}2014m1 {c |}          {res}1
   {txt}2014m2 {c |}          {res}1
   {txt}2014m3 {c |}          {res}1
   {txt}2014m4 {c |}          {res}1
   {txt}2014m5 {c |}          {res}1
   {txt}2014m6 {c |}          {res}1
   {txt}2014m7 {c |}          {res}1
   {txt}2014m8 {c |}          {res}1
   {txt}2014m9 {c |}          {res}1
  {txt}2014m10 {c |}          {res}1
  {txt}2014m11 {c |}          {res}1
  {txt}2014m12 {c |}          {res}1
   {txt}2015m1 {c |}          {res}1
   {txt}2015m2 {c |}          {res}1
   {txt}2015m3 {c |}          {res}1
   {txt}2015m4 {c |}          {res}1
   {txt}2015m5 {c |}          {res}1
   {txt}2015m6 {c |}          {res}1
   {txt}2015m7 {c |}          {res}1
   {txt}2015m8 {c |}          {res}1
   {txt}2015m9 {c |}          {res}1
  {txt}2015m10 {c |}          {res}1
  {txt}2015m11 {c |}          {res}1
  {txt}2015m12 {c |}          {res}1
   {txt}2016m1 {c |}          {res}1
   {txt}2016m2 {c |}          {res}1
   {txt}2016m3 {c |}          {res}1
   {txt}2016m4 {c |}          {res}1
   {txt}2016m5 {c |}          {res}1
   {txt}2016m6 {c |}          {res}1
   {txt}2016m7 {c |}          {res}1
   {txt}2016m8 {c |}          {res}1
   {txt}2016m9 {c |}          {res}1
  {txt}2016m10 {c |}          {res}1
  {txt}2016m11 {c |}          {res}1
  {txt}2016m12 {c |}          {res}1
   {txt}2017m1 {c |}          {res}1
   {txt}2017m2 {c |}          {res}1
   {txt}2017m3 {c |}          {res}1
   {txt}2017m4 {c |}          {res}1
   {txt}2017m5 {c |}          {res}1
   {txt}2017m6 {c |}          {res}1
   {txt}2017m7 {c |}          {res}1
   {txt}2017m8 {c |}          {res}1
   {txt}2017m9 {c |}          {res}1
  {txt}2017m10 {c |}          {res}1
  {txt}2017m11 {c |}          {res}1
  {txt}2017m12 {c |}          {res}1
   {txt}2018m1 {c |}          {res}1
   {txt}2018m2 {c |}          {res}1
   {txt}2018m3 {c |}          {res}1
   {txt}2018m4 {c |}          {res}1
   {txt}2018m5 {c |}          {res}1
   {txt}2018m6 {c |}          {res}1
   {txt}2018m7 {c |}          {res}1
   {txt}2018m8 {c |}          {res}1
   {txt}2018m9 {c |}          {res}1
  {txt}2018m10 {c |}          {res}1
  {txt}2018m11 {c |}          {res}1
  {txt}2018m12 {c |}          {res}1
   {txt}2019m1 {c |}          {res}1
   {txt}2019m2 {c |}          {res}1
   {txt}2019m3 {c |}          {res}1
   {txt}2019m4 {c |}          {res}1
   {txt}2019m5 {c |}          {res}1
   {txt}2019m6 {c |}          {res}1
   {txt}2019m7 {c |}          {res}1
   {txt}2019m8 {c |}          {res}1
   {txt}2019m9 {c |}          {res}1
  {txt}2019m10 {c |}          {res}1
  {txt}2019m11 {c |}          {res}1
  {txt}2019m12 {c |}          {res}1
{txt}{hline 10}{c BT}{hline 11}

{com}. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 2013m3 to 2019m12
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. tsfill
{txt}
{com}. replace month=1 if f1.month==2 & month==.
{txt}(0 real changes made)

{com}. replace year = f1.year if f1.month==2 & month==1
{txt}(0 real changes made)

{com}. replace YM = 100*year+month if YM==.
{txt}(0 real changes made)

{com}. 
. 
. rename permanent prisk_all
{res}{txt}
{com}. rename transitory trisk_all
{res}{txt}
{com}. label var prisk_all "estimated full-sample permanent risk(std)"
{txt}
{com}. label var trisk_all "estimated full-sample transitory risk (std)"
{txt}
{com}. 
. ** estimated risks in variances 
. 
. gen prisk2_all=prisk_all^2
{txt}(5 missing values generated)

{com}. gen trisk2_all=trisk_all^2
{txt}
{com}. 
. 
. label var prisk2_all "full sample permanent risk (var)"
{txt}
{com}. label var trisk2_all "full sample transitory risk  (var)"
{txt}
{com}. 
. 
. ***********************************
. ** Fill some estimation risk for january 
. *************************************
. 
. replace prisk2_all=(l1.prisk2_all+f1.prisk2_all)/2 if month==1
{txt}(6 real changes made)

{com}. replace trisk2_all=(l1.trisk2_all+f1.trisk2_all)/2 if month==1
{txt}(6 real changes made)

{com}. 
. ***********************************
. ** Time aggregation of estimation risk
. *************************************
. 
. foreach x in all{c -(}
{txt}  2{com}. gen prisk2_`x'_rl = (f1.prisk2_`x'+f2.prisk2_`x'+f3.prisk2_`x'+f4.prisk2_`x'+ ///
>                       f5.prisk2_`x'+f6.prisk2_`x'+f7.prisk2_`x'+f8.prisk2_`x'+ ///
>                                           f9.prisk2_`x'+ f10.prisk2_`x'+ f11.prisk2_`x'+f12.prisk2_`x') 
{txt}  3{com}. 
. gen trisk2_`x'_rl = (f1.trisk2_`x'+f2.trisk2_`x'+f3.trisk2_`x'+f4.trisk2_`x'+ ///
>                       f5.trisk2_`x'+f6.trisk2_`x'+f7.trisk2_`x'+f8.trisk2_`x'+ ///
>                                           f9.trisk2_`x'+ f10.trisk2_`x'+ f11.trisk2_`x'+f12.trisk2_`x')/12
{txt}  4{com}. 
. gen rincvar_`x'_rl = prisk2_`x'_rl+ trisk2_`x'_rl
{txt}  5{com}. {c )-}
{txt}(12 missing values generated)
(12 missing values generated)
(12 missing values generated)

{com}. 
. label var rincvar_all_rl "realized full-sample annual risk 12 m from now"
{txt}
{com}. 
. 
. gen rincvar_all_now = l12.rincvar_all_rl
{txt}(12 missing values generated)

{com}. label var rincvar_all_now "realized full-sample annual risk since 12 m ago"
{txt}
{com}. 
. drop year month
{txt}
{com}. save "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_annual.dta",replace 
{txt}file /Users/Myworld/Dropbox/PIR/WorkingFolder/OtherData/sipp/sipp_history_vol_decomposed_annual.dta saved

{com}. 
. 
. *****************************
. ** subsample sample
. ******************************
. 
. use "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_edu_gender_age5.dta", clear
{txt}
{com}. 
. drop index 
{txt}
{com}. gen year = floor(YM/100)
{txt}
{com}. gen month = YM - year*100
{txt}
{com}. gen date_str=string(year)+"M"+string(month)
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop date_str 
{txt}
{com}. 
. table date

{txt}{hline 10}{c TT}{hline 11}
     date {c |}      Freq.
{hline 10}{c +}{hline 11}
   2013m3 {c |}         {res}48
   {txt}2013m4 {c |}         {res}48
   {txt}2013m5 {c |}         {res}48
   {txt}2013m6 {c |}         {res}48
   {txt}2013m7 {c |}         {res}48
   {txt}2013m8 {c |}         {res}48
   {txt}2013m9 {c |}         {res}48
  {txt}2013m10 {c |}         {res}48
  {txt}2013m11 {c |}         {res}48
  {txt}2013m12 {c |}         {res}48
   {txt}2014m1 {c |}         {res}48
   {txt}2014m2 {c |}         {res}48
   {txt}2014m3 {c |}         {res}48
   {txt}2014m4 {c |}         {res}48
   {txt}2014m5 {c |}         {res}48
   {txt}2014m6 {c |}         {res}48
   {txt}2014m7 {c |}         {res}48
   {txt}2014m8 {c |}         {res}48
   {txt}2014m9 {c |}         {res}48
  {txt}2014m10 {c |}         {res}48
  {txt}2014m11 {c |}         {res}48
  {txt}2014m12 {c |}         {res}48
   {txt}2015m1 {c |}         {res}48
   {txt}2015m2 {c |}         {res}48
   {txt}2015m3 {c |}         {res}48
   {txt}2015m4 {c |}         {res}48
   {txt}2015m5 {c |}         {res}48
   {txt}2015m6 {c |}         {res}48
   {txt}2015m7 {c |}         {res}48
   {txt}2015m8 {c |}         {res}48
   {txt}2015m9 {c |}         {res}48
  {txt}2015m10 {c |}         {res}48
  {txt}2015m11 {c |}         {res}48
  {txt}2015m12 {c |}         {res}48
   {txt}2016m1 {c |}         {res}48
   {txt}2016m2 {c |}         {res}48
   {txt}2016m3 {c |}         {res}48
   {txt}2016m4 {c |}         {res}48
   {txt}2016m5 {c |}         {res}48
   {txt}2016m6 {c |}         {res}48
   {txt}2016m7 {c |}         {res}48
   {txt}2016m8 {c |}         {res}48
   {txt}2016m9 {c |}         {res}48
  {txt}2016m10 {c |}         {res}48
  {txt}2016m11 {c |}         {res}48
  {txt}2016m12 {c |}         {res}48
   {txt}2017m1 {c |}         {res}48
   {txt}2017m2 {c |}         {res}48
   {txt}2017m3 {c |}         {res}48
   {txt}2017m4 {c |}         {res}48
   {txt}2017m5 {c |}         {res}48
   {txt}2017m6 {c |}         {res}48
   {txt}2017m7 {c |}         {res}48
   {txt}2017m8 {c |}         {res}48
   {txt}2017m9 {c |}         {res}48
  {txt}2017m10 {c |}         {res}48
  {txt}2017m11 {c |}         {res}48
  {txt}2017m12 {c |}         {res}48
   {txt}2018m1 {c |}         {res}48
   {txt}2018m2 {c |}         {res}48
   {txt}2018m3 {c |}         {res}48
   {txt}2018m4 {c |}         {res}48
   {txt}2018m5 {c |}         {res}48
   {txt}2018m6 {c |}         {res}48
   {txt}2018m7 {c |}         {res}48
   {txt}2018m8 {c |}         {res}48
   {txt}2018m9 {c |}         {res}48
  {txt}2018m10 {c |}         {res}48
  {txt}2018m11 {c |}         {res}48
  {txt}2018m12 {c |}         {res}48
   {txt}2019m1 {c |}         {res}48
   {txt}2019m2 {c |}         {res}48
   {txt}2019m3 {c |}         {res}48
   {txt}2019m4 {c |}         {res}48
   {txt}2019m5 {c |}         {res}48
   {txt}2019m6 {c |}         {res}48
   {txt}2019m7 {c |}         {res}48
   {txt}2019m8 {c |}         {res}48
   {txt}2019m9 {c |}         {res}48
  {txt}2019m10 {c |}         {res}48
  {txt}2019m11 {c |}         {res}48
  {txt}2019m12 {c |}         {res}48
{txt}{hline 10}{c BT}{hline 11}

{com}. ************************************************
. egen groupid = group(gender educ age_5yr)
{txt}
{com}. xtset groupid date 
{res}{txt}{col 8}panel variable:  {res}groupid (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m3 to 2019m12
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. 
. ********************************************
. rename permanent prisk_sub
{res}{txt}
{com}. rename transitory trisk_sub
{res}{txt}
{com}. label var prisk_sub "estimated sub-sample permanent risk(std)"
{txt}
{com}. label var trisk_sub "estimated sub-sample transitory risk (std)"
{txt}
{com}. 
. ** estimated risks in variances 
. gen prisk2_sub=prisk_sub^2
{txt}(240 missing values generated)

{com}. gen trisk2_sub = trisk_sub^2 
{txt}
{com}. 
. label var prisk2_sub "sub sample permanent risk  (var)"
{txt}
{com}. label var trisk2_sub "sub sample transitory risk  (var)"
{txt}
{com}. 
. 
. foreach var in prisk2_sub trisk2_sub{c -(}
{txt}  2{com}.       egen `var'pl=pctile(`var'),p(1) by(date)
{txt}  3{com}.           egen `var'pu=pctile(`var'),p(99) by(date)
{txt}  4{com}.           replace `var' = . if `var' <`var'pl | (`var' >`var'pu & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(240 missing values generated)
(240 missing values generated)
(0 real changes made)
(0 real changes made)

{com}. 
. ***********************************
. ** Fill some estimation risk for january 
. *************************************
. 
. replace prisk2_sub=(l1.prisk2_sub+f1.prisk2_sub)/2 if month==1
{txt}(288 real changes made)

{com}. replace trisk2_sub=(l1.trisk2_sub+f1.trisk2_sub)/2 if month==1
{txt}(288 real changes made)

{com}. 
. ***********************************
. ** Time aggregation of estimation risk
. *************************************
. 
. foreach x in sub{c -(}
{txt}  2{com}. gen prisk2_`x'_rl = (f1.prisk2_`x'+f2.prisk2_`x'+f3.prisk2_`x'+f4.prisk2_`x'+ ///
>                       f5.prisk2_`x'+f6.prisk2_`x'+f7.prisk2_`x'+f8.prisk2_`x'+ ///
>                                           f9.prisk2_`x'+ f10.prisk2_`x'+ f11.prisk2_`x'+f12.prisk2_`x') 
{txt}  3{com}. 
. gen trisk2_`x'_rl = (f1.trisk2_`x'+f2.trisk2_`x'+f3.trisk2_`x'+f4.trisk2_`x'+ ///
>                       f5.trisk2_`x'+f6.trisk2_`x'+f7.trisk2_`x'+f8.trisk2_`x'+ ///
>                                           f9.trisk2_`x'+ f10.trisk2_`x'+ f11.trisk2_`x'+f12.trisk2_`x')/12 
{txt}  4{com}. 
. gen rincvar_`x'_rl = prisk2_`x'_rl+ trisk2_`x'_rl
{txt}  5{com}. {c )-}
{txt}(576 missing values generated)
(576 missing values generated)
(576 missing values generated)

{com}. 
. label var rincvar_sub_rl "realized sub-sample annual risk"
{txt}
{com}. 
. gen rincvar_sub_now = l12.rincvar_sub_rl
{txt}(576 missing values generated)

{com}. label var rincvar_sub_now "realized sub-sample annual risk since 12m ago"
{txt}
{com}. drop year month groupid 
{txt}
{com}. save "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_edu_gender_age5_annual.dta",replace
{txt}file /Users/Myworld/Dropbox/PIR/WorkingFolder/OtherData/sipp/sipp_history_vol_decomposed_edu_gender_age5_annual.dta saved

{com}.  
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}       {res}115083             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. ************************************
. **  merge with estimated moments **
. ***********************************
. 
. * IncExpSCEDstIndM is the output from ../Pythoncode/DoDensityEst.ipynb
. merge 1:1 userid date using "${c -(}folder{c )-}/SCE/IncExpSCEDstIndM.dta", keep(master match) 
{res}{txt}{p 0 7 2}
(note: variable
date was 
float, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
month was 
byte, now float to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}         115,083
{txt}{col 9}from master{col 30}{res}         115,083{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}               0{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge IndEst_merge
{res}{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}       {res}115083             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. 
. ** merge labor market module  
. merge 1:1 year month userid using "${c -(}otherfolder{c )-}/data/SCE/LaborExpSCEIndM", keep(master match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          98,478
{txt}{col 9}from master{col 30}{res}          98,478{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          16,605{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge labor_merge
{res}{txt}
{com}. rename userid ID 
{res}{txt}
{com}. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. rename Q24_mean incmean
{res}{txt}
{com}. rename Q24_var incvar
{res}{txt}
{com}. rename Q24_iqr inciqr
{res}{txt}
{com}. rename IncSkew incskew 
{res}{txt}
{com}. rename Q24_rmean rincmean
{res}{txt}
{com}. rename Q24_rvar rincvar
{res}{txt}
{com}. 
. *rename Q36 educ
. rename D6 HHinc 
{res}{txt}
{com}. rename Q32 age 
{res}{txt}
{com}. rename Q33 gender 
{res}{txt}
{com}. gen fulltime = Q10_1 
{txt}
{com}. gen parttime = Q10_2 
{txt}
{com}. rename Q12new selfemp
{res}{txt}
{com}. gen Stkprob= Q6new/100
{txt}(851 missing values generated)

{com}. gen UEprobAgg=Q4new/100
{txt}(299 missing values generated)

{com}. gen  UEprobInd4m = oo1_5/100
{txt}(106887 missing values generated)

{com}. gen UEprobInd=Q13new/100
{txt}(41918 missing values generated)

{com}. rename Q26v2 spending_dum
{res}{txt}
{com}. rename Q26v2part2 spending 
{res}{txt}
{com}. replace spending = spending/100
{txt}(108735 real changes made)

{com}. 
. gen exp_offer = oo2u/100
{txt}(111904 missing values generated)

{com}. gen EUprobInd = Q22new/100
{txt}(41709 missing values generated)

{com}. 
. ***********************
. ** merge other data ***
. **************************
. 
. 
. **macro data
. merge m:1 date using "${c -(}mainfolder{c )-}/OtherData/macroM.dta",keep(master match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          17,650
{txt}{col 9}from master{col 30}{res}          17,650{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          97,433{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename cpi CPIAU
{res}{txt}
{com}. drop _merge 
{txt}
{com}. 
. 
. * flow rate data
. merge m:1 year month using "${c -(}otherdata_folder{c )-}/CPS_worker_flows_SA.dta",keep(master match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}         115,083{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge 
{txt}
{com}. 
. 
. * income risk estimation data
. gen YM = year*100+month
{txt}
{com}. 
. ** merge population estimation 
. merge m:1 YM using "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_annual.dta", keep(master match)
{res}{txt}{p 0 7 2}
(note: variable
YM was 
float, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          21,142
{txt}{col 9}from master{col 30}{res}          21,142{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          93,941{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge 
{txt}
{com}. 
. ********************
. ** group variables *
. ********************
. 
. egen byear_5yr = cut(byear), ///
>      at(1915 1920 1925 1930 1935 1940 ///
>             1945 1950 1955 1960 1965 1970 ///
>             1975 1980 1985 1990 1995 2000 ///
>                 2005 2010)
{txt}
{com}. label var byear_5yr "5-year cohort"
{txt}
{com}. 
. egen age_5yr = cut(age), ///
>      at(20 25 30 35 40 45 ///
>             50 55 60)
{txt}(29738 missing values generated)

{com}. label var age_5yr "5-year age"
{txt}
{com}. 
. 
. gen edu_g = . 
{txt}(115083 missing values generated)

{com}. replace edu_g = 1 if educ==1
{txt}(987 real changes made)

{com}. replace edu_g = 2 if educ==2 | educ ==3 | educ == 4
{txt}(49240 real changes made)

{com}. replace edu_g = 3 if educ <=9 & educ>4
{txt}(64856 real changes made)

{com}. 
. label var edu_g "education group"
{txt}
{com}. label define edu_glb 1 "HS dropout" 2 "HS graduate" 3 "College/above"
{txt}
{com}. label value edu_g edu_glb
{txt}
{com}. 
. replace educ = edu_g 
{txt}(102496 real changes made)

{com}. 
. merge m:1 gender educ age_5yr YM ///
>          using "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_edu_gender_age5_annual.dta", keep(master match)
{res}{txt}{p 0 7 2}
(note: variable
educ was 
float, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
gender was 
byte, now long to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
age_5yr was 
float, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          56,019
{txt}{col 9}from master{col 30}{res}          56,019{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          59,064{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge 
{txt}
{com}. 
. ** 
. merge m:1 gender educ age_5yr ///
>          using "${c -(}otherdata_folder{c )-}/sipp/sipp_vol_edu_gender_age5.dta", keep(master match)
{res}{txt}{p 0 7 2}
(note: variable
gender was 
long, now double to accommodate using data's values)
{p_end}
(label edu_glb already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          15,774
{txt}{col 9}from master{col 30}{res}          15,774{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          99,309{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge 
{txt}
{com}. 
. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. 
. xtset ID date
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2021m7, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. sort ID date
{txt}
{com}. 
. *******************************
. ** Exclude youth and retired
. ******************************
. keep if age <= 60 & age >= 20
{txt}(26695 observations deleted)

{com}. 
. *******************************
. **  Summary Statistics of SCE **
. *******************************
. 
. tabstat ID,s(count) by(date) column(statistics)

{txt}Summary for variables: ID
{col 6}by categories of: date 

{ralign 9:date} {...}
{c |}         N
{hline 10}{c +}{hline 10}
{ralign 9: 2013m6} {...}
{c |}{...}
 {res}      891
{txt}{ralign 9: 2013m7} {...}
{c |}{...}
 {res}      850
{txt}{ralign 9: 2013m8} {...}
{c |}{...}
 {res}     1233
{txt}{ralign 9: 2013m9} {...}
{c |}{...}
 {res}     1082
{txt}{ralign 9:2013m10} {...}
{c |}{...}
 {res}     1091
{txt}{ralign 9:2013m11} {...}
{c |}{...}
 {res}     1083
{txt}{ralign 9:2013m12} {...}
{c |}{...}
 {res}      947
{txt}{ralign 9: 2014m1} {...}
{c |}{...}
 {res}      938
{txt}{ralign 9: 2014m2} {...}
{c |}{...}
 {res}      915
{txt}{ralign 9: 2014m3} {...}
{c |}{...}
 {res}      938
{txt}{ralign 9: 2014m4} {...}
{c |}{...}
 {res}      927
{txt}{ralign 9: 2014m5} {...}
{c |}{...}
 {res}      892
{txt}{ralign 9: 2014m6} {...}
{c |}{...}
 {res}      910
{txt}{ralign 9: 2014m7} {...}
{c |}{...}
 {res}      954
{txt}{ralign 9: 2014m8} {...}
{c |}{...}
 {res}      936
{txt}{ralign 9: 2014m9} {...}
{c |}{...}
 {res}      915
{txt}{ralign 9:2014m10} {...}
{c |}{...}
 {res}      903
{txt}{ralign 9:2014m11} {...}
{c |}{...}
 {res}      913
{txt}{ralign 9:2014m12} {...}
{c |}{...}
 {res}      882
{txt}{ralign 9: 2015m1} {...}
{c |}{...}
 {res}      900
{txt}{ralign 9: 2015m2} {...}
{c |}{...}
 {res}      907
{txt}{ralign 9: 2015m3} {...}
{c |}{...}
 {res}      869
{txt}{ralign 9: 2015m4} {...}
{c |}{...}
 {res}      885
{txt}{ralign 9: 2015m5} {...}
{c |}{...}
 {res}      891
{txt}{ralign 9: 2015m6} {...}
{c |}{...}
 {res}      885
{txt}{ralign 9: 2015m7} {...}
{c |}{...}
 {res}      869
{txt}{ralign 9: 2015m8} {...}
{c |}{...}
 {res}      848
{txt}{ralign 9: 2015m9} {...}
{c |}{...}
 {res}      879
{txt}{ralign 9:2015m10} {...}
{c |}{...}
 {res}      868
{txt}{ralign 9:2015m11} {...}
{c |}{...}
 {res}      866
{txt}{ralign 9:2015m12} {...}
{c |}{...}
 {res}      843
{txt}{ralign 9: 2016m1} {...}
{c |}{...}
 {res}      861
{txt}{ralign 9: 2016m2} {...}
{c |}{...}
 {res}      815
{txt}{ralign 9: 2016m3} {...}
{c |}{...}
 {res}      872
{txt}{ralign 9: 2016m4} {...}
{c |}{...}
 {res}      841
{txt}{ralign 9: 2016m5} {...}
{c |}{...}
 {res}      879
{txt}{ralign 9: 2016m6} {...}
{c |}{...}
 {res}      877
{txt}{ralign 9: 2016m7} {...}
{c |}{...}
 {res}      918
{txt}{ralign 9: 2016m8} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9: 2016m9} {...}
{c |}{...}
 {res}      911
{txt}{ralign 9:2016m10} {...}
{c |}{...}
 {res}      906
{txt}{ralign 9:2016m11} {...}
{c |}{...}
 {res}      895
{txt}{ralign 9:2016m12} {...}
{c |}{...}
 {res}      933
{txt}{ralign 9: 2017m1} {...}
{c |}{...}
 {res}      936
{txt}{ralign 9: 2017m2} {...}
{c |}{...}
 {res}      932
{txt}{ralign 9: 2017m3} {...}
{c |}{...}
 {res}      949
{txt}{ralign 9: 2017m4} {...}
{c |}{...}
 {res}      886
{txt}{ralign 9: 2017m5} {...}
{c |}{...}
 {res}      944
{txt}{ralign 9: 2017m6} {...}
{c |}{...}
 {res}      941
{txt}{ralign 9: 2017m7} {...}
{c |}{...}
 {res}      948
{txt}{ralign 9: 2017m8} {...}
{c |}{...}
 {res}      942
{txt}{ralign 9: 2017m9} {...}
{c |}{...}
 {res}      919
{txt}{ralign 9:2017m10} {...}
{c |}{...}
 {res}      956
{txt}{ralign 9:2017m11} {...}
{c |}{...}
 {res}      921
{txt}{ralign 9:2017m12} {...}
{c |}{...}
 {res}      870
{txt}{ralign 9: 2018m1} {...}
{c |}{...}
 {res}      906
{txt}{ralign 9: 2018m2} {...}
{c |}{...}
 {res}      908
{txt}{ralign 9: 2018m3} {...}
{c |}{...}
 {res}      896
{txt}{ralign 9: 2018m4} {...}
{c |}{...}
 {res}      875
{txt}{ralign 9: 2018m5} {...}
{c |}{...}
 {res}      878
{txt}{ralign 9: 2018m6} {...}
{c |}{...}
 {res}      873
{txt}{ralign 9: 2018m7} {...}
{c |}{...}
 {res}      910
{txt}{ralign 9: 2018m8} {...}
{c |}{...}
 {res}      897
{txt}{ralign 9: 2018m9} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9:2018m10} {...}
{c |}{...}
 {res}      931
{txt}{ralign 9:2018m11} {...}
{c |}{...}
 {res}      907
{txt}{ralign 9:2018m12} {...}
{c |}{...}
 {res}      855
{txt}{ralign 9: 2019m1} {...}
{c |}{...}
 {res}      937
{txt}{ralign 9: 2019m2} {...}
{c |}{...}
 {res}      917
{txt}{ralign 9: 2019m3} {...}
{c |}{...}
 {res}      925
{txt}{ralign 9: 2019m4} {...}
{c |}{...}
 {res}      912
{txt}{ralign 9: 2019m5} {...}
{c |}{...}
 {res}      895
{txt}{ralign 9: 2019m6} {...}
{c |}{...}
 {res}      896
{txt}{ralign 9: 2019m7} {...}
{c |}{...}
 {res}      908
{txt}{ralign 9: 2019m8} {...}
{c |}{...}
 {res}      894
{txt}{ralign 9: 2019m9} {...}
{c |}{...}
 {res}      904
{txt}{ralign 9:2019m10} {...}
{c |}{...}
 {res}      880
{txt}{ralign 9:2019m11} {...}
{c |}{...}
 {res}      867
{txt}{ralign 9:2019m12} {...}
{c |}{...}
 {res}      874
{txt}{ralign 9: 2020m1} {...}
{c |}{...}
 {res}      896
{txt}{ralign 9: 2020m2} {...}
{c |}{...}
 {res}      913
{txt}{ralign 9: 2020m3} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9: 2020m4} {...}
{c |}{...}
 {res}      895
{txt}{ralign 9: 2020m5} {...}
{c |}{...}
 {res}      872
{txt}{ralign 9: 2020m6} {...}
{c |}{...}
 {res}      802
{txt}{ralign 9: 2020m7} {...}
{c |}{...}
 {res}      807
{txt}{ralign 9: 2020m8} {...}
{c |}{...}
 {res}      797
{txt}{ralign 9: 2020m9} {...}
{c |}{...}
 {res}      783
{txt}{ralign 9:2020m10} {...}
{c |}{...}
 {res}      826
{txt}{ralign 9:2020m11} {...}
{c |}{...}
 {res}      843
{txt}{ralign 9:2020m12} {...}
{c |}{...}
 {res}      931
{txt}{ralign 9: 2021m1} {...}
{c |}{...}
 {res}      873
{txt}{ralign 9: 2021m2} {...}
{c |}{...}
 {res}      869
{txt}{ralign 9: 2021m3} {...}
{c |}{...}
 {res}      855
{txt}{ralign 9: 2021m4} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9: 2021m5} {...}
{c |}{...}
 {res}      872
{txt}{ralign 9: 2021m6} {...}
{c |}{...}
 {res}      930
{txt}{ralign 9: 2021m7} {...}
{c |}{...}
 {res}      881
{txt}{hline 10}{c +}{hline 10}
{ralign 9:Total} {...}
{c |}{...}
 {res}    88388
{txt}{hline 10}{c BT}{hline 10}

{com}. 
. *******************************
. **  Generate Variables       **
. *******************************
. 
. gen Incmean = .
{txt}(88388 missing values generated)

{com}. gen Incvar = .
{txt}(88388 missing values generated)

{com}. gen Inciqr = .
{txt}(88388 missing values generated)

{com}. 
. gen Incmean_ch = .
{txt}(88388 missing values generated)

{com}. gen Incvar_ch = .
{txt}(88388 missing values generated)

{com}. gen Inciqr_ch = .
{txt}(88388 missing values generated)

{com}. 
. 
. gen Inc_mom = .
{txt}(88388 missing values generated)

{com}. gen Inc_mom_ch = .
{txt}(88388 missing values generated)

{com}. 
. *** take the log
. 
. foreach mom in var{c -(}
{txt}  2{com}. gen linc`mom'= log(inc`mom') 
{txt}  3{com}. gen lrinc`mom' = log(rinc`mom') 
{txt}  4{com}. {c )-}
{txt}(23357 missing values generated)
(27125 missing values generated)

{com}. 
. 
. foreach mom in iqr{c -(}
{txt}  2{com}. gen linc`mom'= log(inc`mom') 
{txt}  3{com}. {c )-}
{txt}(16198 missing values generated)

{com}. 
. label var linciqr "log perceived iqr"
{txt}
{com}. label var lincvar "log perceived risk"
{txt}
{com}. label var lrincvar "log perceived risk (real)"
{txt}
{com}. label var spending "expected growth in spending"
{txt}
{com}. 
. *************************************
. *** Poisson rate in expectations 
. **************************************
. 
. 
. gen exp_s = log(1-UEprobInd4m)/(-3) 
{txt}(82115 missing values generated)

{com}. * can use exp_eu from micro data 
. label var exp_s "expected Poisson separation rate"
{txt}
{com}. 
. gen exp_f =log(1-EUprobInd)/(-4)
{txt}(28367 missing values generated)

{com}. * can use exp_ue from micro data 
. label var exp_f "expected Poisson job-finding rate"
{txt}
{com}. 
. gen exp_s_1y = log(1-UEprobInd)/(-12) 
{txt}(23210 missing values generated)

{com}. * can use exp_eu from micro data 
. label var exp_s_1y "expected Poisson separation rate (1 year)"
{txt}
{com}. 
. *************************************
. *** Variables for overreaction test 
. **************************************
. 
. ** earing expectation 
. 
. gen incexp_rv = incmean - l1.incmean
{txt}(40569 missing values generated)

{com}. label var incexp_rv "revision in nominal wage growth expectation"
{txt}
{com}. 
. gen rincexp_rv = rincmean - l1.rincmean
{txt}(46127 missing values generated)

{com}. label var rincexp_rv "revision in real wage growth expectation"
{txt}
{com}. 
. ** earning risk 
. 
. gen incvar_rv = incvar - l1.incvar 
{txt}(41578 missing values generated)

{com}. label var incvar_rv "revision in nominal earning risk"
{txt}
{com}. 
. gen rincvar_rv = rincvar - l1.rincvar
{txt}(45438 missing values generated)

{com}. label var rincvar "revision in earning risk"
{txt}
{com}. 
. gen rincvar_all_fe = rincvar-rincvar_all_rl
{txt}(45951 missing values generated)

{com}. label var rincvar_all_fe "forecast error in earning risk"
{txt}
{com}. gen rincvar_sub_fe = rincvar-rincvar_sub_rl
{txt}(53378 missing values generated)

{com}. label var rincvar_all_fe "forecast error in earning risk"
{txt}
{com}. 
. ** negative fe means underestimation 
. 
. foreach var in prisk2_all trisk2_all prisk2_sub trisk2_sub rincvar_all_now rincvar_sub_now{c -(}
{txt}  2{com}. gen `var'_ch = `var'-l1.`var'
{txt}  3{com}. {c )-}
{txt}(32209 missing values generated)
(32209 missing values generated)
(43751 missing values generated)
(43751 missing values generated)
(39204 missing values generated)
(47478 missing values generated)

{com}. 
. ** separation risk
. gen exp_s_1y_fe = exp_s_1y - f1.s
{txt}(37103 missing values generated)

{com}. label var exp_s_1y_fe "forecast error of separation rate"
{txt}
{com}. 
. gen exp_s_1y_rv = exp_s_1y - l1.exp_s_1y
{txt}(38769 missing values generated)

{com}. label var exp_s_1y_rv "revision in separation rate"
{txt}
{com}. 
. gen exp_s_fe = exp_s - f4.s
{txt}(84853 missing values generated)

{com}. label var exp_s_fe "forecast error of separation rate"
{txt}
{com}. 
. gen exp_s_rv = exp_s - l4.exp_s
{txt}(86036 missing values generated)

{com}. label var exp_s_rv "revision in separation rate"
{txt}
{com}. 
. gen exp_f_fe = exp_f - f1.f
{txt}(41050 missing values generated)

{com}. label var exp_s_fe "forecast error of separation rate"
{txt}
{com}. 
. gen exp_f_rv = exp_f - l1.exp_f
{txt}(44035 missing values generated)

{com}. label var exp_f_rv "revision in separation rate"
{txt}
{com}. 
. ***********************************************
. **** Job experiences/transitions/search *****
. ***********************************************
. 
. gen emp_status = .
{txt}(88388 missing values generated)

{com}. 
. replace emp_status = 1 if Q10_1==1|Q10_2==1|Q10_5==1
{txt}(73466 real changes made)

{com}. replace emp_status = 2 if Q10_3==1|Q10_4==1
{txt}(3978 real changes made)

{com}. replace emp_status = 3 if Q10_6==1|Q10_7==1|Q10_8==1|Q10_9==1
{txt}(14321 real changes made)

{com}. 
. label define emp_status_lb 1 "employed" 2 "unemployed" 3 "non-working"
{txt}
{com}. label value emp_status emp_status_lb
{txt}
{com}. 
. gen e2u = cond(emp_status==2 & (l1.emp_status==1|l2.emp_status==1|l3.emp_status==1|l4.emp_status==1),1,0)
{txt}
{com}. label var e2u "employed since m-4 and unemployed now"
{txt}
{com}. 
. gen u2e = cond(emp_status==1 &  (l1.emp_status==2|l2.emp_status==2|l3.emp_status==2|l4.emp_status==2),1,0)
{txt}
{com}. label var u2e "unemployed since m-4 and employed now"
{txt}
{com}. 
. 
. gen e2um8 = cond(emp_status==2 & ///
>                  (l1.emp_status==1|l2.emp_status==1|l3.emp_status==1|l4.emp_status==1| ///
>                                   l5.emp_status==1|l6.emp_status==1|l7.emp_status==1|l8.emp_status==1),1,0)
{txt}
{com}. label var e2um8 "employed since m-8 and unemployed now"
{txt}
{com}. 
. gen u2em8 = cond(emp_status==1 &  ///
>                (l1.emp_status==2|l2.emp_status==2|l3.emp_status==2|l4.emp_status==2| ///
>                            l5.emp_status==2|l6.emp_status==2|l7.emp_status==2|l5.emp_status==2),1,0)
{txt}
{com}. label var u2em8 "unemployed since m-8 and employed now"
{txt}
{com}. 
. 
. gen e2um12 = cond(emp_status==2 & ///
>                  (l1.emp_status==1|l2.emp_status==1|l3.emp_status==1|l4.emp_status==1| ///
>                                   l5.emp_status==1|l6.emp_status==1|l7.emp_status==1|l8.emp_status==1| ///
>                                   l9.emp_status==1|l10.emp_status==1|l11.emp_status==1|l12.emp_status==1),1,0)
{txt}
{com}. label var e2um12 "employed since y-1 and unemployed now"
{txt}
{com}. 
. gen u2em12 = cond(emp_status==1 &  ///
>                (l1.emp_status==2|l2.emp_status==2|l3.emp_status==2|l4.emp_status==2| ///
>                            l5.emp_status==2|l6.emp_status==2|l7.emp_status==2|l5.emp_status==2| ///
>                             l9.emp_status==2|l10.emp_status==2|l11.emp_status==2|l12.emp_status==2),1,0)
{txt}
{com}. label var u2em12 "unemployed since y-1 and employed now"
{txt}
{com}. 
. *************************
. *** Exclude outliers *****
. *************************
. 
. local vars incvar rincvar l3
{txt}
{com}. 
. foreach var in `vars'{c -(}
{txt}  2{com}.       egen `var'pl=pctile(`var'),p(1)
{txt}  3{com}.           egen `var'pu=pctile(`var'),p(99)
{txt}  4{com}.           replace `var' = . if `var' <`var'pl | (`var' >`var'pu & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(1965 real changes made, 1965 to missing)
(668 real changes made, 668 to missing)
(201 real changes made, 201 to missing)

{com}. 
. *************************
. ** macro variables normalization
. *****************************
. 
. replace he = he*l3.CPIAU/CPIAU
{txt}(74668 real changes made, 29486 to missing)

{com}. label var he "real hourly earning growth"
{txt}
{com}. 
. gen ue_chg = uerate - l3.uerate
{txt}(43206 missing values generated)

{com}. label var ue_chg "change in unemployment rate"
{txt}
{com}. 
. ************************
. ** group variables ****
. ************************
. ** age square
. gen age2 = age^2
{txt}
{com}. label var age2 "age squared"
{txt}
{com}. 
. 
. ***********************************
. ** new variables SCE realizations **
. **********************************
. 
. * log earning 
. gen wage_1y = l3*100/CPIAU
{txt}(78252 missing values generated)

{com}. label var wage_1y "average real annual earning from primary job"
{txt}
{com}. 
. ** average earning 
. egen wage_1y_av = mean(wage_1y), by(ID)
{txt}(38972 missing values generated)

{com}. label var wage_1y_av "average real annual earning across time"
{txt}
{com}. 
. ** income decile
. egen earning_gp = xtile(wage_1y_av), by(date) n(10) 
{txt}(38972 missing values generated)

{com}. label var earning_gp "decile of earning from low to high"
{txt}
{com}. 
. gen lwage_1y = log(wage_1y)
{txt}(78252 missing values generated)

{com}. label var lwage_1y "log average annual earning from primary job"
{txt}
{com}. 
. gen lwage_1y_gm4 = lwage_1y-l4.lwage_1y
{txt}(83475 missing values generated)

{com}. label var lwage_1y_gm4 "log annual earning growth from previous m-4 to m"
{txt}
{com}. 
. egen lwage_1y_gm4_sd = sd(lwage_1y_gm4), by(date)
{txt}(74776 missing values generated)

{com}. label var lwage_1y_gm4 "std log annual earning growth from previous m-4 to m"
{txt}
{com}. 
. ** generate cross-sectional std
. egen lwage_1y_sd = sd(lwage_1y), by(date)
{txt}(73838 missing values generated)

{com}. 
. ** mincer regressions 
. reghdfe lwage_1y age age2, a(i.gender i.edu_g) resid
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     8,751
{txt}Absorbing 2 HDFE groups{col 51}F({res}   2{txt},{res}   8745{txt}){col 67}= {res}     58.44
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.1281
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1276
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0132
{txt}{col 51}Root MSE{col 67}= {res}    0.9399

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lwage_1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}  .087877{col 26}{space 2} .0085779{col 37}{space 1}   10.24{col 46}{space 3}0.000{col 54}{space 4} .0710623{col 67}{space 3} .1046917
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.0009885{col 26}{space 2}  .000101{col 37}{space 1}   -9.78{col 46}{space 3}0.000{col 54}{space 4}-.0011865{col 67}{space 3}-.0007904
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.991126{col 26}{space 2} .1740459{col 37}{space 1}   45.91{col 46}{space 3}0.000{col 54}{space 4} 7.649955{col 67}{space 3} 8.332297
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}      gender{col 14}{c |}{space 1}        2{col 27}{space 1}        0{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{col 1}{text}       edu_g{col 14}{c |}{space 1}        3{col 27}{space 1}        1{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}

{com}. predict lwage_1y_shk, residuals
{txt}(79637 missing values generated)

{com}. 
. * including aggregate shock
. reghdfe lwage_1y age age2, a(i.date i.gender i.edu_g) resid
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 4 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     8,751
{txt}Absorbing 3 HDFE groups{col 51}F({res}   2{txt},{res}   8730{txt}){col 67}= {res}     58.40
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.1296
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1276
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0132
{txt}{col 51}Root MSE{col 67}= {res}    0.9399

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lwage_1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}  .087862{col 26}{space 2}  .008584{col 37}{space 1}   10.24{col 46}{space 3}0.000{col 54}{space 4} .0710354{col 67}{space 3} .1046886
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.0009881{col 26}{space 2} .0001011{col 37}{space 1}   -9.77{col 46}{space 3}0.000{col 54}{space 4}-.0011863{col 67}{space 3}-.0007899
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.991048{col 26}{space 2} .1741738{col 37}{space 1}   45.88{col 46}{space 3}0.000{col 54}{space 4} 7.649627{col 67}{space 3}  8.33247
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}        date{col 14}{c |}{space 1}       16{col 27}{space 1}        0{col 39}{result}{space 1}       16{col 53}{text} {col 54}{c |}
{col 1}{text}      gender{col 14}{c |}{space 1}        2{col 27}{space 1}        1{col 39}{result}{space 1}        1{col 53}{text} {col 54}{c |}
{col 1}{text}       edu_g{col 14}{c |}{space 1}        3{col 27}{space 1}        1{col 39}{result}{space 1}        2{col 53}{text}?{col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
? = number of redundant parameters may be higher

{com}. predict lwage_1y_id_shk, residuals
{txt}(79637 missing values generated)

{com}. 
. gen lwage_1y_ag_shk = lwage_1y_shk- lwage_1y_id_shk
{txt}(79637 missing values generated)

{com}. 
. label var lwage_1y_shk "log wage shock"
{txt}
{com}. label var lwage_1y_id_shk "log wage idiosyncratic shock"
{txt}
{com}. label var lwage_1y_ag_shk "log wage aggregate shock"
{txt}
{com}. 
. ** first difference
. foreach var in lwage_1y_shk lwage_1y_id_shk lwage_1y_ag_shk{c -(}
{txt}  2{com}. gen `var'_gr = `var'- l4.`var'
{txt}  3{com}. {c )-}
{txt}(84294 missing values generated)
(84294 missing values generated)
(84294 missing values generated)

{com}. 
. label var lwage_1y_shk_gr "log growth of unexplained wage"
{txt}
{com}. label var lwage_1y_id_shk_gr "log growth of idiosyncratic unexplained wage"
{txt}
{com}. label var lwage_1y_ag_shk_gr "log growth of aggregate unexplained wage"
{txt}
{com}. 
. 
. ** inequality  
. gen lwage_1y_shk2 = log(lwage_1y_shk^2)
{txt}(79637 missing values generated)

{com}. label var lwage_1y_shk2 "squared log residuals"
{txt}
{com}. 
. ** volatility 
. gen lwage_1y_shk_gr2 = log(lwage_1y_shk_gr^2)
{txt}(84294 missing values generated)

{com}. label var lwage_1y_shk_gr2 "squared log shocks"
{txt}
{com}. 
. egen lwage_1y_shk_gr_sd = sd(lwage_1y_shk_gr), by(date)
{txt}(74776 missing values generated)

{com}. label var lwage_1y_shk_gr_sd "standard deviation of log shocks"
{txt}
{com}. 
. gen lwage_1y_shk_gr_var = lwage_1y_shk_gr_sd^2
{txt}(74776 missing values generated)

{com}. label var lwage_1y_shk_gr_sd "var of log shocks"
{txt}
{com}. 
. 
. /*
> ***********************************************
> ** summary chart of unconditional wages ********
> ************************************************
> 
> preserve
> 
> collapse (mean) lwage_1y lwage_1y_sd, by(date year month) 
> ** average log wage whole sample
> twoway  (connected lwage_1y date) if lwage_1y!=., title("The mean of log real wages") 
> graph export "${c -(}graph_folder{c )-}/log_wage_av.png", as(png) replace 
> 
> ** std log wage whole sample
> twoway  (connected lwage_1y_sd date) if lwage_1y_sd!=., title("The standard deviation of log real wages") 
> graph export "${c -(}graph_folder{c )-}/log_wage_sd.png", as(png) replace 
> restore 
> 
> 
> ************************************************
> ** summary chart of conditional wages ********
> ************************************************
> 
> preserve
> 
> collapse (mean) lwage_1y_shk_gr lwage_1y_shk_gr_sd, by(year month date) 
> ** average log wage shock whole sample
> twoway  (connected lwage_1y_shk_gr date) if lwage_1y_shk_gr!=., title("The mean of log real wage shocks") 
> graph export "${c -(}graph_folder{c )-}/log_wage_shk_gr.png", as(png) replace 
> 
> ** std log wage whole sample
> twoway  (connected lwage_1y_shk_gr_sd date) if lwage_1y_shk_gr_sd!=., title("The standard deviation of log real wage shocks") 
> graph export "${c -(}graph_folder{c )-}/log_wage_shk_gr_sd.png", as(png) replace
> restore 
> */
. 
. ***************************************
. **** earning level and risk perceptions
. ***************************************
. 
. gen rincsd = sqrt(rincvar)
{txt}(27793 missing values generated)

{com}. gen rincsd_all_rl = sqrt(rincvar_all_rl)
{txt}(27222 missing values generated)

{com}. gen psd2_all_rl = sqrt(prisk2_all_rl)
{txt}(27222 missing values generated)

{com}. gen tsd2_all_rl = sqrt(trisk2_all_rl)
{txt}(27222 missing values generated)

{com}. 
. gen rincsd_sub_rl = sqrt(rincvar_sub_rl)
{txt}(38464 missing values generated)

{com}. gen psd2_sub_rl = sqrt(prisk2_sub_rl)
{txt}(38464 missing values generated)

{com}. gen tsd2_sub_rl = sqrt(trisk2_sub_rl)
{txt}(38464 missing values generated)

{com}. 
. 
. graph bar rincsd, ///
>            over(earning_gp,relabel(1 "10%" 2 "20%" 3 "30%" 4 "40%" 5 "50%" 6 "60%" 7 "70%" 8 "80%" 9 "90%" 10 "100%")) ///
>                    bar(1, color(navy)) ///
>                    title("Perceived risk by real earning") ///
>                    b1title("earning decile") ///
>                    ytitle("Average perceived risk (std)") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_earning.png", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/PIR/WorkingFolder/Graphs/ind/boxplot_rvar_earning.png written in PNG format)

{com}. 
. 
. graph bar rincsd lwage_shk_gr_sd_age_sex rincsd_sub_rl psd2_sub_rl if educ!=1 & age_5yr>25, ///
>            over(age_5yr) over(gender,relabel(1 "Male" 2 "Female")) ///
>                    bar(1, color(navy)) ///
>                    bar(2, color(gray)) ///
>                    bar(3, color(cranberry)) ///
>                    bar(4, color(orange)) ///
>                    title("Perceived and realized risk by age",size(med)) ///
>                    ytitle("Average perceived risk (std)")  ///
>                    legend(row(2) label(1 "perceived risk") label(2 "volatility") label(3 "realized risk") label(4 "permanent risk"))
{res}{p 0 4 2}
{txt}(note:  named style
med not found in class
gsize,  default attributes used)
{p_end}
{res}{txt}
{com}. 
. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_compare_age.png", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/PIR/WorkingFolder/Graphs/ind/boxplot_rvar_compare_age.png written in PNG format)

{com}. 
. 
. graph bar rincsd lwage_shk_gr_sd_age_sex rincsd_sub_rl psd2_sub_rl, ///
>            over(educ,relabel(1 "HS dropout" 2 "HS" 3 "College")) over(gender,relabel(1 "Male" 2 "Female")) ///
>                    bar(1, color(navy)) ///
>                    bar(2, color(gray)) ///
>                    bar(3, color(cranberry)) ///
>                    bar(4, color(orange)) ///
>                    title("Perceived and realized risk by education",size(med)) ///
>                    ytitle("Average perceived risk (std)")  ///
>                    legend(row(2) label(1 "perceived risk") label(2 "volatility")  label(3 "realized risk") label(4 "permanent risk"))
{res}{p 0 4 2}
{txt}(note:  named style
med not found in class
gsize,  default attributes used)
{p_end}
{res}{txt}
{com}. 
. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_compare_educ.png", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/PIR/WorkingFolder/Graphs/ind/boxplot_rvar_compare_educ.png written in PNG format)

{com}. 
. 
. ********************************************************
. ** Compare risks between perception and realization **
. ********************************************************
. 
. tabout gender edu_g age_5 using "${c -(}sum_table_folder{c )-}/risks_compare.csv", ///
>             c(mean rincsd median rincsd mean lwage_shk_gr_sd_age_sex mean rincsd_sub_rl mean psd2_sub_rl mean tsd2_sub_rl ) ///
>                         f(3c 3c 3c 3c 3c 4c 4c) ///
>                         clab(PR(mean) PR(median) Volatility(median) RealizedRisk PRisk TRisk) ///
>                         sum npos(tufte) rep style(csv) bt cl2(2-4 5-6) cltr2(.75em 1.5em) 
{res}
{txt}Table output written to: /Users/Myworld/Dropbox/PIR/WorkingFolder/Tables/risks_compare.csv

{res},Mean,Median,Mean,Mean,Mean,Mean
,PR(mean),PR(median),Volatility(median),RealizedRisk,PRisk,TRisk
gender,,,,,,
1 (50%),0.030,0.022,0.106,0.115,0.109,0.0238
2 (49%),0.029,0.022,0.119,0.131,0.122,0.0322
Total (100%),0.029,0.022,0.112,0.123,0.115,0.0279

education group,,,,,,
HS dropout (0%),0.038,0.023,0.087,0.071,0.070,0.0063
HS graduate (41%),0.031,0.023,0.096,0.098,0.094,0.0176
College/above (57%),0.028,0.022,0.124,0.142,0.132,0.0357
Total (100%),0.029,0.022,0.112,0.123,0.115,0.0279

5-year age,,,,,,
20 (2%),0.037,0.031,0.093,0.069,0.068,0.0061
25 (12%),0.032,0.027,0.111,0.157,0.156,0.0083
30 (13%),0.030,0.024,0.116,0.112,0.098,0.0372
35 (13%),0.030,0.022,0.125,0.149,0.134,0.0524
40 (13%),0.029,0.021,0.100,0.119,0.111,0.0287
45 (14%),0.028,0.021,0.119,0.113,0.106,0.0224
50 (15%),0.028,0.020,0.095,0.100,0.096,0.0203
55 (15%),0.028,0.019,0.122,0.128,0.121,0.0283
Total (100%),0.029,0.022,0.112,0.123,0.115,0.0279
{txt}
{com}. 
. ***************************************
. **** unemployment experience and risk perceptions
. ***************************************
. 
. 
. graph bar rincsd, over(u2e,relabel(1 "other" 2 "recently unemployed")) ///
>          title("Perceived risk by unemployment experience") ///
>                  ytitle("Average perceived risk (std)") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_ue_peperience.png", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/PIR/WorkingFolder/Graphs/ind/boxplot_rvar_ue_peperience.png written in PNG format)

{com}. 
. 
. graph bar rincsd, over(u2em12,relabel(1 "other" 2 "unemployed within past year")) ///
>          title("Perceived risk by unemployment experience") ///
>                  ytitle("Average perceived risk (std)") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_ue_peperience_m12.png", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/PIR/WorkingFolder/Graphs/ind/boxplot_rvar_ue_peperience_m12.png written in PNG format)

{com}. 
. 
. 
. ************************************************
. ** exploring seasonal patterns ********
. ************************************************
. 
. 
. graph bar incexp_rv, ///
>            over(month) ///
>                    bar(1, color(navy)) ///
>                    title("Revision in Expected Nominal Wage Growth") ///
>                    b1title("month") ///
>                    ytitle("Average revision in expected wage growth") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_exp_revision_month_of_year.png", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/PIR/WorkingFolder/Graphs/ind/boxplot_exp_revision_month_of_year.png written in PNG format)

{com}. 
. 
. graph bar rincexp_rv, ///
>            over(month) ///
>                    bar(1, color(navy)) ///
>                    title("Revision in Expected Real Wage Growth") ///
>                    b1title("month") ///
>                    ytitle("Average revision in expected wage growth") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rexp_revision_month_of_year.png", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/PIR/WorkingFolder/Graphs/ind/boxplot_rexp_revision_month_of_year.png written in PNG format)

{com}. 
. 
. graph bar incvar_rv, ///
>            over(month) ///
>                    bar(1, color(navy)) ///
>                    title("Revision in Expected Nominal Wage Risks") ///
>                    b1title("month") ///
>                    ytitle("Average perceived risk") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_var_revision_month_of_year.png", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/PIR/WorkingFolder/Graphs/ind/boxplot_var_revision_month_of_year.png written in PNG format)

{com}. 
. 
. graph bar rincvar_rv, ///
>            over(month) ///
>                    bar(1, color(navy)) ///
>                    title("Revision in Expected Wage Risks") ///
>                    b1title("month") ///
>                    ytitle("Average perceived risk") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_revision_month_of_year.png", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/PIR/WorkingFolder/Graphs/ind/boxplot_rvar_revision_month_of_year.png written in PNG format)

{com}. 
. 
. graph bar rincsd, ///
>            over(month) ///
>                    bar(1, color(navy)) ///
>                    title("Perceived risk by month of the year") ///
>                    b1title("month") ///
>                    ytitle("Average perceived risk (std)") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_month_of_year.png", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/PIR/WorkingFolder/Graphs/ind/boxplot_rvar_month_of_year.png written in PNG format)

{com}. 
. dddd
{err}unrecognized command:  dddd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. do "/var/folders/k3/fzq0vzzx2b56ypvhsddgs7hr0000gn/T//SD00732.000000"
{txt}
{com}. 
. ** regressions
. 
. eststo clear
{txt}
{com}. 
. eststo: reghdfe incexp i.month i.date, a(ID)
{res}{txt}(dropped 1138 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}{txt}note: 727.date omitted because of collinearity
{txt}note: 728.date omitted because of collinearity
{txt}note: 729.date omitted because of collinearity
{txt}note: 730.date omitted because of collinearity
{txt}note: 731.date omitted because of collinearity
{txt}note: 732.date omitted because of collinearity
{txt}note: 733.date omitted because of collinearity
{txt}note: 734.date omitted because of collinearity
{txt}note: 735.date omitted because of collinearity
{txt}note: 736.date omitted because of collinearity
{txt}note: 737.date omitted because of collinearity
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    46,681
{txt}Absorbing 1 HDFE group{col 51}F({res}  96{txt},{res}  39679{txt}){col 67}= {res}      1.24
{txt}{col 51}Prob > F{col 67}= {res}    0.0532
{txt}{col 51}R-squared{col 67}= {res}    0.0728
{txt}{col 51}Adj R-squared{col 67}= {res}   -0.0908
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0030
{txt}{col 51}Root MSE{col 67}= {res}    0.0193

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   incexp_rv{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0008975{col 26}{space 2} .0012885{col 37}{space 1}   -0.70{col 46}{space 3}0.486{col 54}{space 4}-.0034231{col 67}{space 3} .0016281
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0001736{col 26}{space 2} .0013418{col 37}{space 1}   -0.13{col 46}{space 3}0.897{col 54}{space 4}-.0028035{col 67}{space 3} .0024563
{txt}{space 10}4  {c |}{col 14}{res}{space 2}   .00074{col 26}{space 2} .0013453{col 37}{space 1}    0.55{col 46}{space 3}0.582{col 54}{space 4}-.0018967{col 67}{space 3} .0033768
{txt}{space 10}5  {c |}{col 14}{res}{space 2}  .001324{col 26}{space 2} .0013614{col 37}{space 1}    0.97{col 46}{space 3}0.331{col 54}{space 4}-.0013444{col 67}{space 3} .0039923
{txt}{space 10}6  {c |}{col 14}{res}{space 2} .0006514{col 26}{space 2} .0013921{col 37}{space 1}    0.47{col 46}{space 3}0.640{col 54}{space 4}-.0020772{col 67}{space 3} .0033799
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.0086267{col 26}{space 2} .0031906{col 37}{space 1}   -2.70{col 46}{space 3}0.007{col 54}{space 4}-.0148803{col 67}{space 3}-.0023731
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .0011843{col 26}{space 2} .0014329{col 37}{space 1}    0.83{col 46}{space 3}0.409{col 54}{space 4}-.0016241{col 67}{space 3} .0039927
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.0010704{col 26}{space 2} .0013945{col 37}{space 1}   -0.77{col 46}{space 3}0.443{col 54}{space 4}-.0038036{col 67}{space 3} .0016627
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .0007505{col 26}{space 2} .0013544{col 37}{space 1}    0.55{col 46}{space 3}0.579{col 54}{space 4}-.0019041{col 67}{space 3} .0034051
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .0006905{col 26}{space 2} .0013034{col 37}{space 1}    0.53{col 46}{space 3}0.596{col 54}{space 4}-.0018641{col 67}{space 3} .0032451
{txt}{space 9}12  {c |}{col 14}{res}{space 2} .0003068{col 26}{space 2} .0012708{col 37}{space 1}    0.24{col 46}{space 3}0.809{col 54}{space 4} -.002184{col 67}{space 3} .0027975
{txt}{space 12} {c |}
{space 8}date {c |}
{space 8}643  {c |}{col 14}{res}{space 2}-.0083375{col 26}{space 2} .0031169{col 37}{space 1}   -2.67{col 46}{space 3}0.007{col 54}{space 4}-.0144466{col 67}{space 3}-.0022283
{txt}{space 8}644  {c |}{col 14}{res}{space 2}-.0075229{col 26}{space 2} .0030445{col 37}{space 1}   -2.47{col 46}{space 3}0.013{col 54}{space 4}-.0134903{col 67}{space 3}-.0015556
{txt}{space 8}645  {c |}{col 14}{res}{space 2}-.0078964{col 26}{space 2} .0030275{col 37}{space 1}   -2.61{col 46}{space 3}0.009{col 54}{space 4}-.0138303{col 67}{space 3}-.0019624
{txt}{space 8}646  {c |}{col 14}{res}{space 2}-.0082369{col 26}{space 2} .0030162{col 37}{space 1}   -2.73{col 46}{space 3}0.006{col 54}{space 4}-.0141487{col 67}{space 3}-.0023251
{txt}{space 8}647  {c |}{col 14}{res}{space 2}-.0069775{col 26}{space 2} .0030219{col 37}{space 1}   -2.31{col 46}{space 3}0.021{col 54}{space 4}-.0129004{col 67}{space 3}-.0010545
{txt}{space 8}648  {c |}{col 14}{res}{space 2}-.0058439{col 26}{space 2}  .003011{col 37}{space 1}   -1.94{col 46}{space 3}0.052{col 54}{space 4}-.0117454{col 67}{space 3} .0000577
{txt}{space 8}649  {c |}{col 14}{res}{space 2}-.0089114{col 26}{space 2} .0030004{col 37}{space 1}   -2.97{col 46}{space 3}0.003{col 54}{space 4}-.0147922{col 67}{space 3}-.0030306
{txt}{space 8}650  {c |}{col 14}{res}{space 2}-.0051425{col 26}{space 2} .0030181{col 37}{space 1}   -1.70{col 46}{space 3}0.088{col 54}{space 4}-.0110579{col 67}{space 3}  .000773
{txt}{space 8}651  {c |}{col 14}{res}{space 2}-.0091142{col 26}{space 2} .0030168{col 37}{space 1}   -3.02{col 46}{space 3}0.003{col 54}{space 4}-.0150272{col 67}{space 3}-.0032012
{txt}{space 8}652  {c |}{col 14}{res}{space 2}-.0080439{col 26}{space 2} .0030078{col 37}{space 1}   -2.67{col 46}{space 3}0.007{col 54}{space 4}-.0139393{col 67}{space 3}-.0021485
{txt}{space 8}653  {c |}{col 14}{res}{space 2}-.0091909{col 26}{space 2} .0030127{col 37}{space 1}   -3.05{col 46}{space 3}0.002{col 54}{space 4}-.0150958{col 67}{space 3}-.0032859
{txt}{space 8}654  {c |}{col 14}{res}{space 2} .0031952{col 26}{space 2} .0017556{col 37}{space 1}    1.82{col 46}{space 3}0.069{col 54}{space 4}-.0002458{col 67}{space 3} .0066362
{txt}{space 8}655  {c |}{col 14}{res}{space 2}-.0082968{col 26}{space 2} .0028402{col 37}{space 1}   -2.92{col 46}{space 3}0.003{col 54}{space 4}-.0138637{col 67}{space 3}-.0027299
{txt}{space 8}656  {c |}{col 14}{res}{space 2}-.0060767{col 26}{space 2} .0028481{col 37}{space 1}   -2.13{col 46}{space 3}0.033{col 54}{space 4}-.0116591{col 67}{space 3}-.0004944
{txt}{space 8}657  {c |}{col 14}{res}{space 2}-.0078586{col 26}{space 2} .0028332{col 37}{space 1}   -2.77{col 46}{space 3}0.006{col 54}{space 4}-.0134118{col 67}{space 3}-.0023054
{txt}{space 8}658  {c |}{col 14}{res}{space 2}-.0078811{col 26}{space 2} .0028219{col 37}{space 1}   -2.79{col 46}{space 3}0.005{col 54}{space 4}-.0134121{col 67}{space 3}-.0023501
{txt}{space 8}659  {c |}{col 14}{res}{space 2}-.0068121{col 26}{space 2} .0028205{col 37}{space 1}   -2.42{col 46}{space 3}0.016{col 54}{space 4}-.0123405{col 67}{space 3}-.0012838
{txt}{space 8}660  {c |}{col 14}{res}{space 2}-.0083541{col 26}{space 2} .0028201{col 37}{space 1}   -2.96{col 46}{space 3}0.003{col 54}{space 4}-.0138815{col 67}{space 3}-.0028267
{txt}{space 8}661  {c |}{col 14}{res}{space 2}-.0075655{col 26}{space 2} .0028117{col 37}{space 1}   -2.69{col 46}{space 3}0.007{col 54}{space 4}-.0130765{col 67}{space 3}-.0020545
{txt}{space 8}662  {c |}{col 14}{res}{space 2}-.0064135{col 26}{space 2} .0028325{col 37}{space 1}   -2.26{col 46}{space 3}0.024{col 54}{space 4}-.0119653{col 67}{space 3}-.0008618
{txt}{space 8}663  {c |}{col 14}{res}{space 2}-.0056382{col 26}{space 2}  .002827{col 37}{space 1}   -1.99{col 46}{space 3}0.046{col 54}{space 4}-.0111791{col 67}{space 3}-.0000973
{txt}{space 8}664  {c |}{col 14}{res}{space 2}-.0078958{col 26}{space 2} .0028165{col 37}{space 1}   -2.80{col 46}{space 3}0.005{col 54}{space 4}-.0134162{col 67}{space 3}-.0023754
{txt}{space 8}665  {c |}{col 14}{res}{space 2}-.0083739{col 26}{space 2} .0028153{col 37}{space 1}   -2.97{col 46}{space 3}0.003{col 54}{space 4} -.013892{col 67}{space 3}-.0028558
{txt}{space 8}666  {c |}{col 14}{res}{space 2} .0023316{col 26}{space 2} .0020599{col 37}{space 1}    1.13{col 46}{space 3}0.258{col 54}{space 4} -.001706{col 67}{space 3} .0063691
{txt}{space 8}667  {c |}{col 14}{res}{space 2} -.008096{col 26}{space 2} .0026484{col 37}{space 1}   -3.06{col 46}{space 3}0.002{col 54}{space 4}-.0132869{col 67}{space 3} -.002905
{txt}{space 8}668  {c |}{col 14}{res}{space 2}-.0059955{col 26}{space 2} .0026387{col 37}{space 1}   -2.27{col 46}{space 3}0.023{col 54}{space 4}-.0111675{col 67}{space 3}-.0008236
{txt}{space 8}669  {c |}{col 14}{res}{space 2}-.0052574{col 26}{space 2} .0026295{col 37}{space 1}   -2.00{col 46}{space 3}0.046{col 54}{space 4}-.0104113{col 67}{space 3}-.0001036
{txt}{space 8}670  {c |}{col 14}{res}{space 2}-.0067174{col 26}{space 2} .0026073{col 37}{space 1}   -2.58{col 46}{space 3}0.010{col 54}{space 4}-.0118277{col 67}{space 3}-.0016071
{txt}{space 8}671  {c |}{col 14}{res}{space 2} -.007921{col 26}{space 2} .0026006{col 37}{space 1}   -3.05{col 46}{space 3}0.002{col 54}{space 4}-.0130183{col 67}{space 3}-.0028237
{txt}{space 8}672  {c |}{col 14}{res}{space 2}-.0055656{col 26}{space 2} .0026013{col 37}{space 1}   -2.14{col 46}{space 3}0.032{col 54}{space 4}-.0106643{col 67}{space 3} -.000467
{txt}{space 8}673  {c |}{col 14}{res}{space 2}-.0052243{col 26}{space 2} .0026064{col 37}{space 1}   -2.00{col 46}{space 3}0.045{col 54}{space 4}-.0103328{col 67}{space 3}-.0001158
{txt}{space 8}674  {c |}{col 14}{res}{space 2}-.0050073{col 26}{space 2} .0026223{col 37}{space 1}   -1.91{col 46}{space 3}0.056{col 54}{space 4} -.010147{col 67}{space 3} .0001325
{txt}{space 8}675  {c |}{col 14}{res}{space 2}-.0067199{col 26}{space 2} .0026114{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4}-.0118384{col 67}{space 3}-.0016014
{txt}{space 8}676  {c |}{col 14}{res}{space 2}-.0077716{col 26}{space 2} .0026145{col 37}{space 1}   -2.97{col 46}{space 3}0.003{col 54}{space 4}-.0128961{col 67}{space 3}-.0026471
{txt}{space 8}677  {c |}{col 14}{res}{space 2}-.0057392{col 26}{space 2} .0026115{col 37}{space 1}   -2.20{col 46}{space 3}0.028{col 54}{space 4}-.0108577{col 67}{space 3}-.0006206
{txt}{space 8}678  {c |}{col 14}{res}{space 2} .0023471{col 26}{space 2} .0022894{col 37}{space 1}    1.03{col 46}{space 3}0.305{col 54}{space 4}-.0021401{col 67}{space 3} .0068344
{txt}{space 8}679  {c |}{col 14}{res}{space 2}-.0087333{col 26}{space 2} .0024201{col 37}{space 1}   -3.61{col 46}{space 3}0.000{col 54}{space 4}-.0134768{col 67}{space 3}-.0039898
{txt}{space 8}680  {c |}{col 14}{res}{space 2}-.0065791{col 26}{space 2} .0024148{col 37}{space 1}   -2.72{col 46}{space 3}0.006{col 54}{space 4}-.0113121{col 67}{space 3} -.001846
{txt}{space 8}681  {c |}{col 14}{res}{space 2}-.0066534{col 26}{space 2} .0024018{col 37}{space 1}   -2.77{col 46}{space 3}0.006{col 54}{space 4} -.011361{col 67}{space 3}-.0019458
{txt}{space 8}682  {c |}{col 14}{res}{space 2}-.0069415{col 26}{space 2} .0023928{col 37}{space 1}   -2.90{col 46}{space 3}0.004{col 54}{space 4}-.0116315{col 67}{space 3}-.0022515
{txt}{space 8}683  {c |}{col 14}{res}{space 2}-.0050182{col 26}{space 2} .0023812{col 37}{space 1}   -2.11{col 46}{space 3}0.035{col 54}{space 4}-.0096854{col 67}{space 3} -.000351
{txt}{space 8}684  {c |}{col 14}{res}{space 2}-.0065283{col 26}{space 2} .0023888{col 37}{space 1}   -2.73{col 46}{space 3}0.006{col 54}{space 4}-.0112104{col 67}{space 3}-.0018461
{txt}{space 8}685  {c |}{col 14}{res}{space 2} -.004968{col 26}{space 2} .0023909{col 37}{space 1}   -2.08{col 46}{space 3}0.038{col 54}{space 4}-.0096542{col 67}{space 3}-.0002819
{txt}{space 8}686  {c |}{col 14}{res}{space 2}-.0058662{col 26}{space 2} .0024148{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-.0105994{col 67}{space 3}-.0011331
{txt}{space 8}687  {c |}{col 14}{res}{space 2}-.0056647{col 26}{space 2} .0024044{col 37}{space 1}   -2.36{col 46}{space 3}0.018{col 54}{space 4}-.0103775{col 67}{space 3} -.000952
{txt}{space 8}688  {c |}{col 14}{res}{space 2}-.0070856{col 26}{space 2} .0024032{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-.0117959{col 67}{space 3}-.0023752
{txt}{space 8}689  {c |}{col 14}{res}{space 2}-.0044256{col 26}{space 2} .0023999{col 37}{space 1}   -1.84{col 46}{space 3}0.065{col 54}{space 4}-.0091295{col 67}{space 3} .0002783
{txt}{space 8}690  {c |}{col 14}{res}{space 2} .0033442{col 26}{space 2} .0025097{col 37}{space 1}    1.33{col 46}{space 3}0.183{col 54}{space 4}-.0015748{col 67}{space 3} .0082632
{txt}{space 8}691  {c |}{col 14}{res}{space 2}-.0059022{col 26}{space 2} .0021761{col 37}{space 1}   -2.71{col 46}{space 3}0.007{col 54}{space 4}-.0101674{col 67}{space 3}-.0016369
{txt}{space 8}692  {c |}{col 14}{res}{space 2}-.0031282{col 26}{space 2} .0021926{col 37}{space 1}   -1.43{col 46}{space 3}0.154{col 54}{space 4}-.0074256{col 67}{space 3} .0011693
{txt}{space 8}693  {c |}{col 14}{res}{space 2}-.0043361{col 26}{space 2} .0021767{col 37}{space 1}   -1.99{col 46}{space 3}0.046{col 54}{space 4}-.0086025{col 67}{space 3}-.0000697
{txt}{space 8}694  {c |}{col 14}{res}{space 2}-.0036383{col 26}{space 2} .0021548{col 37}{space 1}   -1.69{col 46}{space 3}0.091{col 54}{space 4}-.0078618{col 67}{space 3} .0005853
{txt}{space 8}695  {c |}{col 14}{res}{space 2}-.0014645{col 26}{space 2} .0021508{col 37}{space 1}   -0.68{col 46}{space 3}0.496{col 54}{space 4}-.0056801{col 67}{space 3} .0027511
{txt}{space 8}696  {c |}{col 14}{res}{space 2}-.0037495{col 26}{space 2} .0021741{col 37}{space 1}   -1.72{col 46}{space 3}0.085{col 54}{space 4}-.0080108{col 67}{space 3} .0005117
{txt}{space 8}697  {c |}{col 14}{res}{space 2}-.0016926{col 26}{space 2} .0021823{col 37}{space 1}   -0.78{col 46}{space 3}0.438{col 54}{space 4}-.0059699{col 67}{space 3} .0025848
{txt}{space 8}698  {c |}{col 14}{res}{space 2}-.0032852{col 26}{space 2} .0021899{col 37}{space 1}   -1.50{col 46}{space 3}0.134{col 54}{space 4}-.0075773{col 67}{space 3}  .001007
{txt}{space 8}699  {c |}{col 14}{res}{space 2}-.0030467{col 26}{space 2} .0021828{col 37}{space 1}   -1.40{col 46}{space 3}0.163{col 54}{space 4} -.007325{col 67}{space 3} .0012315
{txt}{space 8}700  {c |}{col 14}{res}{space 2}-.0043486{col 26}{space 2} .0021697{col 37}{space 1}   -2.00{col 46}{space 3}0.045{col 54}{space 4}-.0086012{col 67}{space 3}-.0000959
{txt}{space 8}701  {c |}{col 14}{res}{space 2}-.0023862{col 26}{space 2} .0021768{col 37}{space 1}   -1.10{col 46}{space 3}0.273{col 54}{space 4}-.0066528{col 67}{space 3} .0018805
{txt}{space 8}702  {c |}{col 14}{res}{space 2} .0053128{col 26}{space 2} .0027356{col 37}{space 1}    1.94{col 46}{space 3}0.052{col 54}{space 4} -.000049{col 67}{space 3} .0106746
{txt}{space 8}703  {c |}{col 14}{res}{space 2}-.0027623{col 26}{space 2} .0019199{col 37}{space 1}   -1.44{col 46}{space 3}0.150{col 54}{space 4}-.0065254{col 67}{space 3} .0010008
{txt}{space 8}704  {c |}{col 14}{res}{space 2} -.001545{col 26}{space 2} .0019243{col 37}{space 1}   -0.80{col 46}{space 3}0.422{col 54}{space 4}-.0053167{col 67}{space 3} .0022268
{txt}{space 8}705  {c |}{col 14}{res}{space 2}-.0032441{col 26}{space 2} .0019084{col 37}{space 1}   -1.70{col 46}{space 3}0.089{col 54}{space 4}-.0069846{col 67}{space 3} .0004964
{txt}{space 8}706  {c |}{col 14}{res}{space 2}-.0026924{col 26}{space 2} .0018822{col 37}{space 1}   -1.43{col 46}{space 3}0.153{col 54}{space 4}-.0063815{col 67}{space 3} .0009967
{txt}{space 8}707  {c |}{col 14}{res}{space 2}-.0017353{col 26}{space 2} .0018874{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4}-.0054347{col 67}{space 3}  .001964
{txt}{space 8}708  {c |}{col 14}{res}{space 2}-.0014883{col 26}{space 2} .0018862{col 37}{space 1}   -0.79{col 46}{space 3}0.430{col 54}{space 4}-.0051852{col 67}{space 3} .0022086
{txt}{space 8}709  {c |}{col 14}{res}{space 2}-.0013081{col 26}{space 2} .0018838{col 37}{space 1}   -0.69{col 46}{space 3}0.487{col 54}{space 4}-.0050004{col 67}{space 3} .0023842
{txt}{space 8}710  {c |}{col 14}{res}{space 2}-.0012189{col 26}{space 2} .0019179{col 37}{space 1}   -0.64{col 46}{space 3}0.525{col 54}{space 4} -.004978{col 67}{space 3} .0025403
{txt}{space 8}711  {c |}{col 14}{res}{space 2}-.0022995{col 26}{space 2} .0019062{col 37}{space 1}   -1.21{col 46}{space 3}0.228{col 54}{space 4}-.0060357{col 67}{space 3} .0014367
{txt}{space 8}712  {c |}{col 14}{res}{space 2}-.0028889{col 26}{space 2} .0019056{col 37}{space 1}   -1.52{col 46}{space 3}0.130{col 54}{space 4}-.0066239{col 67}{space 3} .0008462
{txt}{space 8}713  {c |}{col 14}{res}{space 2}-.0014777{col 26}{space 2} .0019137{col 37}{space 1}   -0.77{col 46}{space 3}0.440{col 54}{space 4}-.0052286{col 67}{space 3} .0022732
{txt}{space 8}714  {c |}{col 14}{res}{space 2} .0066875{col 26}{space 2} .0029048{col 37}{space 1}    2.30{col 46}{space 3}0.021{col 54}{space 4}  .000994{col 67}{space 3} .0123811
{txt}{space 8}715  {c |}{col 14}{res}{space 2}-.0030852{col 26}{space 2} .0016222{col 37}{space 1}   -1.90{col 46}{space 3}0.057{col 54}{space 4}-.0062648{col 67}{space 3} .0000944
{txt}{space 8}716  {c |}{col 14}{res}{space 2} .0010041{col 26}{space 2} .0016322{col 37}{space 1}    0.62{col 46}{space 3}0.538{col 54}{space 4}-.0021949{col 67}{space 3} .0042032
{txt}{space 8}717  {c |}{col 14}{res}{space 2}-.0030233{col 26}{space 2} .0016212{col 37}{space 1}   -1.86{col 46}{space 3}0.062{col 54}{space 4}-.0062009{col 67}{space 3} .0001542
{txt}{space 8}718  {c |}{col 14}{res}{space 2} -.000983{col 26}{space 2} .0016031{col 37}{space 1}   -0.61{col 46}{space 3}0.540{col 54}{space 4}-.0041251{col 67}{space 3}  .002159
{txt}{space 8}719  {c |}{col 14}{res}{space 2}  .000578{col 26}{space 2}  .001584{col 37}{space 1}    0.36{col 46}{space 3}0.715{col 54}{space 4}-.0025266{col 67}{space 3} .0036827
{txt}{space 8}720  {c |}{col 14}{res}{space 2}-.0001783{col 26}{space 2} .0015895{col 37}{space 1}   -0.11{col 46}{space 3}0.911{col 54}{space 4}-.0032938{col 67}{space 3} .0029372
{txt}{space 8}721  {c |}{col 14}{res}{space 2} .0004181{col 26}{space 2} .0015816{col 37}{space 1}    0.26{col 46}{space 3}0.792{col 54}{space 4}-.0026818{col 67}{space 3}  .003518
{txt}{space 8}722  {c |}{col 14}{res}{space 2}-.0029428{col 26}{space 2} .0016308{col 37}{space 1}   -1.80{col 46}{space 3}0.071{col 54}{space 4}-.0061392{col 67}{space 3} .0002536
{txt}{space 8}723  {c |}{col 14}{res}{space 2}-.0040395{col 26}{space 2} .0016299{col 37}{space 1}   -2.48{col 46}{space 3}0.013{col 54}{space 4}-.0072343{col 67}{space 3}-.0008448
{txt}{space 8}724  {c |}{col 14}{res}{space 2}-.0034691{col 26}{space 2} .0016408{col 37}{space 1}   -2.11{col 46}{space 3}0.034{col 54}{space 4} -.006685{col 67}{space 3}-.0002531
{txt}{space 8}725  {c |}{col 14}{res}{space 2}-.0012046{col 26}{space 2} .0016601{col 37}{space 1}   -0.73{col 46}{space 3}0.468{col 54}{space 4}-.0044585{col 67}{space 3} .0020493
{txt}{space 8}726  {c |}{col 14}{res}{space 2} .0083695{col 26}{space 2} .0031296{col 37}{space 1}    2.67{col 46}{space 3}0.007{col 54}{space 4} .0022354{col 67}{space 3} .0145037
{txt}{space 8}727  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}728  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}729  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}730  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}731  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}732  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}733  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}734  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}735  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}736  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}737  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}738  {c |}{col 14}{res}{space 2} .0077402{col 26}{space 2} .0032899{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4}  .001292{col 67}{space 3} .0141884
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0037027{col 26}{space 2} .0017685{col 37}{space 1}    2.09{col 46}{space 3}0.036{col 54}{space 4} .0002363{col 67}{space 3} .0071691
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     6906{col 27}{space 1}        0{col 39}{result}{space 1}     6906{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est1{txt} stored)

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. estadd local hastid "Yes",replace

{txt}added macro:
             e(hastid) : "{res:Yes}"

{com}. 
. eststo: reghdfe rincexp i.month i.date, a(ID)
{res}{txt}(dropped 1187 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}{txt}note: 727.date omitted because of collinearity
{txt}note: 728.date omitted because of collinearity
{txt}note: 729.date omitted because of collinearity
{txt}note: 730.date omitted because of collinearity
{txt}note: 731.date omitted because of collinearity
{txt}note: 732.date omitted because of collinearity
{txt}note: 733.date omitted because of collinearity
{txt}note: 734.date omitted because of collinearity
{txt}note: 735.date omitted because of collinearity
{txt}note: 736.date omitted because of collinearity
{txt}note: 737.date omitted because of collinearity
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    41,074
{txt}Absorbing 1 HDFE group{col 51}F({res}  96{txt},{res}  34605{txt}){col 67}= {res}      1.52
{txt}{col 51}Prob > F{col 67}= {res}    0.0007
{txt}{col 51}R-squared{col 67}= {res}    0.0812
{txt}{col 51}Adj R-squared{col 67}= {res}   -0.0905
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0042
{txt}{col 51}Root MSE{col 67}= {res}    0.0267

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  rincexp_rv{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0022234{col 26}{space 2} .0019018{col 37}{space 1}   -1.17{col 46}{space 3}0.242{col 54}{space 4} -.005951{col 67}{space 3} .0015042
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0006445{col 26}{space 2} .0019883{col 37}{space 1}   -0.32{col 46}{space 3}0.746{col 54}{space 4}-.0045417{col 67}{space 3} .0032527
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.0023025{col 26}{space 2} .0019961{col 37}{space 1}   -1.15{col 46}{space 3}0.249{col 54}{space 4} -.006215{col 67}{space 3}   .00161
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.0043876{col 26}{space 2} .0020439{col 37}{space 1}   -2.15{col 46}{space 3}0.032{col 54}{space 4}-.0083937{col 67}{space 3}-.0003815
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.0016544{col 26}{space 2} .0020928{col 37}{space 1}   -0.79{col 46}{space 3}0.429{col 54}{space 4}-.0057564{col 67}{space 3} .0024475
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .0125402{col 26}{space 2} .0047661{col 37}{space 1}    2.63{col 46}{space 3}0.009{col 54}{space 4} .0031986{col 67}{space 3} .0218819
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .0015088{col 26}{space 2} .0021742{col 37}{space 1}    0.69{col 46}{space 3}0.488{col 54}{space 4}-.0027527{col 67}{space 3} .0057703
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .0021685{col 26}{space 2} .0021066{col 37}{space 1}    1.03{col 46}{space 3}0.303{col 54}{space 4}-.0019604{col 67}{space 3} .0062974
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .0010727{col 26}{space 2} .0020313{col 37}{space 1}    0.53{col 46}{space 3}0.597{col 54}{space 4}-.0029087{col 67}{space 3} .0050541
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .0004892{col 26}{space 2} .0019513{col 37}{space 1}    0.25{col 46}{space 3}0.802{col 54}{space 4}-.0033354{col 67}{space 3} .0043137
{txt}{space 9}12  {c |}{col 14}{res}{space 2}  .001088{col 26}{space 2} .0018939{col 37}{space 1}    0.57{col 46}{space 3}0.566{col 54}{space 4}-.0026242{col 67}{space 3} .0048002
{txt}{space 12} {c |}
{space 8}date {c |}
{space 8}643  {c |}{col 14}{res}{space 2} .0080258{col 26}{space 2} .0046425{col 37}{space 1}    1.73{col 46}{space 3}0.084{col 54}{space 4}-.0010737{col 67}{space 3} .0171252
{txt}{space 8}644  {c |}{col 14}{res}{space 2} .0102614{col 26}{space 2} .0045549{col 37}{space 1}    2.25{col 46}{space 3}0.024{col 54}{space 4} .0013336{col 67}{space 3} .0191893
{txt}{space 8}645  {c |}{col 14}{res}{space 2} .0143245{col 26}{space 2} .0045222{col 37}{space 1}    3.17{col 46}{space 3}0.002{col 54}{space 4} .0054607{col 67}{space 3} .0231882
{txt}{space 8}646  {c |}{col 14}{res}{space 2}  .013467{col 26}{space 2}  .004509{col 37}{space 1}    2.99{col 46}{space 3}0.003{col 54}{space 4} .0046293{col 67}{space 3} .0223047
{txt}{space 8}647  {c |}{col 14}{res}{space 2} .0141483{col 26}{space 2} .0045149{col 37}{space 1}    3.13{col 46}{space 3}0.002{col 54}{space 4}  .005299{col 67}{space 3} .0229976
{txt}{space 8}648  {c |}{col 14}{res}{space 2}  .012594{col 26}{space 2} .0045056{col 37}{space 1}    2.80{col 46}{space 3}0.005{col 54}{space 4} .0037628{col 67}{space 3} .0214252
{txt}{space 8}649  {c |}{col 14}{res}{space 2} .0121836{col 26}{space 2} .0044831{col 37}{space 1}    2.72{col 46}{space 3}0.007{col 54}{space 4} .0033966{col 67}{space 3} .0209706
{txt}{space 8}650  {c |}{col 14}{res}{space 2} .0147808{col 26}{space 2} .0045142{col 37}{space 1}    3.27{col 46}{space 3}0.001{col 54}{space 4}  .005933{col 67}{space 3} .0236287
{txt}{space 8}651  {c |}{col 14}{res}{space 2} .0128936{col 26}{space 2} .0045116{col 37}{space 1}    2.86{col 46}{space 3}0.004{col 54}{space 4} .0040507{col 67}{space 3} .0217364
{txt}{space 8}652  {c |}{col 14}{res}{space 2} .0169797{col 26}{space 2} .0045107{col 37}{space 1}    3.76{col 46}{space 3}0.000{col 54}{space 4} .0081385{col 67}{space 3} .0258208
{txt}{space 8}653  {c |}{col 14}{res}{space 2} .0119302{col 26}{space 2} .0045186{col 37}{space 1}    2.64{col 46}{space 3}0.008{col 54}{space 4} .0030735{col 67}{space 3} .0207869
{txt}{space 8}654  {c |}{col 14}{res}{space 2} .0004815{col 26}{space 2} .0026007{col 37}{space 1}    0.19{col 46}{space 3}0.853{col 54}{space 4} -.004616{col 67}{space 3} .0055789
{txt}{space 8}655  {c |}{col 14}{res}{space 2} .0113754{col 26}{space 2} .0042453{col 37}{space 1}    2.68{col 46}{space 3}0.007{col 54}{space 4} .0030544{col 67}{space 3} .0196963
{txt}{space 8}656  {c |}{col 14}{res}{space 2} .0073794{col 26}{space 2} .0042485{col 37}{space 1}    1.74{col 46}{space 3}0.082{col 54}{space 4}-.0009479{col 67}{space 3} .0157067
{txt}{space 8}657  {c |}{col 14}{res}{space 2}  .008843{col 26}{space 2} .0042263{col 37}{space 1}    2.09{col 46}{space 3}0.036{col 54}{space 4} .0005593{col 67}{space 3} .0171267
{txt}{space 8}658  {c |}{col 14}{res}{space 2} .0093527{col 26}{space 2} .0042233{col 37}{space 1}    2.21{col 46}{space 3}0.027{col 54}{space 4}  .001075{col 67}{space 3} .0176305
{txt}{space 8}659  {c |}{col 14}{res}{space 2} .0091743{col 26}{space 2} .0042157{col 37}{space 1}    2.18{col 46}{space 3}0.030{col 54}{space 4} .0009114{col 67}{space 3} .0174372
{txt}{space 8}660  {c |}{col 14}{res}{space 2} .0082558{col 26}{space 2} .0042281{col 37}{space 1}    1.95{col 46}{space 3}0.051{col 54}{space 4}-.0000315{col 67}{space 3}  .016543
{txt}{space 8}661  {c |}{col 14}{res}{space 2} .0091963{col 26}{space 2} .0042074{col 37}{space 1}    2.19{col 46}{space 3}0.029{col 54}{space 4} .0009496{col 67}{space 3}  .017443
{txt}{space 8}662  {c |}{col 14}{res}{space 2}  .008647{col 26}{space 2} .0042298{col 37}{space 1}    2.04{col 46}{space 3}0.041{col 54}{space 4} .0003564{col 67}{space 3} .0169377
{txt}{space 8}663  {c |}{col 14}{res}{space 2} .0108411{col 26}{space 2} .0042241{col 37}{space 1}    2.57{col 46}{space 3}0.010{col 54}{space 4} .0025617{col 67}{space 3} .0191206
{txt}{space 8}664  {c |}{col 14}{res}{space 2} .0115209{col 26}{space 2} .0042178{col 37}{space 1}    2.73{col 46}{space 3}0.006{col 54}{space 4} .0032539{col 67}{space 3} .0197879
{txt}{space 8}665  {c |}{col 14}{res}{space 2} .0081157{col 26}{space 2} .0042134{col 37}{space 1}    1.93{col 46}{space 3}0.054{col 54}{space 4}-.0001426{col 67}{space 3} .0163741
{txt}{space 8}666  {c |}{col 14}{res}{space 2}-.0063637{col 26}{space 2} .0030533{col 37}{space 1}   -2.08{col 46}{space 3}0.037{col 54}{space 4}-.0123482{col 67}{space 3}-.0003792
{txt}{space 8}667  {c |}{col 14}{res}{space 2} .0066033{col 26}{space 2} .0039506{col 37}{space 1}    1.67{col 46}{space 3}0.095{col 54}{space 4}  -.00114{col 67}{space 3} .0143466
{txt}{space 8}668  {c |}{col 14}{res}{space 2} .0042354{col 26}{space 2} .0039302{col 37}{space 1}    1.08{col 46}{space 3}0.281{col 54}{space 4} -.003468{col 67}{space 3} .0119388
{txt}{space 8}669  {c |}{col 14}{res}{space 2} .0063276{col 26}{space 2} .0039227{col 37}{space 1}    1.61{col 46}{space 3}0.107{col 54}{space 4}-.0013611{col 67}{space 3} .0140162
{txt}{space 8}670  {c |}{col 14}{res}{space 2} .0065449{col 26}{space 2} .0038933{col 37}{space 1}    1.68{col 46}{space 3}0.093{col 54}{space 4} -.001086{col 67}{space 3} .0141758
{txt}{space 8}671  {c |}{col 14}{res}{space 2} .0047823{col 26}{space 2} .0038798{col 37}{space 1}    1.23{col 46}{space 3}0.218{col 54}{space 4}-.0028223{col 67}{space 3} .0123869
{txt}{space 8}672  {c |}{col 14}{res}{space 2} .0076265{col 26}{space 2} .0038877{col 37}{space 1}    1.96{col 46}{space 3}0.050{col 54}{space 4} 6.51e-06{col 67}{space 3} .0152465
{txt}{space 8}673  {c |}{col 14}{res}{space 2} .0070131{col 26}{space 2} .0038877{col 37}{space 1}    1.80{col 46}{space 3}0.071{col 54}{space 4}-.0006068{col 67}{space 3}  .014633
{txt}{space 8}674  {c |}{col 14}{res}{space 2} .0070803{col 26}{space 2} .0039129{col 37}{space 1}    1.81{col 46}{space 3}0.070{col 54}{space 4} -.000589{col 67}{space 3} .0147497
{txt}{space 8}675  {c |}{col 14}{res}{space 2} .0050746{col 26}{space 2} .0039008{col 37}{space 1}    1.30{col 46}{space 3}0.193{col 54}{space 4}-.0025711{col 67}{space 3} .0127202
{txt}{space 8}676  {c |}{col 14}{res}{space 2} .0075547{col 26}{space 2} .0039173{col 37}{space 1}    1.93{col 46}{space 3}0.054{col 54}{space 4}-.0001233{col 67}{space 3} .0152327
{txt}{space 8}677  {c |}{col 14}{res}{space 2}  .005419{col 26}{space 2} .0039144{col 37}{space 1}    1.38{col 46}{space 3}0.166{col 54}{space 4}-.0022533{col 67}{space 3} .0130913
{txt}{space 8}678  {c |}{col 14}{res}{space 2}-.0086266{col 26}{space 2} .0033899{col 37}{space 1}   -2.54{col 46}{space 3}0.011{col 54}{space 4}-.0152709{col 67}{space 3}-.0019823
{txt}{space 8}679  {c |}{col 14}{res}{space 2} .0008453{col 26}{space 2}  .003614{col 37}{space 1}    0.23{col 46}{space 3}0.815{col 54}{space 4}-.0062382{col 67}{space 3} .0079287
{txt}{space 8}680  {c |}{col 14}{res}{space 2}-.0014768{col 26}{space 2} .0036051{col 37}{space 1}   -0.41{col 46}{space 3}0.682{col 54}{space 4}-.0085429{col 67}{space 3} .0055893
{txt}{space 8}681  {c |}{col 14}{res}{space 2} .0005182{col 26}{space 2}   .00359{col 37}{space 1}    0.14{col 46}{space 3}0.885{col 54}{space 4}-.0065184{col 67}{space 3} .0075547
{txt}{space 8}682  {c |}{col 14}{res}{space 2}-.0021246{col 26}{space 2} .0035811{col 37}{space 1}   -0.59{col 46}{space 3}0.553{col 54}{space 4}-.0091437{col 67}{space 3} .0048945
{txt}{space 8}683  {c |}{col 14}{res}{space 2} .0024896{col 26}{space 2} .0035725{col 37}{space 1}    0.70{col 46}{space 3}0.486{col 54}{space 4}-.0045125{col 67}{space 3} .0094918
{txt}{space 8}684  {c |}{col 14}{res}{space 2} .0000694{col 26}{space 2} .0035965{col 37}{space 1}    0.02{col 46}{space 3}0.985{col 54}{space 4}-.0069799{col 67}{space 3} .0071187
{txt}{space 8}685  {c |}{col 14}{res}{space 2} .0041509{col 26}{space 2} .0035908{col 37}{space 1}    1.16{col 46}{space 3}0.248{col 54}{space 4}-.0028872{col 67}{space 3} .0111889
{txt}{space 8}686  {c |}{col 14}{res}{space 2} .0024606{col 26}{space 2} .0036161{col 37}{space 1}    0.68{col 46}{space 3}0.496{col 54}{space 4}-.0046271{col 67}{space 3} .0095484
{txt}{space 8}687  {c |}{col 14}{res}{space 2} .0031892{col 26}{space 2} .0036068{col 37}{space 1}    0.88{col 46}{space 3}0.377{col 54}{space 4}-.0038803{col 67}{space 3} .0102586
{txt}{space 8}688  {c |}{col 14}{res}{space 2} .0063879{col 26}{space 2} .0036125{col 37}{space 1}    1.77{col 46}{space 3}0.077{col 54}{space 4}-.0006926{col 67}{space 3} .0134684
{txt}{space 8}689  {c |}{col 14}{res}{space 2} .0041645{col 26}{space 2} .0036045{col 37}{space 1}    1.16{col 46}{space 3}0.248{col 54}{space 4}-.0029005{col 67}{space 3} .0112294
{txt}{space 8}690  {c |}{col 14}{res}{space 2}-.0107012{col 26}{space 2} .0037162{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4} -.017985{col 67}{space 3}-.0034174
{txt}{space 8}691  {c |}{col 14}{res}{space 2}-.0009021{col 26}{space 2} .0032588{col 37}{space 1}   -0.28{col 46}{space 3}0.782{col 54}{space 4}-.0072894{col 67}{space 3} .0054853
{txt}{space 8}692  {c |}{col 14}{res}{space 2}-.0013723{col 26}{space 2} .0032761{col 37}{space 1}   -0.42{col 46}{space 3}0.675{col 54}{space 4}-.0077936{col 67}{space 3}  .005049
{txt}{space 8}693  {c |}{col 14}{res}{space 2}-.0010616{col 26}{space 2} .0032597{col 37}{space 1}   -0.33{col 46}{space 3}0.745{col 54}{space 4}-.0074508{col 67}{space 3} .0053275
{txt}{space 8}694  {c |}{col 14}{res}{space 2} .0008167{col 26}{space 2} .0032427{col 37}{space 1}    0.25{col 46}{space 3}0.801{col 54}{space 4} -.005539{col 67}{space 3} .0071724
{txt}{space 8}695  {c |}{col 14}{res}{space 2}-.0008375{col 26}{space 2} .0032377{col 37}{space 1}   -0.26{col 46}{space 3}0.796{col 54}{space 4}-.0071836{col 67}{space 3} .0055085
{txt}{space 8}696  {c |}{col 14}{res}{space 2} .0026681{col 26}{space 2} .0032775{col 37}{space 1}    0.81{col 46}{space 3}0.416{col 54}{space 4} -.003756{col 67}{space 3} .0090921
{txt}{space 8}697  {c |}{col 14}{res}{space 2} .0001207{col 26}{space 2} .0032661{col 37}{space 1}    0.04{col 46}{space 3}0.971{col 54}{space 4}-.0062811{col 67}{space 3} .0065224
{txt}{space 8}698  {c |}{col 14}{res}{space 2} .0015636{col 26}{space 2} .0032788{col 37}{space 1}    0.48{col 46}{space 3}0.633{col 54}{space 4}-.0048629{col 67}{space 3} .0079902
{txt}{space 8}699  {c |}{col 14}{res}{space 2} .0046691{col 26}{space 2} .0032679{col 37}{space 1}    1.43{col 46}{space 3}0.153{col 54}{space 4}-.0017362{col 67}{space 3} .0110744
{txt}{space 8}700  {c |}{col 14}{res}{space 2} .0049144{col 26}{space 2} .0032666{col 37}{space 1}    1.50{col 46}{space 3}0.132{col 54}{space 4}-.0014883{col 67}{space 3} .0113171
{txt}{space 8}701  {c |}{col 14}{res}{space 2} .0032083{col 26}{space 2} .0032852{col 37}{space 1}    0.98{col 46}{space 3}0.329{col 54}{space 4}-.0032308{col 67}{space 3} .0096474
{txt}{space 8}702  {c |}{col 14}{res}{space 2}-.0144557{col 26}{space 2} .0040596{col 37}{space 1}   -3.56{col 46}{space 3}0.000{col 54}{space 4}-.0224126{col 67}{space 3}-.0064988
{txt}{space 8}703  {c |}{col 14}{res}{space 2}-.0004595{col 26}{space 2} .0028851{col 37}{space 1}   -0.16{col 46}{space 3}0.873{col 54}{space 4}-.0061143{col 67}{space 3} .0051953
{txt}{space 8}704  {c |}{col 14}{res}{space 2}-.0008287{col 26}{space 2} .0028894{col 37}{space 1}   -0.29{col 46}{space 3}0.774{col 54}{space 4}-.0064919{col 67}{space 3} .0048345
{txt}{space 8}705  {c |}{col 14}{res}{space 2}-.0007324{col 26}{space 2} .0028614{col 37}{space 1}   -0.26{col 46}{space 3}0.798{col 54}{space 4}-.0063408{col 67}{space 3}  .004876
{txt}{space 8}706  {c |}{col 14}{res}{space 2}-.0002115{col 26}{space 2} .0028309{col 37}{space 1}   -0.07{col 46}{space 3}0.940{col 54}{space 4}-.0057602{col 67}{space 3} .0053371
{txt}{space 8}707  {c |}{col 14}{res}{space 2}  .001204{col 26}{space 2} .0028393{col 37}{space 1}    0.42{col 46}{space 3}0.672{col 54}{space 4}-.0043612{col 67}{space 3} .0067691
{txt}{space 8}708  {c |}{col 14}{res}{space 2} .0011931{col 26}{space 2} .0028501{col 37}{space 1}    0.42{col 46}{space 3}0.676{col 54}{space 4}-.0043932{col 67}{space 3} .0067794
{txt}{space 8}709  {c |}{col 14}{res}{space 2} .0041246{col 26}{space 2}  .002835{col 37}{space 1}    1.45{col 46}{space 3}0.146{col 54}{space 4}-.0014322{col 67}{space 3} .0096814
{txt}{space 8}710  {c |}{col 14}{res}{space 2} .0017934{col 26}{space 2} .0028807{col 37}{space 1}    0.62{col 46}{space 3}0.534{col 54}{space 4} -.003853{col 67}{space 3} .0074397
{txt}{space 8}711  {c |}{col 14}{res}{space 2} .0030621{col 26}{space 2} .0028577{col 37}{space 1}    1.07{col 46}{space 3}0.284{col 54}{space 4}-.0025391{col 67}{space 3} .0086633
{txt}{space 8}712  {c |}{col 14}{res}{space 2} .0040123{col 26}{space 2} .0028801{col 37}{space 1}    1.39{col 46}{space 3}0.164{col 54}{space 4}-.0016329{col 67}{space 3} .0096575
{txt}{space 8}713  {c |}{col 14}{res}{space 2} .0032153{col 26}{space 2} .0028986{col 37}{space 1}    1.11{col 46}{space 3}0.267{col 54}{space 4} -.002466{col 67}{space 3} .0088965
{txt}{space 8}714  {c |}{col 14}{res}{space 2} -.011066{col 26}{space 2} .0043084{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4}-.0195105{col 67}{space 3}-.0026215
{txt}{space 8}715  {c |}{col 14}{res}{space 2}-.0012993{col 26}{space 2} .0024554{col 37}{space 1}   -0.53{col 46}{space 3}0.597{col 54}{space 4} -.006112{col 67}{space 3} .0035134
{txt}{space 8}716  {c |}{col 14}{res}{space 2} -.000959{col 26}{space 2} .0024633{col 37}{space 1}   -0.39{col 46}{space 3}0.697{col 54}{space 4}-.0057872{col 67}{space 3} .0038691
{txt}{space 8}717  {c |}{col 14}{res}{space 2}-.0002816{col 26}{space 2} .0024512{col 37}{space 1}   -0.11{col 46}{space 3}0.909{col 54}{space 4}-.0050859{col 67}{space 3} .0045228
{txt}{space 8}718  {c |}{col 14}{res}{space 2}  .000889{col 26}{space 2} .0024257{col 37}{space 1}    0.37{col 46}{space 3}0.714{col 54}{space 4}-.0038655{col 67}{space 3} .0056434
{txt}{space 8}719  {c |}{col 14}{res}{space 2}-.0000861{col 26}{space 2} .0023833{col 37}{space 1}   -0.04{col 46}{space 3}0.971{col 54}{space 4}-.0047574{col 67}{space 3} .0045852
{txt}{space 8}720  {c |}{col 14}{res}{space 2} .0016767{col 26}{space 2} .0023918{col 37}{space 1}    0.70{col 46}{space 3}0.483{col 54}{space 4}-.0030112{col 67}{space 3} .0063647
{txt}{space 8}721  {c |}{col 14}{res}{space 2} .0008659{col 26}{space 2}  .002372{col 37}{space 1}    0.37{col 46}{space 3}0.715{col 54}{space 4}-.0037832{col 67}{space 3}  .005515
{txt}{space 8}722  {c |}{col 14}{res}{space 2}-.0033956{col 26}{space 2} .0024736{col 37}{space 1}   -1.37{col 46}{space 3}0.170{col 54}{space 4} -.008244{col 67}{space 3} .0014528
{txt}{space 8}723  {c |}{col 14}{res}{space 2}-.0048823{col 26}{space 2} .0025132{col 37}{space 1}   -1.94{col 46}{space 3}0.052{col 54}{space 4}-.0098083{col 67}{space 3} .0000438
{txt}{space 8}724  {c |}{col 14}{res}{space 2} .0057054{col 26}{space 2} .0025628{col 37}{space 1}    2.23{col 46}{space 3}0.026{col 54}{space 4} .0006822{col 67}{space 3} .0107285
{txt}{space 8}725  {c |}{col 14}{res}{space 2} .0054984{col 26}{space 2} .0025512{col 37}{space 1}    2.16{col 46}{space 3}0.031{col 54}{space 4} .0004979{col 67}{space 3} .0104989
{txt}{space 8}726  {c |}{col 14}{res}{space 2}-.0123743{col 26}{space 2} .0046761{col 37}{space 1}   -2.65{col 46}{space 3}0.008{col 54}{space 4}-.0215396{col 67}{space 3} -.003209
{txt}{space 8}727  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}728  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}729  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}730  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}731  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}732  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}733  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}734  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}735  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}736  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}737  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}738  {c |}{col 14}{res}{space 2}-.0170592{col 26}{space 2} .0049194{col 37}{space 1}   -3.47{col 46}{space 3}0.001{col 54}{space 4}-.0267015{col 67}{space 3} -.007417
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0035908{col 26}{space 2} .0026797{col 37}{space 1}   -1.34{col 46}{space 3}0.180{col 54}{space 4}-.0088431{col 67}{space 3} .0016616
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     6373{col 27}{space 1}        0{col 39}{result}{space 1}     6373{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est2{txt} stored)

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. estadd local hastid "Yes",replace

{txt}added macro:
             e(hastid) : "{res:Yes}"

{com}. 
. eststo: reghdfe incvar i.month i.date, a(ID)
{res}{txt}(dropped 1944 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}{txt}note: 727.date omitted because of collinearity
{txt}note: 728.date omitted because of collinearity
{txt}note: 729.date omitted because of collinearity
{txt}note: 730.date omitted because of collinearity
{txt}note: 731.date omitted because of collinearity
{txt}note: 732.date omitted because of collinearity
{txt}note: 733.date omitted because of collinearity
{txt}note: 734.date omitted because of collinearity
{txt}note: 735.date omitted because of collinearity
{txt}note: 736.date omitted because of collinearity
{txt}note: 738.date omitted because of collinearity
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    61,122
{txt}Absorbing 1 HDFE group{col 51}F({res}  97{txt},{res}  52558{txt}){col 67}= {res}      4.20
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.5938
{txt}{col 51}Adj R-squared{col 67}= {res}    0.5277
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0077
{txt}{col 51}Root MSE{col 67}= {res}    0.0006

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      incvar{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0000763{col 26}{space 2} .0000346{col 37}{space 1}   -2.20{col 46}{space 3}0.028{col 54}{space 4}-.0001441{col 67}{space 3}-8.40e-06
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0000933{col 26}{space 2} .0000354{col 37}{space 1}   -2.63{col 46}{space 3}0.008{col 54}{space 4}-.0001627{col 67}{space 3}-.0000238
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.0000919{col 26}{space 2} .0000349{col 37}{space 1}   -2.63{col 46}{space 3}0.008{col 54}{space 4}-.0001603{col 67}{space 3}-.0000235
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.0000866{col 26}{space 2}  .000036{col 37}{space 1}   -2.40{col 46}{space 3}0.016{col 54}{space 4}-.0001572{col 67}{space 3} -.000016
{txt}{space 10}6  {c |}{col 14}{res}{space 2} .0011493{col 26}{space 2} .0000776{col 37}{space 1}   14.80{col 46}{space 3}0.000{col 54}{space 4} .0009972{col 67}{space 3} .0013015
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.0001754{col 26}{space 2} .0000377{col 37}{space 1}   -4.65{col 46}{space 3}0.000{col 54}{space 4}-.0002493{col 67}{space 3}-.0001014
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-3.58e-07{col 26}{space 2} .0000372{col 37}{space 1}   -0.01{col 46}{space 3}0.992{col 54}{space 4}-.0000732{col 67}{space 3} .0000725
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.0000408{col 26}{space 2} .0000363{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-.0001119{col 67}{space 3} .0000303
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .0000313{col 26}{space 2} .0000351{col 37}{space 1}    0.89{col 46}{space 3}0.372{col 54}{space 4}-.0000375{col 67}{space 3}    .0001
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.0000442{col 26}{space 2} .0000345{col 37}{space 1}   -1.28{col 46}{space 3}0.200{col 54}{space 4}-.0001118{col 67}{space 3} .0000235
{txt}{space 9}12  {c |}{col 14}{res}{space 2}-.0000345{col 26}{space 2} .0000334{col 37}{space 1}   -1.03{col 46}{space 3}0.301{col 54}{space 4}-.0000999{col 67}{space 3} .0000309
{txt}{space 12} {c |}
{space 8}date {c |}
{space 8}642  {c |}{col 14}{res}{space 2}  .001301{col 26}{space 2} .0000794{col 37}{space 1}   16.39{col 46}{space 3}0.000{col 54}{space 4} .0011454{col 67}{space 3} .0014566
{txt}{space 8}643  {c |}{col 14}{res}{space 2} .0011053{col 26}{space 2} .0000737{col 37}{space 1}   15.00{col 46}{space 3}0.000{col 54}{space 4} .0009609{col 67}{space 3} .0012497
{txt}{space 8}644  {c |}{col 14}{res}{space 2} .0011402{col 26}{space 2} .0000735{col 37}{space 1}   15.51{col 46}{space 3}0.000{col 54}{space 4} .0009961{col 67}{space 3} .0012843
{txt}{space 8}645  {c |}{col 14}{res}{space 2} .0010759{col 26}{space 2} .0000731{col 37}{space 1}   14.71{col 46}{space 3}0.000{col 54}{space 4} .0009326{col 67}{space 3} .0012193
{txt}{space 8}646  {c |}{col 14}{res}{space 2}  .001127{col 26}{space 2}  .000073{col 37}{space 1}   15.44{col 46}{space 3}0.000{col 54}{space 4} .0009839{col 67}{space 3} .0012701
{txt}{space 8}647  {c |}{col 14}{res}{space 2} .0011146{col 26}{space 2} .0000725{col 37}{space 1}   15.36{col 46}{space 3}0.000{col 54}{space 4} .0009724{col 67}{space 3} .0012568
{txt}{space 8}648  {c |}{col 14}{res}{space 2}  .001044{col 26}{space 2}  .000073{col 37}{space 1}   14.31{col 46}{space 3}0.000{col 54}{space 4}  .000901{col 67}{space 3}  .001187
{txt}{space 8}649  {c |}{col 14}{res}{space 2} .0011289{col 26}{space 2} .0000731{col 37}{space 1}   15.45{col 46}{space 3}0.000{col 54}{space 4} .0009857{col 67}{space 3} .0012721
{txt}{space 8}650  {c |}{col 14}{res}{space 2} .0011295{col 26}{space 2} .0000735{col 37}{space 1}   15.37{col 46}{space 3}0.000{col 54}{space 4} .0009854{col 67}{space 3} .0012736
{txt}{space 8}651  {c |}{col 14}{res}{space 2} .0011044{col 26}{space 2} .0000731{col 37}{space 1}   15.11{col 46}{space 3}0.000{col 54}{space 4} .0009612{col 67}{space 3} .0012477
{txt}{space 8}652  {c |}{col 14}{res}{space 2} .0010498{col 26}{space 2} .0000735{col 37}{space 1}   14.29{col 46}{space 3}0.000{col 54}{space 4} .0009058{col 67}{space 3} .0011937
{txt}{space 8}653  {c |}{col 14}{res}{space 2}-.0001475{col 26}{space 2} .0000439{col 37}{space 1}   -3.36{col 46}{space 3}0.001{col 54}{space 4}-.0002336{col 67}{space 3}-.0000614
{txt}{space 8}654  {c |}{col 14}{res}{space 2} .0011202{col 26}{space 2} .0000737{col 37}{space 1}   15.19{col 46}{space 3}0.000{col 54}{space 4} .0009757{col 67}{space 3} .0012648
{txt}{space 8}655  {c |}{col 14}{res}{space 2} .0010027{col 26}{space 2} .0000696{col 37}{space 1}   14.40{col 46}{space 3}0.000{col 54}{space 4} .0008662{col 67}{space 3} .0011392
{txt}{space 8}656  {c |}{col 14}{res}{space 2} .0009636{col 26}{space 2} .0000695{col 37}{space 1}   13.86{col 46}{space 3}0.000{col 54}{space 4} .0008274{col 67}{space 3} .0010999
{txt}{space 8}657  {c |}{col 14}{res}{space 2} .0009095{col 26}{space 2} .0000691{col 37}{space 1}   13.17{col 46}{space 3}0.000{col 54}{space 4} .0007741{col 67}{space 3} .0010449
{txt}{space 8}658  {c |}{col 14}{res}{space 2} .0009858{col 26}{space 2} .0000691{col 37}{space 1}   14.27{col 46}{space 3}0.000{col 54}{space 4} .0008504{col 67}{space 3} .0011212
{txt}{space 8}659  {c |}{col 14}{res}{space 2} .0009545{col 26}{space 2} .0000684{col 37}{space 1}   13.95{col 46}{space 3}0.000{col 54}{space 4} .0008204{col 67}{space 3} .0010887
{txt}{space 8}660  {c |}{col 14}{res}{space 2} .0008913{col 26}{space 2} .0000689{col 37}{space 1}   12.94{col 46}{space 3}0.000{col 54}{space 4} .0007563{col 67}{space 3} .0010263
{txt}{space 8}661  {c |}{col 14}{res}{space 2} .0009743{col 26}{space 2} .0000691{col 37}{space 1}   14.10{col 46}{space 3}0.000{col 54}{space 4} .0008388{col 67}{space 3} .0011097
{txt}{space 8}662  {c |}{col 14}{res}{space 2} .0009671{col 26}{space 2} .0000696{col 37}{space 1}   13.90{col 46}{space 3}0.000{col 54}{space 4} .0008307{col 67}{space 3} .0011035
{txt}{space 8}663  {c |}{col 14}{res}{space 2}  .001018{col 26}{space 2} .0000691{col 37}{space 1}   14.74{col 46}{space 3}0.000{col 54}{space 4} .0008826{col 67}{space 3} .0011534
{txt}{space 8}664  {c |}{col 14}{res}{space 2} .0009107{col 26}{space 2} .0000691{col 37}{space 1}   13.19{col 46}{space 3}0.000{col 54}{space 4} .0007753{col 67}{space 3} .0010461
{txt}{space 8}665  {c |}{col 14}{res}{space 2}-.0003108{col 26}{space 2} .0000504{col 37}{space 1}   -6.17{col 46}{space 3}0.000{col 54}{space 4}-.0004096{col 67}{space 3}-.0002121
{txt}{space 8}666  {c |}{col 14}{res}{space 2} .0009817{col 26}{space 2} .0000697{col 37}{space 1}   14.09{col 46}{space 3}0.000{col 54}{space 4} .0008451{col 67}{space 3} .0011183
{txt}{space 8}667  {c |}{col 14}{res}{space 2} .0008437{col 26}{space 2} .0000652{col 37}{space 1}   12.94{col 46}{space 3}0.000{col 54}{space 4} .0007159{col 67}{space 3} .0009716
{txt}{space 8}668  {c |}{col 14}{res}{space 2} .0008269{col 26}{space 2} .0000649{col 37}{space 1}   12.74{col 46}{space 3}0.000{col 54}{space 4} .0006997{col 67}{space 3} .0009542
{txt}{space 8}669  {c |}{col 14}{res}{space 2} .0007432{col 26}{space 2} .0000644{col 37}{space 1}   11.55{col 46}{space 3}0.000{col 54}{space 4} .0006171{col 67}{space 3} .0008694
{txt}{space 8}670  {c |}{col 14}{res}{space 2} .0008393{col 26}{space 2} .0000642{col 37}{space 1}   13.07{col 46}{space 3}0.000{col 54}{space 4} .0007134{col 67}{space 3} .0009651
{txt}{space 8}671  {c |}{col 14}{res}{space 2}  .000788{col 26}{space 2} .0000634{col 37}{space 1}   12.44{col 46}{space 3}0.000{col 54}{space 4} .0006638{col 67}{space 3} .0009122
{txt}{space 8}672  {c |}{col 14}{res}{space 2} .0007468{col 26}{space 2} .0000641{col 37}{space 1}   11.65{col 46}{space 3}0.000{col 54}{space 4} .0006212{col 67}{space 3} .0008724
{txt}{space 8}673  {c |}{col 14}{res}{space 2}  .000784{col 26}{space 2} .0000645{col 37}{space 1}   12.16{col 46}{space 3}0.000{col 54}{space 4} .0006576{col 67}{space 3} .0009104
{txt}{space 8}674  {c |}{col 14}{res}{space 2}   .00086{col 26}{space 2} .0000646{col 37}{space 1}   13.32{col 46}{space 3}0.000{col 54}{space 4} .0007334{col 67}{space 3} .0009866
{txt}{space 8}675  {c |}{col 14}{res}{space 2} .0008502{col 26}{space 2} .0000642{col 37}{space 1}   13.24{col 46}{space 3}0.000{col 54}{space 4} .0007243{col 67}{space 3} .0009761
{txt}{space 8}676  {c |}{col 14}{res}{space 2} .0008392{col 26}{space 2} .0000643{col 37}{space 1}   13.04{col 46}{space 3}0.000{col 54}{space 4} .0007131{col 67}{space 3} .0009653
{txt}{space 8}677  {c |}{col 14}{res}{space 2}-.0004165{col 26}{space 2} .0000561{col 37}{space 1}   -7.43{col 46}{space 3}0.000{col 54}{space 4}-.0005264{col 67}{space 3}-.0003067
{txt}{space 8}678  {c |}{col 14}{res}{space 2} .0008921{col 26}{space 2} .0000646{col 37}{space 1}   13.80{col 46}{space 3}0.000{col 54}{space 4} .0007655{col 67}{space 3} .0010188
{txt}{space 8}679  {c |}{col 14}{res}{space 2} .0006823{col 26}{space 2} .0000597{col 37}{space 1}   11.42{col 46}{space 3}0.000{col 54}{space 4} .0005652{col 67}{space 3} .0007994
{txt}{space 8}680  {c |}{col 14}{res}{space 2}  .000706{col 26}{space 2} .0000595{col 37}{space 1}   11.86{col 46}{space 3}0.000{col 54}{space 4} .0005893{col 67}{space 3} .0008227
{txt}{space 8}681  {c |}{col 14}{res}{space 2} .0006424{col 26}{space 2}  .000059{col 37}{space 1}   10.89{col 46}{space 3}0.000{col 54}{space 4} .0005267{col 67}{space 3}  .000758
{txt}{space 8}682  {c |}{col 14}{res}{space 2} .0007237{col 26}{space 2}  .000059{col 37}{space 1}   12.26{col 46}{space 3}0.000{col 54}{space 4}  .000608{col 67}{space 3} .0008394
{txt}{space 8}683  {c |}{col 14}{res}{space 2} .0007151{col 26}{space 2} .0000579{col 37}{space 1}   12.36{col 46}{space 3}0.000{col 54}{space 4} .0006017{col 67}{space 3} .0008285
{txt}{space 8}684  {c |}{col 14}{res}{space 2} .0006557{col 26}{space 2} .0000588{col 37}{space 1}   11.15{col 46}{space 3}0.000{col 54}{space 4} .0005404{col 67}{space 3} .0007709
{txt}{space 8}685  {c |}{col 14}{res}{space 2} .0007092{col 26}{space 2} .0000591{col 37}{space 1}   11.99{col 46}{space 3}0.000{col 54}{space 4} .0005933{col 67}{space 3} .0008251
{txt}{space 8}686  {c |}{col 14}{res}{space 2} .0007307{col 26}{space 2} .0000594{col 37}{space 1}   12.30{col 46}{space 3}0.000{col 54}{space 4} .0006143{col 67}{space 3} .0008471
{txt}{space 8}687  {c |}{col 14}{res}{space 2} .0006911{col 26}{space 2} .0000591{col 37}{space 1}   11.69{col 46}{space 3}0.000{col 54}{space 4} .0005752{col 67}{space 3} .0008071
{txt}{space 8}688  {c |}{col 14}{res}{space 2} .0007067{col 26}{space 2} .0000592{col 37}{space 1}   11.94{col 46}{space 3}0.000{col 54}{space 4} .0005908{col 67}{space 3} .0008227
{txt}{space 8}689  {c |}{col 14}{res}{space 2}-.0005673{col 26}{space 2} .0000611{col 37}{space 1}   -9.28{col 46}{space 3}0.000{col 54}{space 4}-.0006871{col 67}{space 3}-.0004475
{txt}{space 8}690  {c |}{col 14}{res}{space 2} .0007294{col 26}{space 2} .0000596{col 37}{space 1}   12.24{col 46}{space 3}0.000{col 54}{space 4} .0006126{col 67}{space 3} .0008462
{txt}{space 8}691  {c |}{col 14}{res}{space 2} .0005345{col 26}{space 2} .0000543{col 37}{space 1}    9.84{col 46}{space 3}0.000{col 54}{space 4}  .000428{col 67}{space 3}  .000641
{txt}{space 8}692  {c |}{col 14}{res}{space 2} .0005559{col 26}{space 2} .0000544{col 37}{space 1}   10.22{col 46}{space 3}0.000{col 54}{space 4} .0004493{col 67}{space 3} .0006625
{txt}{space 8}693  {c |}{col 14}{res}{space 2} .0004538{col 26}{space 2} .0000538{col 37}{space 1}    8.44{col 46}{space 3}0.000{col 54}{space 4} .0003484{col 67}{space 3} .0005592
{txt}{space 8}694  {c |}{col 14}{res}{space 2} .0005001{col 26}{space 2} .0000536{col 37}{space 1}    9.32{col 46}{space 3}0.000{col 54}{space 4}  .000395{col 67}{space 3} .0006053
{txt}{space 8}695  {c |}{col 14}{res}{space 2} .0005282{col 26}{space 2} .0000529{col 37}{space 1}    9.99{col 46}{space 3}0.000{col 54}{space 4} .0004246{col 67}{space 3} .0006318
{txt}{space 8}696  {c |}{col 14}{res}{space 2} .0004831{col 26}{space 2} .0000538{col 37}{space 1}    8.97{col 46}{space 3}0.000{col 54}{space 4} .0003775{col 67}{space 3} .0005886
{txt}{space 8}697  {c |}{col 14}{res}{space 2} .0005282{col 26}{space 2}  .000054{col 37}{space 1}    9.78{col 46}{space 3}0.000{col 54}{space 4} .0004224{col 67}{space 3}  .000634
{txt}{space 8}698  {c |}{col 14}{res}{space 2} .0005078{col 26}{space 2} .0000543{col 37}{space 1}    9.35{col 46}{space 3}0.000{col 54}{space 4} .0004013{col 67}{space 3} .0006142
{txt}{space 8}699  {c |}{col 14}{res}{space 2} .0004963{col 26}{space 2} .0000538{col 37}{space 1}    9.22{col 46}{space 3}0.000{col 54}{space 4} .0003909{col 67}{space 3} .0006018
{txt}{space 8}700  {c |}{col 14}{res}{space 2} .0004879{col 26}{space 2} .0000542{col 37}{space 1}    9.01{col 46}{space 3}0.000{col 54}{space 4} .0003817{col 67}{space 3}  .000594
{txt}{space 8}701  {c |}{col 14}{res}{space 2}-.0007216{col 26}{space 2} .0000664{col 37}{space 1}  -10.87{col 46}{space 3}0.000{col 54}{space 4}-.0008517{col 67}{space 3}-.0005915
{txt}{space 8}702  {c |}{col 14}{res}{space 2} .0005568{col 26}{space 2} .0000546{col 37}{space 1}   10.20{col 46}{space 3}0.000{col 54}{space 4} .0004498{col 67}{space 3} .0006638
{txt}{space 8}703  {c |}{col 14}{res}{space 2} .0003393{col 26}{space 2} .0000486{col 37}{space 1}    6.98{col 46}{space 3}0.000{col 54}{space 4}  .000244{col 67}{space 3} .0004346
{txt}{space 8}704  {c |}{col 14}{res}{space 2}  .000351{col 26}{space 2} .0000486{col 37}{space 1}    7.22{col 46}{space 3}0.000{col 54}{space 4} .0002557{col 67}{space 3} .0004463
{txt}{space 8}705  {c |}{col 14}{res}{space 2} .0002933{col 26}{space 2} .0000479{col 37}{space 1}    6.13{col 46}{space 3}0.000{col 54}{space 4} .0001995{col 67}{space 3} .0003871
{txt}{space 8}706  {c |}{col 14}{res}{space 2} .0003496{col 26}{space 2} .0000478{col 37}{space 1}    7.32{col 46}{space 3}0.000{col 54}{space 4}  .000256{col 67}{space 3} .0004432
{txt}{space 8}707  {c |}{col 14}{res}{space 2}   .00034{col 26}{space 2} .0000467{col 37}{space 1}    7.28{col 46}{space 3}0.000{col 54}{space 4} .0002484{col 67}{space 3} .0004315
{txt}{space 8}708  {c |}{col 14}{res}{space 2}  .000285{col 26}{space 2} .0000472{col 37}{space 1}    6.04{col 46}{space 3}0.000{col 54}{space 4} .0001924{col 67}{space 3} .0003775
{txt}{space 8}709  {c |}{col 14}{res}{space 2}  .000369{col 26}{space 2} .0000479{col 37}{space 1}    7.70{col 46}{space 3}0.000{col 54}{space 4} .0002751{col 67}{space 3} .0004629
{txt}{space 8}710  {c |}{col 14}{res}{space 2} .0003632{col 26}{space 2} .0000484{col 37}{space 1}    7.51{col 46}{space 3}0.000{col 54}{space 4} .0002684{col 67}{space 3}  .000458
{txt}{space 8}711  {c |}{col 14}{res}{space 2} .0003594{col 26}{space 2} .0000479{col 37}{space 1}    7.51{col 46}{space 3}0.000{col 54}{space 4} .0002655{col 67}{space 3} .0004532
{txt}{space 8}712  {c |}{col 14}{res}{space 2} .0003177{col 26}{space 2} .0000481{col 37}{space 1}    6.60{col 46}{space 3}0.000{col 54}{space 4} .0002234{col 67}{space 3}  .000412
{txt}{space 8}713  {c |}{col 14}{res}{space 2}-.0009638{col 26}{space 2} .0000706{col 37}{space 1}  -13.65{col 46}{space 3}0.000{col 54}{space 4}-.0011023{col 67}{space 3}-.0008254
{txt}{space 8}714  {c |}{col 14}{res}{space 2} .0003343{col 26}{space 2} .0000483{col 37}{space 1}    6.92{col 46}{space 3}0.000{col 54}{space 4} .0002396{col 67}{space 3} .0004291
{txt}{space 8}715  {c |}{col 14}{res}{space 2} .0000986{col 26}{space 2}  .000042{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4} .0000163{col 67}{space 3} .0001808
{txt}{space 8}716  {c |}{col 14}{res}{space 2} .0001953{col 26}{space 2} .0000418{col 37}{space 1}    4.67{col 46}{space 3}0.000{col 54}{space 4} .0001134{col 67}{space 3} .0002772
{txt}{space 8}717  {c |}{col 14}{res}{space 2} .0000757{col 26}{space 2}  .000041{col 37}{space 1}    1.85{col 46}{space 3}0.065{col 54}{space 4}-4.61e-06{col 67}{space 3}  .000156
{txt}{space 8}718  {c |}{col 14}{res}{space 2} .0001396{col 26}{space 2} .0000406{col 37}{space 1}    3.43{col 46}{space 3}0.001{col 54}{space 4} .0000599{col 67}{space 3} .0002193
{txt}{space 8}719  {c |}{col 14}{res}{space 2} .0000853{col 26}{space 2} .0000394{col 37}{space 1}    2.17{col 46}{space 3}0.030{col 54}{space 4} 8.16e-06{col 67}{space 3} .0001625
{txt}{space 8}720  {c |}{col 14}{res}{space 2} .0000753{col 26}{space 2} .0000402{col 37}{space 1}    1.87{col 46}{space 3}0.061{col 54}{space 4}-3.43e-06{col 67}{space 3}  .000154
{txt}{space 8}721  {c |}{col 14}{res}{space 2} .0001246{col 26}{space 2} .0000409{col 37}{space 1}    3.05{col 46}{space 3}0.002{col 54}{space 4} .0000445{col 67}{space 3} .0002047
{txt}{space 8}722  {c |}{col 14}{res}{space 2}  .000193{col 26}{space 2} .0000416{col 37}{space 1}    4.64{col 46}{space 3}0.000{col 54}{space 4} .0001115{col 67}{space 3} .0002744
{txt}{space 8}723  {c |}{col 14}{res}{space 2} .0001586{col 26}{space 2}  .000041{col 37}{space 1}    3.87{col 46}{space 3}0.000{col 54}{space 4} .0000783{col 67}{space 3} .0002389
{txt}{space 8}724  {c |}{col 14}{res}{space 2} .0001422{col 26}{space 2} .0000415{col 37}{space 1}    3.43{col 46}{space 3}0.001{col 54}{space 4} .0000609{col 67}{space 3} .0002235
{txt}{space 8}725  {c |}{col 14}{res}{space 2}-.0011137{col 26}{space 2} .0000756{col 37}{space 1}  -14.72{col 46}{space 3}0.000{col 54}{space 4} -.001262{col 67}{space 3}-.0009654
{txt}{space 8}726  {c |}{col 14}{res}{space 2} .0001863{col 26}{space 2} .0000424{col 37}{space 1}    4.39{col 46}{space 3}0.000{col 54}{space 4} .0001031{col 67}{space 3} .0002694
{txt}{space 8}727  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}728  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}729  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}730  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}731  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}732  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}733  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}734  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}735  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}736  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}737  {c |}{col 14}{res}{space 2}-.0012624{col 26}{space 2} .0000794{col 37}{space 1}  -15.90{col 46}{space 3}0.000{col 54}{space 4} -.001418{col 67}{space 3}-.0011069
{txt}{space 8}738  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0000848{col 26}{space 2}  .000044{col 37}{space 1}   -1.93{col 46}{space 3}0.054{col 54}{space 4}-.0001711{col 67}{space 3} 1.47e-06
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     8467{col 27}{space 1}        0{col 39}{result}{space 1}     8467{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est3{txt} stored)

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. estadd local hastid "Yes",replace

{txt}added macro:
             e(hastid) : "{res:Yes}"

{com}. 
. eststo: reghdfe rincvar i.month i.date, a(ID)
{res}{txt}(dropped 1887 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}{txt}note: 727.date omitted because of collinearity
{txt}note: 728.date omitted because of collinearity
{txt}note: 729.date omitted because of collinearity
{txt}note: 730.date omitted because of collinearity
{txt}note: 731.date omitted because of collinearity
{txt}note: 732.date omitted because of collinearity
{txt}note: 733.date omitted because of collinearity
{txt}note: 734.date omitted because of collinearity
{txt}note: 735.date omitted because of collinearity
{txt}note: 736.date omitted because of collinearity
{txt}note: 738.date omitted because of collinearity
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    58,708
{txt}Absorbing 1 HDFE group{col 51}F({res}  97{txt},{res}  50368{txt}){col 67}= {res}     18.02
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.5666
{txt}{col 51}Adj R-squared{col 67}= {res}    0.4948
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0335
{txt}{col 51}Root MSE{col 67}= {res}    0.0012

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     rincvar{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0001832{col 26}{space 2} .0000762{col 37}{space 1}   -2.40{col 46}{space 3}0.016{col 54}{space 4}-.0003327{col 67}{space 3}-.0000338
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0002042{col 26}{space 2} .0000776{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.0003563{col 67}{space 3} -.000052
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.0002614{col 26}{space 2} .0000764{col 37}{space 1}   -3.42{col 46}{space 3}0.001{col 54}{space 4}-.0004112{col 67}{space 3}-.0001116
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.0001996{col 26}{space 2} .0000789{col 37}{space 1}   -2.53{col 46}{space 3}0.011{col 54}{space 4}-.0003543{col 67}{space 3}-.0000449
{txt}{space 10}6  {c |}{col 14}{res}{space 2} .0057194{col 26}{space 2}  .000171{col 37}{space 1}   33.45{col 46}{space 3}0.000{col 54}{space 4} .0053842{col 67}{space 3} .0060546
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.0003805{col 26}{space 2} .0000828{col 37}{space 1}   -4.60{col 46}{space 3}0.000{col 54}{space 4}-.0005429{col 67}{space 3}-.0002182
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .0002087{col 26}{space 2} .0000814{col 37}{space 1}    2.56{col 46}{space 3}0.010{col 54}{space 4} .0000491{col 67}{space 3} .0003682
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .0001423{col 26}{space 2} .0000796{col 37}{space 1}    1.79{col 46}{space 3}0.074{col 54}{space 4}-.0000137{col 67}{space 3} .0002983
{txt}{space 9}10  {c |}{col 14}{res}{space 2}  .000126{col 26}{space 2} .0000767{col 37}{space 1}    1.64{col 46}{space 3}0.100{col 54}{space 4}-.0000243{col 67}{space 3} .0002763
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .0000199{col 26}{space 2} .0000759{col 37}{space 1}    0.26{col 46}{space 3}0.793{col 54}{space 4}-.0001289{col 67}{space 3} .0001686
{txt}{space 9}12  {c |}{col 14}{res}{space 2} .0001094{col 26}{space 2} .0000732{col 37}{space 1}    1.49{col 46}{space 3}0.135{col 54}{space 4}-.0000341{col 67}{space 3} .0002529
{txt}{space 12} {c |}
{space 8}date {c |}
{space 8}642  {c |}{col 14}{res}{space 2} .0060742{col 26}{space 2} .0001749{col 37}{space 1}   34.73{col 46}{space 3}0.000{col 54}{space 4} .0057314{col 67}{space 3} .0064171
{txt}{space 8}643  {c |}{col 14}{res}{space 2} .0056105{col 26}{space 2} .0001625{col 37}{space 1}   34.54{col 46}{space 3}0.000{col 54}{space 4} .0052921{col 67}{space 3} .0059289
{txt}{space 8}644  {c |}{col 14}{res}{space 2} .0055795{col 26}{space 2} .0001624{col 37}{space 1}   34.35{col 46}{space 3}0.000{col 54}{space 4} .0052611{col 67}{space 3} .0058978
{txt}{space 8}645  {c |}{col 14}{res}{space 2} .0055145{col 26}{space 2} .0001614{col 37}{space 1}   34.16{col 46}{space 3}0.000{col 54}{space 4} .0051981{col 67}{space 3} .0058309
{txt}{space 8}646  {c |}{col 14}{res}{space 2} .0054922{col 26}{space 2} .0001612{col 37}{space 1}   34.06{col 46}{space 3}0.000{col 54}{space 4} .0051761{col 67}{space 3} .0058082
{txt}{space 8}647  {c |}{col 14}{res}{space 2} .0054143{col 26}{space 2} .0001601{col 37}{space 1}   33.82{col 46}{space 3}0.000{col 54}{space 4} .0051005{col 67}{space 3} .0057281
{txt}{space 8}648  {c |}{col 14}{res}{space 2} .0053683{col 26}{space 2}  .000161{col 37}{space 1}   33.34{col 46}{space 3}0.000{col 54}{space 4} .0050527{col 67}{space 3} .0056839
{txt}{space 8}649  {c |}{col 14}{res}{space 2} .0054711{col 26}{space 2} .0001613{col 37}{space 1}   33.92{col 46}{space 3}0.000{col 54}{space 4}  .005155{col 67}{space 3} .0057873
{txt}{space 8}650  {c |}{col 14}{res}{space 2} .0054354{col 26}{space 2} .0001622{col 37}{space 1}   33.51{col 46}{space 3}0.000{col 54}{space 4} .0051174{col 67}{space 3} .0057533
{txt}{space 8}651  {c |}{col 14}{res}{space 2} .0054055{col 26}{space 2} .0001614{col 37}{space 1}   33.50{col 46}{space 3}0.000{col 54}{space 4} .0050893{col 67}{space 3} .0057218
{txt}{space 8}652  {c |}{col 14}{res}{space 2} .0053003{col 26}{space 2} .0001621{col 37}{space 1}   32.69{col 46}{space 3}0.000{col 54}{space 4} .0049825{col 67}{space 3} .0056181
{txt}{space 8}653  {c |}{col 14}{res}{space 2}-.0005867{col 26}{space 2} .0000962{col 37}{space 1}   -6.10{col 46}{space 3}0.000{col 54}{space 4}-.0007753{col 67}{space 3}-.0003982
{txt}{space 8}654  {c |}{col 14}{res}{space 2} .0054424{col 26}{space 2} .0001627{col 37}{space 1}   33.45{col 46}{space 3}0.000{col 54}{space 4} .0051235{col 67}{space 3} .0057613
{txt}{space 8}655  {c |}{col 14}{res}{space 2} .0047826{col 26}{space 2} .0001534{col 37}{space 1}   31.17{col 46}{space 3}0.000{col 54}{space 4} .0044818{col 67}{space 3} .0050833
{txt}{space 8}656  {c |}{col 14}{res}{space 2} .0047973{col 26}{space 2} .0001534{col 37}{space 1}   31.28{col 46}{space 3}0.000{col 54}{space 4} .0044967{col 67}{space 3} .0050979
{txt}{space 8}657  {c |}{col 14}{res}{space 2} .0047715{col 26}{space 2} .0001524{col 37}{space 1}   31.32{col 46}{space 3}0.000{col 54}{space 4} .0044728{col 67}{space 3} .0050701
{txt}{space 8}658  {c |}{col 14}{res}{space 2} .0047877{col 26}{space 2} .0001525{col 37}{space 1}   31.40{col 46}{space 3}0.000{col 54}{space 4} .0044888{col 67}{space 3} .0050866
{txt}{space 8}659  {c |}{col 14}{res}{space 2} .0046587{col 26}{space 2}  .000151{col 37}{space 1}   30.86{col 46}{space 3}0.000{col 54}{space 4} .0043628{col 67}{space 3} .0049546
{txt}{space 8}660  {c |}{col 14}{res}{space 2} .0047426{col 26}{space 2} .0001521{col 37}{space 1}   31.18{col 46}{space 3}0.000{col 54}{space 4} .0044445{col 67}{space 3} .0050407
{txt}{space 8}661  {c |}{col 14}{res}{space 2} .0048034{col 26}{space 2} .0001525{col 37}{space 1}   31.49{col 46}{space 3}0.000{col 54}{space 4} .0045045{col 67}{space 3} .0051023
{txt}{space 8}662  {c |}{col 14}{res}{space 2} .0047881{col 26}{space 2} .0001536{col 37}{space 1}   31.17{col 46}{space 3}0.000{col 54}{space 4} .0044871{col 67}{space 3} .0050892
{txt}{space 8}663  {c |}{col 14}{res}{space 2} .0048437{col 26}{space 2} .0001524{col 37}{space 1}   31.78{col 46}{space 3}0.000{col 54}{space 4} .0045449{col 67}{space 3} .0051424
{txt}{space 8}664  {c |}{col 14}{res}{space 2} .0045667{col 26}{space 2} .0001525{col 37}{space 1}   29.95{col 46}{space 3}0.000{col 54}{space 4} .0042678{col 67}{space 3} .0048656
{txt}{space 8}665  {c |}{col 14}{res}{space 2}-.0012368{col 26}{space 2} .0001105{col 37}{space 1}  -11.19{col 46}{space 3}0.000{col 54}{space 4}-.0014534{col 67}{space 3}-.0010202
{txt}{space 8}666  {c |}{col 14}{res}{space 2} .0047297{col 26}{space 2} .0001539{col 37}{space 1}   30.74{col 46}{space 3}0.000{col 54}{space 4} .0044282{col 67}{space 3} .0050313
{txt}{space 8}667  {c |}{col 14}{res}{space 2}  .004095{col 26}{space 2} .0001437{col 37}{space 1}   28.49{col 46}{space 3}0.000{col 54}{space 4} .0038133{col 67}{space 3} .0043767
{txt}{space 8}668  {c |}{col 14}{res}{space 2} .0040935{col 26}{space 2} .0001433{col 37}{space 1}   28.57{col 46}{space 3}0.000{col 54}{space 4} .0038127{col 67}{space 3} .0043743
{txt}{space 8}669  {c |}{col 14}{res}{space 2} .0038852{col 26}{space 2}  .000142{col 37}{space 1}   27.37{col 46}{space 3}0.000{col 54}{space 4}  .003607{col 67}{space 3} .0041635
{txt}{space 8}670  {c |}{col 14}{res}{space 2}  .004001{col 26}{space 2}  .000142{col 37}{space 1}   28.17{col 46}{space 3}0.000{col 54}{space 4} .0037226{col 67}{space 3} .0042794
{txt}{space 8}671  {c |}{col 14}{res}{space 2} .0038417{col 26}{space 2} .0001397{col 37}{space 1}   27.50{col 46}{space 3}0.000{col 54}{space 4} .0035678{col 67}{space 3} .0041155
{txt}{space 8}672  {c |}{col 14}{res}{space 2} .0039434{col 26}{space 2} .0001413{col 37}{space 1}   27.92{col 46}{space 3}0.000{col 54}{space 4} .0036666{col 67}{space 3} .0042203
{txt}{space 8}673  {c |}{col 14}{res}{space 2}  .003934{col 26}{space 2} .0001423{col 37}{space 1}   27.65{col 46}{space 3}0.000{col 54}{space 4} .0036551{col 67}{space 3} .0042128
{txt}{space 8}674  {c |}{col 14}{res}{space 2} .0041181{col 26}{space 2} .0001426{col 37}{space 1}   28.88{col 46}{space 3}0.000{col 54}{space 4} .0038386{col 67}{space 3} .0043976
{txt}{space 8}675  {c |}{col 14}{res}{space 2} .0040259{col 26}{space 2} .0001417{col 37}{space 1}   28.41{col 46}{space 3}0.000{col 54}{space 4} .0037481{col 67}{space 3} .0043036
{txt}{space 8}676  {c |}{col 14}{res}{space 2} .0039023{col 26}{space 2} .0001418{col 37}{space 1}   27.51{col 46}{space 3}0.000{col 54}{space 4} .0036243{col 67}{space 3} .0041803
{txt}{space 8}677  {c |}{col 14}{res}{space 2}-.0020352{col 26}{space 2} .0001232{col 37}{space 1}  -16.51{col 46}{space 3}0.000{col 54}{space 4}-.0022767{col 67}{space 3}-.0017936
{txt}{space 8}678  {c |}{col 14}{res}{space 2} .0040049{col 26}{space 2} .0001426{col 37}{space 1}   28.08{col 46}{space 3}0.000{col 54}{space 4} .0037254{col 67}{space 3} .0042845
{txt}{space 8}679  {c |}{col 14}{res}{space 2} .0033247{col 26}{space 2} .0001315{col 37}{space 1}   25.28{col 46}{space 3}0.000{col 54}{space 4} .0030669{col 67}{space 3} .0035825
{txt}{space 8}680  {c |}{col 14}{res}{space 2} .0032712{col 26}{space 2} .0001313{col 37}{space 1}   24.91{col 46}{space 3}0.000{col 54}{space 4} .0030138{col 67}{space 3} .0035286
{txt}{space 8}681  {c |}{col 14}{res}{space 2} .0033275{col 26}{space 2}   .00013{col 37}{space 1}   25.59{col 46}{space 3}0.000{col 54}{space 4} .0030726{col 67}{space 3} .0035823
{txt}{space 8}682  {c |}{col 14}{res}{space 2}  .003453{col 26}{space 2} .0001304{col 37}{space 1}   26.47{col 46}{space 3}0.000{col 54}{space 4} .0031973{col 67}{space 3} .0037086
{txt}{space 8}683  {c |}{col 14}{res}{space 2} .0032962{col 26}{space 2} .0001276{col 37}{space 1}   25.83{col 46}{space 3}0.000{col 54}{space 4} .0030461{col 67}{space 3} .0035463
{txt}{space 8}684  {c |}{col 14}{res}{space 2} .0033641{col 26}{space 2} .0001299{col 37}{space 1}   25.89{col 46}{space 3}0.000{col 54}{space 4} .0031095{col 67}{space 3} .0036187
{txt}{space 8}685  {c |}{col 14}{res}{space 2} .0034289{col 26}{space 2} .0001305{col 37}{space 1}   26.27{col 46}{space 3}0.000{col 54}{space 4} .0031731{col 67}{space 3} .0036848
{txt}{space 8}686  {c |}{col 14}{res}{space 2} .0033504{col 26}{space 2} .0001307{col 37}{space 1}   25.64{col 46}{space 3}0.000{col 54}{space 4} .0030942{col 67}{space 3} .0036065
{txt}{space 8}687  {c |}{col 14}{res}{space 2}  .003309{col 26}{space 2}   .00013{col 37}{space 1}   25.44{col 46}{space 3}0.000{col 54}{space 4} .0030541{col 67}{space 3} .0035639
{txt}{space 8}688  {c |}{col 14}{res}{space 2} .0030941{col 26}{space 2} .0001304{col 37}{space 1}   23.72{col 46}{space 3}0.000{col 54}{space 4} .0028385{col 67}{space 3} .0033498
{txt}{space 8}689  {c |}{col 14}{res}{space 2}-.0028203{col 26}{space 2} .0001343{col 37}{space 1}  -21.00{col 46}{space 3}0.000{col 54}{space 4}-.0030835{col 67}{space 3} -.002557
{txt}{space 8}690  {c |}{col 14}{res}{space 2} .0031935{col 26}{space 2} .0001314{col 37}{space 1}   24.31{col 46}{space 3}0.000{col 54}{space 4}  .002936{col 67}{space 3}  .003451
{txt}{space 8}691  {c |}{col 14}{res}{space 2}  .002451{col 26}{space 2} .0001199{col 37}{space 1}   20.44{col 46}{space 3}0.000{col 54}{space 4}  .002216{col 67}{space 3}  .002686
{txt}{space 8}692  {c |}{col 14}{res}{space 2} .0025152{col 26}{space 2}   .00012{col 37}{space 1}   20.95{col 46}{space 3}0.000{col 54}{space 4} .0022799{col 67}{space 3} .0027505
{txt}{space 8}693  {c |}{col 14}{res}{space 2} .0023701{col 26}{space 2} .0001185{col 37}{space 1}   20.00{col 46}{space 3}0.000{col 54}{space 4} .0021378{col 67}{space 3} .0026023
{txt}{space 8}694  {c |}{col 14}{res}{space 2} .0025408{col 26}{space 2} .0001184{col 37}{space 1}   21.46{col 46}{space 3}0.000{col 54}{space 4} .0023087{col 67}{space 3} .0027728
{txt}{space 8}695  {c |}{col 14}{res}{space 2}  .002389{col 26}{space 2} .0001164{col 37}{space 1}   20.52{col 46}{space 3}0.000{col 54}{space 4} .0021608{col 67}{space 3} .0026171
{txt}{space 8}696  {c |}{col 14}{res}{space 2} .0024313{col 26}{space 2} .0001186{col 37}{space 1}   20.50{col 46}{space 3}0.000{col 54}{space 4} .0021989{col 67}{space 3} .0026638
{txt}{space 8}697  {c |}{col 14}{res}{space 2} .0025228{col 26}{space 2} .0001191{col 37}{space 1}   21.18{col 46}{space 3}0.000{col 54}{space 4} .0022893{col 67}{space 3} .0027562
{txt}{space 8}698  {c |}{col 14}{res}{space 2} .0023735{col 26}{space 2} .0001196{col 37}{space 1}   19.84{col 46}{space 3}0.000{col 54}{space 4} .0021391{col 67}{space 3}  .002608
{txt}{space 8}699  {c |}{col 14}{res}{space 2} .0024172{col 26}{space 2} .0001187{col 37}{space 1}   20.36{col 46}{space 3}0.000{col 54}{space 4} .0021845{col 67}{space 3} .0026499
{txt}{space 8}700  {c |}{col 14}{res}{space 2} .0023589{col 26}{space 2} .0001193{col 37}{space 1}   19.77{col 46}{space 3}0.000{col 54}{space 4}  .002125{col 67}{space 3} .0025927
{txt}{space 8}701  {c |}{col 14}{res}{space 2} -.003592{col 26}{space 2} .0001463{col 37}{space 1}  -24.56{col 46}{space 3}0.000{col 54}{space 4}-.0038786{col 67}{space 3}-.0033053
{txt}{space 8}702  {c |}{col 14}{res}{space 2} .0023498{col 26}{space 2} .0001203{col 37}{space 1}   19.53{col 46}{space 3}0.000{col 54}{space 4}  .002114{col 67}{space 3} .0025856
{txt}{space 8}703  {c |}{col 14}{res}{space 2} .0015396{col 26}{space 2} .0001065{col 37}{space 1}   14.45{col 46}{space 3}0.000{col 54}{space 4} .0013307{col 67}{space 3} .0017484
{txt}{space 8}704  {c |}{col 14}{res}{space 2} .0015545{col 26}{space 2} .0001073{col 37}{space 1}   14.49{col 46}{space 3}0.000{col 54}{space 4} .0013442{col 67}{space 3} .0017648
{txt}{space 8}705  {c |}{col 14}{res}{space 2} .0015144{col 26}{space 2} .0001049{col 37}{space 1}   14.44{col 46}{space 3}0.000{col 54}{space 4} .0013087{col 67}{space 3}   .00172
{txt}{space 8}706  {c |}{col 14}{res}{space 2}  .001598{col 26}{space 2} .0001056{col 37}{space 1}   15.13{col 46}{space 3}0.000{col 54}{space 4}  .001391{col 67}{space 3}  .001805
{txt}{space 8}707  {c |}{col 14}{res}{space 2} .0015004{col 26}{space 2} .0001031{col 37}{space 1}   14.55{col 46}{space 3}0.000{col 54}{space 4} .0012983{col 67}{space 3} .0017025
{txt}{space 8}708  {c |}{col 14}{res}{space 2}  .001516{col 26}{space 2} .0001041{col 37}{space 1}   14.57{col 46}{space 3}0.000{col 54}{space 4}  .001312{col 67}{space 3} .0017199
{txt}{space 8}709  {c |}{col 14}{res}{space 2} .0014741{col 26}{space 2} .0001058{col 37}{space 1}   13.94{col 46}{space 3}0.000{col 54}{space 4} .0012668{col 67}{space 3} .0016814
{txt}{space 8}710  {c |}{col 14}{res}{space 2}  .001579{col 26}{space 2} .0001061{col 37}{space 1}   14.88{col 46}{space 3}0.000{col 54}{space 4} .0013711{col 67}{space 3}  .001787
{txt}{space 8}711  {c |}{col 14}{res}{space 2} .0015054{col 26}{space 2} .0001052{col 37}{space 1}   14.31{col 46}{space 3}0.000{col 54}{space 4} .0012993{col 67}{space 3} .0017116
{txt}{space 8}712  {c |}{col 14}{res}{space 2} .0014095{col 26}{space 2} .0001061{col 37}{space 1}   13.29{col 46}{space 3}0.000{col 54}{space 4} .0012016{col 67}{space 3} .0016174
{txt}{space 8}713  {c |}{col 14}{res}{space 2}-.0046699{col 26}{space 2} .0001558{col 37}{space 1}  -29.98{col 46}{space 3}0.000{col 54}{space 4}-.0049752{col 67}{space 3}-.0043646
{txt}{space 8}714  {c |}{col 14}{res}{space 2} .0012722{col 26}{space 2} .0001064{col 37}{space 1}   11.96{col 46}{space 3}0.000{col 54}{space 4} .0010636{col 67}{space 3} .0014807
{txt}{space 8}715  {c |}{col 14}{res}{space 2} .0006163{col 26}{space 2}  .000092{col 37}{space 1}    6.70{col 46}{space 3}0.000{col 54}{space 4} .0004359{col 67}{space 3} .0007966
{txt}{space 8}716  {c |}{col 14}{res}{space 2}  .000721{col 26}{space 2} .0000917{col 37}{space 1}    7.87{col 46}{space 3}0.000{col 54}{space 4} .0005413{col 67}{space 3} .0009006
{txt}{space 8}717  {c |}{col 14}{res}{space 2} .0006799{col 26}{space 2} .0000896{col 37}{space 1}    7.59{col 46}{space 3}0.000{col 54}{space 4} .0005044{col 67}{space 3} .0008555
{txt}{space 8}718  {c |}{col 14}{res}{space 2} .0005815{col 26}{space 2} .0000899{col 37}{space 1}    6.47{col 46}{space 3}0.000{col 54}{space 4} .0004052{col 67}{space 3} .0007577
{txt}{space 8}719  {c |}{col 14}{res}{space 2} .0004348{col 26}{space 2} .0000864{col 37}{space 1}    5.03{col 46}{space 3}0.000{col 54}{space 4} .0002655{col 67}{space 3} .0006042
{txt}{space 8}720  {c |}{col 14}{res}{space 2} .0004538{col 26}{space 2} .0000885{col 37}{space 1}    5.13{col 46}{space 3}0.000{col 54}{space 4} .0002804{col 67}{space 3} .0006272
{txt}{space 8}721  {c |}{col 14}{res}{space 2} .0004972{col 26}{space 2} .0000898{col 37}{space 1}    5.54{col 46}{space 3}0.000{col 54}{space 4} .0003212{col 67}{space 3} .0006732
{txt}{space 8}722  {c |}{col 14}{res}{space 2} .0008726{col 26}{space 2} .0000913{col 37}{space 1}    9.56{col 46}{space 3}0.000{col 54}{space 4} .0006937{col 67}{space 3} .0010515
{txt}{space 8}723  {c |}{col 14}{res}{space 2} .0010301{col 26}{space 2} .0000898{col 37}{space 1}   11.48{col 46}{space 3}0.000{col 54}{space 4} .0008542{col 67}{space 3} .0012061
{txt}{space 8}724  {c |}{col 14}{res}{space 2} .0008732{col 26}{space 2} .0000909{col 37}{space 1}    9.61{col 46}{space 3}0.000{col 54}{space 4} .0006951{col 67}{space 3} .0010514
{txt}{space 8}725  {c |}{col 14}{res}{space 2}-.0053818{col 26}{space 2} .0001667{col 37}{space 1}  -32.29{col 46}{space 3}0.000{col 54}{space 4}-.0057085{col 67}{space 3}-.0050551
{txt}{space 8}726  {c |}{col 14}{res}{space 2} .0005961{col 26}{space 2}  .000093{col 37}{space 1}    6.41{col 46}{space 3}0.000{col 54}{space 4} .0004137{col 67}{space 3} .0007784
{txt}{space 8}727  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}728  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}729  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}730  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}731  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}732  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}733  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}734  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}735  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}736  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}737  {c |}{col 14}{res}{space 2}-.0059968{col 26}{space 2}  .000175{col 37}{space 1}  -34.27{col 46}{space 3}0.000{col 54}{space 4}-.0063398{col 67}{space 3}-.0056539
{txt}{space 8}738  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0015281{col 26}{space 2} .0000969{col 37}{space 1}  -15.77{col 46}{space 3}0.000{col 54}{space 4} -.001718{col 67}{space 3}-.0013382
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     8243{col 27}{space 1}        0{col 39}{result}{space 1}     8243{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est4{txt} stored)

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. estadd local hastid "Yes",replace

{txt}added macro:
             e(hastid) : "{res:Yes}"

{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/ind/month_of_year_effect.csv", ///
>        stats(hasid hastid r2 N, label("Individual FE" "Time FE" "R-squared" "Sample Size")) ///
>            label mtitles se r2 ///
>            drop(*.date) replace
{res}{txt}(note: file /Users/Myworld/Dropbox/PIR/WorkingFolder/Tables/ind/month_of_year_effect.csv not found)
(output written to {browse  `"/Users/Myworld/Dropbox/PIR/WorkingFolder/Tables/ind/month_of_year_effect.csv"'})

{com}. 
. eststo clear
{txt}
{com}. 
{txt}end of do-file

{com}. eststo: reghdfe incexp i.month, a(date)
{res}{txt}note: {res}2bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}3bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}4bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}5bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}6bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}7bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}8bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}9bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}10bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}11bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}12bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}{txt}note: 2.month omitted because of collinearity
{txt}note: 3.month omitted because of collinearity
{txt}note: 4.month omitted because of collinearity
{txt}note: 5.month omitted because of collinearity
{txt}note: 6.month omitted because of collinearity
{txt}note: 7.month omitted because of collinearity
{txt}note: 8.month omitted because of collinearity
{txt}note: 9.month omitted because of collinearity
{txt}note: 10.month omitted because of collinearity
{txt}note: 11.month omitted because of collinearity
{txt}note: 12.month omitted because of collinearity
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    47,819
{txt}Absorbing 1 HDFE group{col 51}{help j_robustsingular##|_new:F(   0,  47722)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.0025
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0005
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.0187

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   incexp_rv{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}3  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}4  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}5  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}6  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}7  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}8  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}9  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}10  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}11  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}12  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0003412{col 26}{space 2} .0000854{col 37}{space 1}   -4.00{col 46}{space 3}0.000{col 54}{space 4}-.0005086{col 67}{space 3}-.0001738
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}        date{col 14}{c |}{space 1}       97{col 27}{space 1}        0{col 39}{result}{space 1}       97{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est1{txt} stored)

{com}. reghdfe incexp i.month, a(date)
{res}{txt}note: {res}2bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}3bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}4bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}5bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}6bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}7bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}8bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}9bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}10bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}11bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}note: {res}12bn.month{txt} is probably collinear with the fixed effects (all partialled-out values are close to zero; tol = 1.0e-09)
{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}{txt}note: 2.month omitted because of collinearity
{txt}note: 3.month omitted because of collinearity
{txt}note: 4.month omitted because of collinearity
{txt}note: 5.month omitted because of collinearity
{txt}note: 6.month omitted because of collinearity
{txt}note: 7.month omitted because of collinearity
{txt}note: 8.month omitted because of collinearity
{txt}note: 9.month omitted because of collinearity
{txt}note: 10.month omitted because of collinearity
{txt}note: 11.month omitted because of collinearity
{txt}note: 12.month omitted because of collinearity
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    47,819
{txt}Absorbing 1 HDFE group{col 51}{help j_robustsingular##|_new:F(   0,  47722)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.0025
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0005
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.0187

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   incexp_rv{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}3  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}4  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}5  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}6  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}7  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}8  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}9  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}10  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}11  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}12  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0003412{col 26}{space 2} .0000854{col 37}{space 1}   -4.00{col 46}{space 3}0.000{col 54}{space 4}-.0005086{col 67}{space 3}-.0001738
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}        date{col 14}{c |}{space 1}       97{col 27}{space 1}        0{col 39}{result}{space 1}       97{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}

{com}. do "/var/folders/k3/fzq0vzzx2b56ypvhsddgs7hr0000gn/T//SD00732.000000"
{txt}
{com}. 
. eststo clear
{txt}
{com}. 
. eststo: reghdfe incexp i.month, a(ID)
{res}{txt}(dropped 1138 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    46,681
{txt}Absorbing 1 HDFE group{col 51}F({res}  11{txt},{res}  39764{txt}){col 67}= {res}      1.21
{txt}{col 51}Prob > F{col 67}= {res}    0.2768
{txt}{col 51}R-squared{col 67}= {res}    0.0703
{txt}{col 51}Adj R-squared{col 67}= {res}   -0.0914
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0003
{txt}{col 51}Root MSE{col 67}= {res}    0.0193

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   incexp_rv{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2} -.000661{col 26}{space 2}  .000449{col 37}{space 1}   -1.47{col 46}{space 3}0.141{col 54}{space 4} -.001541{col 67}{space 3} .0002191
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0001142{col 26}{space 2} .0004559{col 37}{space 1}   -0.25{col 46}{space 3}0.802{col 54}{space 4}-.0010078{col 67}{space 3} .0007794
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.0001095{col 26}{space 2} .0004591{col 37}{space 1}   -0.24{col 46}{space 3}0.811{col 54}{space 4}-.0010094{col 67}{space 3} .0007904
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.0002278{col 26}{space 2} .0004599{col 37}{space 1}   -0.50{col 46}{space 3}0.620{col 54}{space 4}-.0011292{col 67}{space 3} .0006736
{txt}{space 10}6  {c |}{col 14}{res}{space 2}   .00011{col 26}{space 2}  .000461{col 37}{space 1}    0.24{col 46}{space 3}0.811{col 54}{space 4}-.0007936{col 67}{space 3} .0010136
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.0003155{col 26}{space 2} .0004528{col 37}{space 1}   -0.70{col 46}{space 3}0.486{col 54}{space 4}-.0012031{col 67}{space 3} .0005721
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.0001353{col 26}{space 2} .0004642{col 37}{space 1}   -0.29{col 46}{space 3}0.771{col 54}{space 4}-.0010452{col 67}{space 3} .0007745
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.0005015{col 26}{space 2}  .000459{col 37}{space 1}   -1.09{col 46}{space 3}0.275{col 54}{space 4}-.0014012{col 67}{space 3} .0003982
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .0001554{col 26}{space 2}  .000456{col 37}{space 1}    0.34{col 46}{space 3}0.733{col 54}{space 4}-.0007384{col 67}{space 3} .0010491
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .0001839{col 26}{space 2} .0004547{col 37}{space 1}    0.40{col 46}{space 3}0.686{col 54}{space 4}-.0007073{col 67}{space 3} .0010751
{txt}{space 9}12  {c |}{col 14}{res}{space 2} .0007018{col 26}{space 2} .0004526{col 37}{space 1}    1.55{col 46}{space 3}0.121{col 54}{space 4}-.0001853{col 67}{space 3} .0015889
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0002769{col 26}{space 2} .0003235{col 37}{space 1}   -0.86{col 46}{space 3}0.392{col 54}{space 4} -.000911{col 67}{space 3} .0003571
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     6906{col 27}{space 1}        0{col 39}{result}{space 1}     6906{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est1{txt} stored)

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. estadd local hastid "Yes",replace

{txt}added macro:
             e(hastid) : "{res:Yes}"

{com}. 
. eststo: reghdfe rincexp i.month, a(ID)
{res}{txt}(dropped 1187 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    41,074
{txt}Absorbing 1 HDFE group{col 51}F({res}  11{txt},{res}  34690{txt}){col 67}= {res}      1.64
{txt}{col 51}Prob > F{col 67}= {res}    0.0798
{txt}{col 51}R-squared{col 67}= {res}    0.0778
{txt}{col 51}Adj R-squared{col 67}= {res}   -0.0919
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0005
{txt}{col 51}Root MSE{col 67}= {res}    0.0267

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  rincexp_rv{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2} -.001607{col 26}{space 2}  .000663{col 37}{space 1}   -2.42{col 46}{space 3}0.015{col 54}{space 4}-.0029064{col 67}{space 3}-.0003075
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0004453{col 26}{space 2} .0006743{col 37}{space 1}   -0.66{col 46}{space 3}0.509{col 54}{space 4}-.0017671{col 67}{space 3} .0008764
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.0016146{col 26}{space 2} .0006824{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4}-.0029521{col 67}{space 3}-.0002772
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.0009357{col 26}{space 2} .0006858{col 37}{space 1}   -1.36{col 46}{space 3}0.172{col 54}{space 4}-.0022799{col 67}{space 3} .0004084
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.0000537{col 26}{space 2}  .000685{col 37}{space 1}   -0.08{col 46}{space 3}0.938{col 54}{space 4}-.0013964{col 67}{space 3}  .001289
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.0007699{col 26}{space 2}  .000672{col 37}{space 1}   -1.15{col 46}{space 3}0.252{col 54}{space 4}-.0020871{col 67}{space 3} .0005473
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.0005437{col 26}{space 2}  .000688{col 37}{space 1}   -0.79{col 46}{space 3}0.429{col 54}{space 4}-.0018923{col 67}{space 3} .0008049
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.0007115{col 26}{space 2} .0006795{col 37}{space 1}   -1.05{col 46}{space 3}0.295{col 54}{space 4}-.0020433{col 67}{space 3} .0006204
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.0002449{col 26}{space 2} .0006745{col 37}{space 1}   -0.36{col 46}{space 3}0.717{col 54}{space 4}-.0015668{col 67}{space 3} .0010771
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.0005838{col 26}{space 2} .0006736{col 37}{space 1}   -0.87{col 46}{space 3}0.386{col 54}{space 4}-.0019042{col 67}{space 3} .0007365
{txt}{space 9}12  {c |}{col 14}{res}{space 2} .0004588{col 26}{space 2} .0006698{col 37}{space 1}    0.68{col 46}{space 3}0.493{col 54}{space 4}-.0008541{col 67}{space 3} .0017717
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0007269{col 26}{space 2} .0004799{col 37}{space 1}    1.51{col 46}{space 3}0.130{col 54}{space 4}-.0002137{col 67}{space 3} .0016675
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     6373{col 27}{space 1}        0{col 39}{result}{space 1}     6373{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est2{txt} stored)

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. estadd local hastid "Yes",replace

{txt}added macro:
             e(hastid) : "{res:Yes}"

{com}. 
. eststo: reghdfe incvar i.month, a(ID)
{res}{txt}(dropped 1944 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    61,122
{txt}Absorbing 1 HDFE group{col 51}F({res}  11{txt},{res}  52644{txt}){col 67}= {res}      1.25
{txt}{col 51}Prob > F{col 67}= {res}    0.2441
{txt}{col 51}R-squared{col 67}= {res}    0.5908
{txt}{col 51}Adj R-squared{col 67}= {res}    0.5249
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0003
{txt}{col 51}Root MSE{col 67}= {res}    0.0006

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      incvar{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-7.82e-06{col 26}{space 2} .0000118{col 37}{space 1}   -0.66{col 46}{space 3}0.509{col 54}{space 4} -.000031{col 67}{space 3} .0000154
{txt}{space 10}3  {c |}{col 14}{res}{space 2} 4.99e-06{col 26}{space 2} .0000119{col 37}{space 1}    0.42{col 46}{space 3}0.674{col 54}{space 4}-.0000183{col 67}{space 3} .0000283
{txt}{space 10}4  {c |}{col 14}{res}{space 2} 8.81e-06{col 26}{space 2} .0000119{col 37}{space 1}    0.74{col 46}{space 3}0.461{col 54}{space 4}-.0000146{col 67}{space 3} .0000322
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-9.71e-07{col 26}{space 2} .0000119{col 37}{space 1}   -0.08{col 46}{space 3}0.935{col 54}{space 4}-.0000244{col 67}{space 3} .0000224
{txt}{space 10}6  {c |}{col 14}{res}{space 2} 3.22e-06{col 26}{space 2} .0000118{col 37}{space 1}    0.27{col 46}{space 3}0.785{col 54}{space 4}-.0000199{col 67}{space 3} .0000263
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.0000205{col 26}{space 2} .0000117{col 37}{space 1}   -1.75{col 46}{space 3}0.080{col 54}{space 4}-.0000435{col 67}{space 3} 2.46e-06
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.0000112{col 26}{space 2}  .000012{col 37}{space 1}   -0.94{col 46}{space 3}0.348{col 54}{space 4}-.0000347{col 67}{space 3} .0000122
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.0000215{col 26}{space 2} .0000119{col 37}{space 1}   -1.80{col 46}{space 3}0.071{col 54}{space 4}-.0000448{col 67}{space 3} 1.87e-06
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-6.80e-06{col 26}{space 2} .0000118{col 37}{space 1}   -0.57{col 46}{space 3}0.566{col 54}{space 4}  -.00003{col 67}{space 3} .0000164
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.0000101{col 26}{space 2} .0000118{col 37}{space 1}   -0.86{col 46}{space 3}0.392{col 54}{space 4}-.0000333{col 67}{space 3} .0000131
{txt}{space 9}12  {c |}{col 14}{res}{space 2}-4.26e-06{col 26}{space 2} .0000118{col 37}{space 1}   -0.36{col 46}{space 3}0.719{col 54}{space 4}-.0000274{col 67}{space 3} .0000189
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0004535{col 26}{space 2} 8.38e-06{col 37}{space 1}   54.10{col 46}{space 3}0.000{col 54}{space 4} .0004371{col 67}{space 3} .0004699
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     8467{col 27}{space 1}        0{col 39}{result}{space 1}     8467{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est3{txt} stored)

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. estadd local hastid "Yes",replace

{txt}added macro:
             e(hastid) : "{res:Yes}"

{com}. 
. eststo: reghdfe rincvar i.month, a(ID)
{res}{txt}(dropped 1887 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}    58,708
{txt}Absorbing 1 HDFE group{col 51}F({res}  11{txt},{res}  50454{txt}){col 67}= {res}      2.30
{txt}{col 51}Prob > F{col 67}= {res}    0.0084
{txt}{col 51}R-squared{col 67}= {res}    0.5518
{txt}{col 51}Adj R-squared{col 67}= {res}    0.4785
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0005
{txt}{col 51}Root MSE{col 67}= {res}    0.0013

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     rincvar{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}month {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0000766{col 26}{space 2} .0000264{col 37}{space 1}   -2.90{col 46}{space 3}0.004{col 54}{space 4}-.0001284{col 67}{space 3}-.0000248
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0000126{col 26}{space 2} .0000265{col 37}{space 1}    0.47{col 46}{space 3}0.635{col 54}{space 4}-.0000394{col 67}{space 3} .0000646
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0000173{col 26}{space 2} .0000267{col 37}{space 1}    0.65{col 46}{space 3}0.515{col 54}{space 4}-.0000349{col 67}{space 3} .0000696
{txt}{space 10}5  {c |}{col 14}{res}{space 2} 8.38e-06{col 26}{space 2} .0000267{col 37}{space 1}    0.31{col 46}{space 3}0.753{col 54}{space 4}-.0000439{col 67}{space 3} .0000607
{txt}{space 10}6  {c |}{col 14}{res}{space 2} 4.88e-06{col 26}{space 2} .0000263{col 37}{space 1}    0.19{col 46}{space 3}0.853{col 54}{space 4}-.0000466{col 67}{space 3} .0000564
{txt}{space 10}7  {c |}{col 14}{res}{space 2} -.000043{col 26}{space 2} .0000262{col 37}{space 1}   -1.64{col 46}{space 3}0.101{col 54}{space 4}-.0000943{col 67}{space 3} 8.32e-06
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.0000244{col 26}{space 2} .0000267{col 37}{space 1}   -0.91{col 46}{space 3}0.360{col 54}{space 4}-.0000768{col 67}{space 3} .0000279
{txt}{space 10}9  {c |}{col 14}{res}{space 2}-.0000148{col 26}{space 2} .0000266{col 37}{space 1}   -0.56{col 46}{space 3}0.578{col 54}{space 4} -.000067{col 67}{space 3} .0000374
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.0000327{col 26}{space 2} .0000264{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-.0000844{col 67}{space 3}  .000019
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.0000286{col 26}{space 2} .0000264{col 37}{space 1}   -1.08{col 46}{space 3}0.279{col 54}{space 4}-.0000804{col 67}{space 3} .0000232
{txt}{space 9}12  {c |}{col 14}{res}{space 2} .0000115{col 26}{space 2} .0000264{col 37}{space 1}    0.43{col 46}{space 3}0.664{col 54}{space 4}-.0000404{col 67}{space 3} .0000633
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0012751{col 26}{space 2} .0000187{col 37}{space 1}   68.05{col 46}{space 3}0.000{col 54}{space 4} .0012384{col 67}{space 3} .0013118
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}          ID{col 14}{c |}{space 1}     8243{col 27}{space 1}        0{col 39}{result}{space 1}     8243{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
({res}est4{txt} stored)

{com}. estadd local hasid "Yes",replace

{txt}added macro:
              e(hasid) : "{res:Yes}"

{com}. estadd local hastid "Yes",replace

{txt}added macro:
             e(hastid) : "{res:Yes}"

{com}. 
. esttab using "${c -(}sum_table_folder{c )-}/ind/month_of_year_effect.csv", ///
>        stats(hasid hastid r2 N, label("Individual FE" "Time FE" "R-squared" "Sample Size")) ///
>            label mtitles se r2 ///
>            replace
{res}{txt}(output written to {browse  `"/Users/Myworld/Dropbox/PIR/WorkingFolder/Tables/ind/month_of_year_effect.csv"'})

{com}. 
. eststo clear
{txt}
{com}. 
{txt}end of do-file

{com}. clear

. clear

. 