{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Myworld/Dropbox/PIR/WorkingFolder/indSCE_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}13 Sep 2022, 08:50:31
{txt}
{com}. 
. 
. *********************************************************
. *** before working with SCE, clean the macro monthly data 
. ********************************************************
. 
. use "${c -(}mainfolder{c )-}/OtherData/macroM_raw.dta",clear 
{txt}
{com}. 
. generate new_date = dofc(DATE)
{txt}
{com}. *format new_date %tm
. gen year = year(new_date)
{txt}
{com}. gen month = month(new_date)
{txt}
{com}. gen date_str = string(year)+ "m"+string(month)
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop DATE date_str year month new_date 
{txt}
{com}. label var sp500 "growth rate (%) of sp500 index from last month"
{txt}
{com}. rename ue uerate
{res}{txt}
{com}. label var uerate "unemployment rate"
{txt}
{com}. label var he "quarterly growth in hourly earning"
{txt}
{com}. label var vix "vix indices"
{txt}
{com}. save "${c -(}mainfolder{c )-}/OtherData/macroM.dta",replace 
{txt}file /Users/Myworld/Dropbox/PIR/WorkingFolder/OtherData/macroM.dta saved

{com}. clear 
{txt}
{com}. 
. 
. *****************************************
. ** Prepare estimated income risks data **
. ******************************************
. 
. ** full sample
. use "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed.dta", clear 
{txt}
{com}. 
. drop index 
{txt}
{com}. gen year = floor(YM/100)
{txt}
{com}. gen month = YM - year*100
{txt}
{com}. gen date_str=string(year)+"M"+string(month)
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop date_str 
{txt}
{com}. 
. table date

{txt}{hline 10}{c TT}{hline 11}
     date {c |}      Freq.
{hline 10}{c +}{hline 11}
   2013m3 {c |}          {res}1
   {txt}2013m4 {c |}          {res}1
   {txt}2013m5 {c |}          {res}1
   {txt}2013m6 {c |}          {res}1
   {txt}2013m7 {c |}          {res}1
   {txt}2013m8 {c |}          {res}1
   {txt}2013m9 {c |}          {res}1
  {txt}2013m10 {c |}          {res}1
  {txt}2013m11 {c |}          {res}1
  {txt}2013m12 {c |}          {res}1
   {txt}2014m1 {c |}          {res}1
   {txt}2014m2 {c |}          {res}1
   {txt}2014m3 {c |}          {res}1
   {txt}2014m4 {c |}          {res}1
   {txt}2014m5 {c |}          {res}1
   {txt}2014m6 {c |}          {res}1
   {txt}2014m7 {c |}          {res}1
   {txt}2014m8 {c |}          {res}1
   {txt}2014m9 {c |}          {res}1
  {txt}2014m10 {c |}          {res}1
  {txt}2014m11 {c |}          {res}1
  {txt}2014m12 {c |}          {res}1
   {txt}2015m1 {c |}          {res}1
   {txt}2015m2 {c |}          {res}1
   {txt}2015m3 {c |}          {res}1
   {txt}2015m4 {c |}          {res}1
   {txt}2015m5 {c |}          {res}1
   {txt}2015m6 {c |}          {res}1
   {txt}2015m7 {c |}          {res}1
   {txt}2015m8 {c |}          {res}1
   {txt}2015m9 {c |}          {res}1
  {txt}2015m10 {c |}          {res}1
  {txt}2015m11 {c |}          {res}1
  {txt}2015m12 {c |}          {res}1
   {txt}2016m1 {c |}          {res}1
   {txt}2016m2 {c |}          {res}1
   {txt}2016m3 {c |}          {res}1
   {txt}2016m4 {c |}          {res}1
   {txt}2016m5 {c |}          {res}1
   {txt}2016m6 {c |}          {res}1
   {txt}2016m7 {c |}          {res}1
   {txt}2016m8 {c |}          {res}1
   {txt}2016m9 {c |}          {res}1
  {txt}2016m10 {c |}          {res}1
  {txt}2016m11 {c |}          {res}1
  {txt}2016m12 {c |}          {res}1
   {txt}2017m1 {c |}          {res}1
   {txt}2017m2 {c |}          {res}1
   {txt}2017m3 {c |}          {res}1
   {txt}2017m4 {c |}          {res}1
   {txt}2017m5 {c |}          {res}1
   {txt}2017m6 {c |}          {res}1
   {txt}2017m7 {c |}          {res}1
   {txt}2017m8 {c |}          {res}1
   {txt}2017m9 {c |}          {res}1
  {txt}2017m10 {c |}          {res}1
  {txt}2017m11 {c |}          {res}1
  {txt}2017m12 {c |}          {res}1
   {txt}2018m1 {c |}          {res}1
   {txt}2018m2 {c |}          {res}1
   {txt}2018m3 {c |}          {res}1
   {txt}2018m4 {c |}          {res}1
   {txt}2018m5 {c |}          {res}1
   {txt}2018m6 {c |}          {res}1
   {txt}2018m7 {c |}          {res}1
   {txt}2018m8 {c |}          {res}1
   {txt}2018m9 {c |}          {res}1
  {txt}2018m10 {c |}          {res}1
  {txt}2018m11 {c |}          {res}1
  {txt}2018m12 {c |}          {res}1
   {txt}2019m1 {c |}          {res}1
   {txt}2019m2 {c |}          {res}1
   {txt}2019m3 {c |}          {res}1
   {txt}2019m4 {c |}          {res}1
   {txt}2019m5 {c |}          {res}1
   {txt}2019m6 {c |}          {res}1
   {txt}2019m7 {c |}          {res}1
   {txt}2019m8 {c |}          {res}1
   {txt}2019m9 {c |}          {res}1
  {txt}2019m10 {c |}          {res}1
  {txt}2019m11 {c |}          {res}1
  {txt}2019m12 {c |}          {res}1
{txt}{hline 10}{c BT}{hline 11}

{com}. 
. tsset date
{res}{txt}{col 9}time variable:  {res}{col 25}date, 2013m3 to 2019m12
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. tsfill
{txt}
{com}. replace month=1 if f1.month==2 & month==.
{txt}(0 real changes made)

{com}. replace year = f1.year if f1.month==2 & month==1
{txt}(0 real changes made)

{com}. replace YM = 100*year+month if YM==.
{txt}(0 real changes made)

{com}. 
. 
. rename permanent prisk_all
{res}{txt}
{com}. rename transitory trisk_all
{res}{txt}
{com}. label var prisk_all "estimated full-sample permanent risk(std)"
{txt}
{com}. label var trisk_all "estimated full-sample transitory risk (std)"
{txt}
{com}. 
. ** estimated risks in variances 
. 
. gen prisk2_all=prisk_all^2
{txt}(5 missing values generated)

{com}. gen trisk2_all=trisk_all^2
{txt}
{com}. 
. 
. label var prisk2_all "full sample permanent risk (var)"
{txt}
{com}. label var trisk2_all "full sample transitory risk  (var)"
{txt}
{com}. 
. 
. ***********************************
. ** Fill some estimation risk for january 
. *************************************
. 
. replace prisk2_all=(l1.prisk2_all+f1.prisk2_all)/2 if month==1
{txt}(6 real changes made)

{com}. replace trisk2_all=(l1.trisk2_all+f1.trisk2_all)/2 if month==1
{txt}(6 real changes made)

{com}. 
. ***********************************
. ** Time aggregation of estimation risk
. *************************************
. 
. foreach x in all{c -(}
{txt}  2{com}. gen prisk2_`x'_rl = (f1.prisk2_`x'+f2.prisk2_`x'+f3.prisk2_`x'+f4.prisk2_`x'+ ///
>                       f5.prisk2_`x'+f6.prisk2_`x'+f7.prisk2_`x'+f8.prisk2_`x'+ ///
>                                           f9.prisk2_`x'+ f10.prisk2_`x'+ f11.prisk2_`x'+f12.prisk2_`x') 
{txt}  3{com}. 
. gen trisk2_`x'_rl = (f1.trisk2_`x'+f2.trisk2_`x'+f3.trisk2_`x'+f4.trisk2_`x'+ ///
>                       f5.trisk2_`x'+f6.trisk2_`x'+f7.trisk2_`x'+f8.trisk2_`x'+ ///
>                                           f9.trisk2_`x'+ f10.trisk2_`x'+ f11.trisk2_`x'+f12.trisk2_`x')/12
{txt}  4{com}. 
. gen rincvar_`x'_rl = prisk2_`x'_rl+ trisk2_`x'_rl
{txt}  5{com}. {c )-}
{txt}(12 missing values generated)
(12 missing values generated)
(12 missing values generated)

{com}. 
. label var rincvar_all_rl "realized full-sample annual risk 12 m from now"
{txt}
{com}. 
. 
. gen rincvar_all_now = l12.rincvar_all_rl
{txt}(12 missing values generated)

{com}. label var rincvar_all_now "realized full-sample annual risk since 12 m ago"
{txt}
{com}. 
. drop year month
{txt}
{com}. save "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_annual.dta",replace 
{txt}file /Users/Myworld/Dropbox/PIR/WorkingFolder/OtherData/sipp/sipp_history_vol_decomposed_annual.dta saved

{com}. 
. 
. *****************************
. ** subsample sample
. ******************************
. 
. use "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_edu_gender_age5.dta", clear
{txt}
{com}. 
. drop index 
{txt}
{com}. gen year = floor(YM/100)
{txt}
{com}. gen month = YM - year*100
{txt}
{com}. gen date_str=string(year)+"M"+string(month)
{txt}
{com}. gen date = monthly(date_str,"YM")
{txt}
{com}. format date %tm
{txt}
{com}. drop date_str 
{txt}
{com}. 
. table date

{txt}{hline 10}{c TT}{hline 11}
     date {c |}      Freq.
{hline 10}{c +}{hline 11}
   2013m3 {c |}         {res}48
   {txt}2013m4 {c |}         {res}48
   {txt}2013m5 {c |}         {res}48
   {txt}2013m6 {c |}         {res}48
   {txt}2013m7 {c |}         {res}48
   {txt}2013m8 {c |}         {res}48
   {txt}2013m9 {c |}         {res}48
  {txt}2013m10 {c |}         {res}48
  {txt}2013m11 {c |}         {res}48
  {txt}2013m12 {c |}         {res}48
   {txt}2014m1 {c |}         {res}48
   {txt}2014m2 {c |}         {res}48
   {txt}2014m3 {c |}         {res}48
   {txt}2014m4 {c |}         {res}48
   {txt}2014m5 {c |}         {res}48
   {txt}2014m6 {c |}         {res}48
   {txt}2014m7 {c |}         {res}48
   {txt}2014m8 {c |}         {res}48
   {txt}2014m9 {c |}         {res}48
  {txt}2014m10 {c |}         {res}48
  {txt}2014m11 {c |}         {res}48
  {txt}2014m12 {c |}         {res}48
   {txt}2015m1 {c |}         {res}48
   {txt}2015m2 {c |}         {res}48
   {txt}2015m3 {c |}         {res}48
   {txt}2015m4 {c |}         {res}48
   {txt}2015m5 {c |}         {res}48
   {txt}2015m6 {c |}         {res}48
   {txt}2015m7 {c |}         {res}48
   {txt}2015m8 {c |}         {res}48
   {txt}2015m9 {c |}         {res}48
  {txt}2015m10 {c |}         {res}48
  {txt}2015m11 {c |}         {res}48
  {txt}2015m12 {c |}         {res}48
   {txt}2016m1 {c |}         {res}48
   {txt}2016m2 {c |}         {res}48
   {txt}2016m3 {c |}         {res}48
   {txt}2016m4 {c |}         {res}48
   {txt}2016m5 {c |}         {res}48
   {txt}2016m6 {c |}         {res}48
   {txt}2016m7 {c |}         {res}48
   {txt}2016m8 {c |}         {res}48
   {txt}2016m9 {c |}         {res}48
  {txt}2016m10 {c |}         {res}48
  {txt}2016m11 {c |}         {res}48
  {txt}2016m12 {c |}         {res}48
   {txt}2017m1 {c |}         {res}48
   {txt}2017m2 {c |}         {res}48
   {txt}2017m3 {c |}         {res}48
   {txt}2017m4 {c |}         {res}48
   {txt}2017m5 {c |}         {res}48
   {txt}2017m6 {c |}         {res}48
   {txt}2017m7 {c |}         {res}48
   {txt}2017m8 {c |}         {res}48
   {txt}2017m9 {c |}         {res}48
  {txt}2017m10 {c |}         {res}48
  {txt}2017m11 {c |}         {res}48
  {txt}2017m12 {c |}         {res}48
   {txt}2018m1 {c |}         {res}48
   {txt}2018m2 {c |}         {res}48
   {txt}2018m3 {c |}         {res}48
   {txt}2018m4 {c |}         {res}48
   {txt}2018m5 {c |}         {res}48
   {txt}2018m6 {c |}         {res}48
   {txt}2018m7 {c |}         {res}48
   {txt}2018m8 {c |}         {res}48
   {txt}2018m9 {c |}         {res}48
  {txt}2018m10 {c |}         {res}48
  {txt}2018m11 {c |}         {res}48
  {txt}2018m12 {c |}         {res}48
   {txt}2019m1 {c |}         {res}48
   {txt}2019m2 {c |}         {res}48
   {txt}2019m3 {c |}         {res}48
   {txt}2019m4 {c |}         {res}48
   {txt}2019m5 {c |}         {res}48
   {txt}2019m6 {c |}         {res}48
   {txt}2019m7 {c |}         {res}48
   {txt}2019m8 {c |}         {res}48
   {txt}2019m9 {c |}         {res}48
  {txt}2019m10 {c |}         {res}48
  {txt}2019m11 {c |}         {res}48
  {txt}2019m12 {c |}         {res}48
{txt}{hline 10}{c BT}{hline 11}

{com}. ************************************************
. egen groupid = group(gender educ age_5yr)
{txt}
{com}. xtset groupid date 
{res}{txt}{col 8}panel variable:  {res}groupid (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m3 to 2019m12
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. 
. ********************************************
. rename permanent prisk_sub
{res}{txt}
{com}. rename transitory trisk_sub
{res}{txt}
{com}. label var prisk_sub "estimated sub-sample permanent risk(std)"
{txt}
{com}. label var trisk_sub "estimated sub-sample transitory risk (std)"
{txt}
{com}. 
. ** estimated risks in variances 
. gen prisk2_sub=prisk_sub^2
{txt}(240 missing values generated)

{com}. gen trisk2_sub = trisk_sub^2 
{txt}
{com}. 
. label var prisk2_sub "sub sample permanent risk  (var)"
{txt}
{com}. label var trisk2_sub "sub sample transitory risk  (var)"
{txt}
{com}. 
. 
. foreach var in prisk2_sub trisk2_sub{c -(}
{txt}  2{com}.       egen `var'pl=pctile(`var'),p(1) by(date)
{txt}  3{com}.           egen `var'pu=pctile(`var'),p(99) by(date)
{txt}  4{com}.           replace `var' = . if `var' <`var'pl | (`var' >`var'pu & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(240 missing values generated)
(240 missing values generated)
(0 real changes made)
(0 real changes made)

{com}. 
. ***********************************
. ** Fill some estimation risk for january 
. *************************************
. 
. replace prisk2_sub=(l1.prisk2_sub+f1.prisk2_sub)/2 if month==1
{txt}(288 real changes made)

{com}. replace trisk2_sub=(l1.trisk2_sub+f1.trisk2_sub)/2 if month==1
{txt}(288 real changes made)

{com}. 
. ***********************************
. ** Time aggregation of estimation risk
. *************************************
. 
. foreach x in sub{c -(}
{txt}  2{com}. gen prisk2_`x'_rl = (f1.prisk2_`x'+f2.prisk2_`x'+f3.prisk2_`x'+f4.prisk2_`x'+ ///
>                       f5.prisk2_`x'+f6.prisk2_`x'+f7.prisk2_`x'+f8.prisk2_`x'+ ///
>                                           f9.prisk2_`x'+ f10.prisk2_`x'+ f11.prisk2_`x'+f12.prisk2_`x') 
{txt}  3{com}. 
. gen trisk2_`x'_rl = (f1.trisk2_`x'+f2.trisk2_`x'+f3.trisk2_`x'+f4.trisk2_`x'+ ///
>                       f5.trisk2_`x'+f6.trisk2_`x'+f7.trisk2_`x'+f8.trisk2_`x'+ ///
>                                           f9.trisk2_`x'+ f10.trisk2_`x'+ f11.trisk2_`x'+f12.trisk2_`x')/12 
{txt}  4{com}. 
. gen rincvar_`x'_rl = prisk2_`x'_rl+ trisk2_`x'_rl
{txt}  5{com}. {c )-}
{txt}(576 missing values generated)
(576 missing values generated)
(576 missing values generated)

{com}. 
. label var rincvar_sub_rl "realized sub-sample annual risk"
{txt}
{com}. 
. gen rincvar_sub_now = l12.rincvar_sub_rl
{txt}(576 missing values generated)

{com}. label var rincvar_sub_now "realized sub-sample annual risk since 12m ago"
{txt}
{com}. drop year month groupid 
{txt}
{com}. save "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_edu_gender_age5_annual.dta",replace
{txt}file /Users/Myworld/Dropbox/PIR/WorkingFolder/OtherData/sipp/sipp_history_vol_decomposed_edu_gender_age5_annual.dta saved

{com}.  
. ***************************
. **  Clean and Merge Data **
. ***************************
. 
. use "${c -(}folder{c )-}/SCE/IncExpSCEProbIndM",clear 
{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}       {res}115083             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. ************************************
. **  merge with estimated moments **
. ***********************************
. 
. * IncExpSCEDstIndM is the output from ../Pythoncode/DoDensityEst.ipynb
. merge 1:1 userid date using "${c -(}folder{c )-}/SCE/IncExpSCEDstIndM.dta", keep(master match) 
{res}{txt}{p 0 7 2}
(note: variable
date was 
float, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
month was 
byte, now float to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}         115,083
{txt}{col 9}from master{col 30}{res}         115,083{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}               0{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge IndEst_merge
{res}{txt}
{com}. 
. duplicates report year month userid

{p 0 4}{txt}Duplicates in terms of {res} year month userid{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}       {res}115083             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. 
. ** merge labor market module  
. merge 1:1 year month userid using "${c -(}otherdata_folder{c )-}/LaborExpSCEIndM", keep(master match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          98,478
{txt}{col 9}from master{col 30}{res}          98,478{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          16,605{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename _merge labor_merge
{res}{txt}
{com}. rename userid ID 
{res}{txt}
{com}. 
. *****************************************
. ****  Renaming so that more consistent **
. *****************************************
. 
. rename Q24_mean incmean
{res}{txt}
{com}. rename Q24_var incvar
{res}{txt}
{com}. rename Q24_iqr inciqr
{res}{txt}
{com}. rename IncSkew incskew 
{res}{txt}
{com}. rename Q24_rmean rincmean
{res}{txt}
{com}. rename Q24_rvar rincvar
{res}{txt}
{com}. 
. *rename Q36 educ
. rename D6 HHinc 
{res}{txt}
{com}. rename Q32 age 
{res}{txt}
{com}. rename Q33 gender 
{res}{txt}
{com}. gen fulltime = Q10_1 
{txt}
{com}. gen parttime = Q10_2 
{txt}
{com}. rename Q12new selfemp
{res}{txt}
{com}. gen Stkprob= Q6new/100
{txt}(851 missing values generated)

{com}. gen UEprobAgg=Q4new/100
{txt}(299 missing values generated)

{com}. gen  UEprobInd4m = oo1_5/100
{txt}(106887 missing values generated)

{com}. gen UEprobInd=Q13new/100
{txt}(41918 missing values generated)

{com}. rename Q26v2 spending_dum
{res}{txt}
{com}. rename Q26v2part2 spending 
{res}{txt}
{com}. replace spending = spending/100
{txt}(108735 real changes made)

{com}. 
. gen exp_offer = oo2u/100
{txt}(111904 missing values generated)

{com}. gen EUprobInd = Q22new/100
{txt}(41709 missing values generated)

{com}. 
. ***********************
. ** merge other data ***
. **************************
. 
. 
. **macro data
. merge m:1 date using "${c -(}mainfolder{c )-}/OtherData/macroM.dta",keep(master match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          17,650
{txt}{col 9}from master{col 30}{res}          17,650{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          97,433{txt}  (_merge==3)
{col 5}{hline 41}

{com}. rename cpi CPIAU
{res}{txt}
{com}. drop _merge 
{txt}
{com}. 
. 
. * flow rate data
. merge m:1 year month using "${c -(}otherdata_folder{c )-}/CPS_worker_flows_SA.dta",keep(master match)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}         115,083{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge 
{txt}
{com}. 
. 
. * income risk estimation data
. gen YM = year*100+month
{txt}
{com}. 
. ** merge population estimation 
. merge m:1 YM using "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_annual.dta", keep(master match)
{res}{txt}{p 0 7 2}
(note: variable
YM was 
float, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          21,142
{txt}{col 9}from master{col 30}{res}          21,142{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          93,941{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge 
{txt}
{com}. 
. ********************
. ** group variables *
. ********************
. 
. egen byear_5yr = cut(byear), ///
>      at(1915 1920 1925 1930 1935 1940 ///
>             1945 1950 1955 1960 1965 1970 ///
>             1975 1980 1985 1990 1995 2000 ///
>                 2005 2010)
{txt}
{com}. label var byear_5yr "5-year cohort"
{txt}
{com}. 
. egen age_5yr = cut(age), ///
>      at(20 25 30 35 40 45 ///
>             50 55 60)
{txt}(29738 missing values generated)

{com}. label var age_5yr "5-year age"
{txt}
{com}. 
. 
. gen edu_g = . 
{txt}(115083 missing values generated)

{com}. replace edu_g = 1 if educ==1
{txt}(987 real changes made)

{com}. replace edu_g = 2 if educ==2 | educ ==3 | educ == 4
{txt}(49240 real changes made)

{com}. replace edu_g = 3 if educ <=9 & educ>4
{txt}(64856 real changes made)

{com}. 
. label var edu_g "education group"
{txt}
{com}. label define edu_glb 1 "HS dropout" 2 "HS graduate" 3 "College/above"
{txt}
{com}. label value edu_g edu_glb
{txt}
{com}. 
. replace educ = edu_g 
{txt}(102496 real changes made)

{com}. 
. merge m:1 gender educ age_5yr YM ///
>          using "${c -(}otherdata_folder{c )-}/sipp/sipp_history_vol_decomposed_edu_gender_age5_annual.dta", keep(master match)
{res}{txt}{p 0 7 2}
(note: variable
educ was 
float, now double to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
gender was 
byte, now long to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
age_5yr was 
float, now double to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          56,019
{txt}{col 9}from master{col 30}{res}          56,019{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          59,064{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge 
{txt}
{com}. 
. ** 
. merge m:1 gender educ age_5yr ///
>          using "${c -(}otherdata_folder{c )-}/sipp/sipp_vol_edu_gender_age5.dta", keep(master match)
{res}{txt}{p 0 7 2}
(note: variable
gender was 
long, now double to accommodate using data's values)
{p_end}
(label edu_glb already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          15,774
{txt}{col 9}from master{col 30}{res}          15,774{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          99,309{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge 
{txt}
{com}. 
. 
. *******************************
. **  Set Panel Data Structure **
. *******************************
. 
. xtset ID date
{res}{txt}{col 8}panel variable:  {res}ID (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 2013m6 to 2021m7, but with gaps
{txt}{col 17}delta:  {res}1 month
{txt}
{com}. sort ID date
{txt}
{com}. 
. *******************************
. ** Exclude youth and retired
. ******************************
. keep if age <= 60 & age >= 20
{txt}(26695 observations deleted)

{com}. 
. *******************************
. **  Summary Statistics of SCE **
. *******************************
. 
. tabstat ID,s(count) by(date) column(statistics)

{txt}Summary for variables: ID
{col 6}by categories of: date 

{ralign 9:date} {...}
{c |}         N
{hline 10}{c +}{hline 10}
{ralign 9: 2013m6} {...}
{c |}{...}
 {res}      891
{txt}{ralign 9: 2013m7} {...}
{c |}{...}
 {res}      850
{txt}{ralign 9: 2013m8} {...}
{c |}{...}
 {res}     1233
{txt}{ralign 9: 2013m9} {...}
{c |}{...}
 {res}     1082
{txt}{ralign 9:2013m10} {...}
{c |}{...}
 {res}     1091
{txt}{ralign 9:2013m11} {...}
{c |}{...}
 {res}     1083
{txt}{ralign 9:2013m12} {...}
{c |}{...}
 {res}      947
{txt}{ralign 9: 2014m1} {...}
{c |}{...}
 {res}      938
{txt}{ralign 9: 2014m2} {...}
{c |}{...}
 {res}      915
{txt}{ralign 9: 2014m3} {...}
{c |}{...}
 {res}      938
{txt}{ralign 9: 2014m4} {...}
{c |}{...}
 {res}      927
{txt}{ralign 9: 2014m5} {...}
{c |}{...}
 {res}      892
{txt}{ralign 9: 2014m6} {...}
{c |}{...}
 {res}      910
{txt}{ralign 9: 2014m7} {...}
{c |}{...}
 {res}      954
{txt}{ralign 9: 2014m8} {...}
{c |}{...}
 {res}      936
{txt}{ralign 9: 2014m9} {...}
{c |}{...}
 {res}      915
{txt}{ralign 9:2014m10} {...}
{c |}{...}
 {res}      903
{txt}{ralign 9:2014m11} {...}
{c |}{...}
 {res}      913
{txt}{ralign 9:2014m12} {...}
{c |}{...}
 {res}      882
{txt}{ralign 9: 2015m1} {...}
{c |}{...}
 {res}      900
{txt}{ralign 9: 2015m2} {...}
{c |}{...}
 {res}      907
{txt}{ralign 9: 2015m3} {...}
{c |}{...}
 {res}      869
{txt}{ralign 9: 2015m4} {...}
{c |}{...}
 {res}      885
{txt}{ralign 9: 2015m5} {...}
{c |}{...}
 {res}      891
{txt}{ralign 9: 2015m6} {...}
{c |}{...}
 {res}      885
{txt}{ralign 9: 2015m7} {...}
{c |}{...}
 {res}      869
{txt}{ralign 9: 2015m8} {...}
{c |}{...}
 {res}      848
{txt}{ralign 9: 2015m9} {...}
{c |}{...}
 {res}      879
{txt}{ralign 9:2015m10} {...}
{c |}{...}
 {res}      868
{txt}{ralign 9:2015m11} {...}
{c |}{...}
 {res}      866
{txt}{ralign 9:2015m12} {...}
{c |}{...}
 {res}      843
{txt}{ralign 9: 2016m1} {...}
{c |}{...}
 {res}      861
{txt}{ralign 9: 2016m2} {...}
{c |}{...}
 {res}      815
{txt}{ralign 9: 2016m3} {...}
{c |}{...}
 {res}      872
{txt}{ralign 9: 2016m4} {...}
{c |}{...}
 {res}      841
{txt}{ralign 9: 2016m5} {...}
{c |}{...}
 {res}      879
{txt}{ralign 9: 2016m6} {...}
{c |}{...}
 {res}      877
{txt}{ralign 9: 2016m7} {...}
{c |}{...}
 {res}      918
{txt}{ralign 9: 2016m8} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9: 2016m9} {...}
{c |}{...}
 {res}      911
{txt}{ralign 9:2016m10} {...}
{c |}{...}
 {res}      906
{txt}{ralign 9:2016m11} {...}
{c |}{...}
 {res}      895
{txt}{ralign 9:2016m12} {...}
{c |}{...}
 {res}      933
{txt}{ralign 9: 2017m1} {...}
{c |}{...}
 {res}      936
{txt}{ralign 9: 2017m2} {...}
{c |}{...}
 {res}      932
{txt}{ralign 9: 2017m3} {...}
{c |}{...}
 {res}      949
{txt}{ralign 9: 2017m4} {...}
{c |}{...}
 {res}      886
{txt}{ralign 9: 2017m5} {...}
{c |}{...}
 {res}      944
{txt}{ralign 9: 2017m6} {...}
{c |}{...}
 {res}      941
{txt}{ralign 9: 2017m7} {...}
{c |}{...}
 {res}      948
{txt}{ralign 9: 2017m8} {...}
{c |}{...}
 {res}      942
{txt}{ralign 9: 2017m9} {...}
{c |}{...}
 {res}      919
{txt}{ralign 9:2017m10} {...}
{c |}{...}
 {res}      956
{txt}{ralign 9:2017m11} {...}
{c |}{...}
 {res}      921
{txt}{ralign 9:2017m12} {...}
{c |}{...}
 {res}      870
{txt}{ralign 9: 2018m1} {...}
{c |}{...}
 {res}      906
{txt}{ralign 9: 2018m2} {...}
{c |}{...}
 {res}      908
{txt}{ralign 9: 2018m3} {...}
{c |}{...}
 {res}      896
{txt}{ralign 9: 2018m4} {...}
{c |}{...}
 {res}      875
{txt}{ralign 9: 2018m5} {...}
{c |}{...}
 {res}      878
{txt}{ralign 9: 2018m6} {...}
{c |}{...}
 {res}      873
{txt}{ralign 9: 2018m7} {...}
{c |}{...}
 {res}      910
{txt}{ralign 9: 2018m8} {...}
{c |}{...}
 {res}      897
{txt}{ralign 9: 2018m9} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9:2018m10} {...}
{c |}{...}
 {res}      931
{txt}{ralign 9:2018m11} {...}
{c |}{...}
 {res}      907
{txt}{ralign 9:2018m12} {...}
{c |}{...}
 {res}      855
{txt}{ralign 9: 2019m1} {...}
{c |}{...}
 {res}      937
{txt}{ralign 9: 2019m2} {...}
{c |}{...}
 {res}      917
{txt}{ralign 9: 2019m3} {...}
{c |}{...}
 {res}      925
{txt}{ralign 9: 2019m4} {...}
{c |}{...}
 {res}      912
{txt}{ralign 9: 2019m5} {...}
{c |}{...}
 {res}      895
{txt}{ralign 9: 2019m6} {...}
{c |}{...}
 {res}      896
{txt}{ralign 9: 2019m7} {...}
{c |}{...}
 {res}      908
{txt}{ralign 9: 2019m8} {...}
{c |}{...}
 {res}      894
{txt}{ralign 9: 2019m9} {...}
{c |}{...}
 {res}      904
{txt}{ralign 9:2019m10} {...}
{c |}{...}
 {res}      880
{txt}{ralign 9:2019m11} {...}
{c |}{...}
 {res}      867
{txt}{ralign 9:2019m12} {...}
{c |}{...}
 {res}      874
{txt}{ralign 9: 2020m1} {...}
{c |}{...}
 {res}      896
{txt}{ralign 9: 2020m2} {...}
{c |}{...}
 {res}      913
{txt}{ralign 9: 2020m3} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9: 2020m4} {...}
{c |}{...}
 {res}      895
{txt}{ralign 9: 2020m5} {...}
{c |}{...}
 {res}      872
{txt}{ralign 9: 2020m6} {...}
{c |}{...}
 {res}      802
{txt}{ralign 9: 2020m7} {...}
{c |}{...}
 {res}      807
{txt}{ralign 9: 2020m8} {...}
{c |}{...}
 {res}      797
{txt}{ralign 9: 2020m9} {...}
{c |}{...}
 {res}      783
{txt}{ralign 9:2020m10} {...}
{c |}{...}
 {res}      826
{txt}{ralign 9:2020m11} {...}
{c |}{...}
 {res}      843
{txt}{ralign 9:2020m12} {...}
{c |}{...}
 {res}      931
{txt}{ralign 9: 2021m1} {...}
{c |}{...}
 {res}      873
{txt}{ralign 9: 2021m2} {...}
{c |}{...}
 {res}      869
{txt}{ralign 9: 2021m3} {...}
{c |}{...}
 {res}      855
{txt}{ralign 9: 2021m4} {...}
{c |}{...}
 {res}      884
{txt}{ralign 9: 2021m5} {...}
{c |}{...}
 {res}      872
{txt}{ralign 9: 2021m6} {...}
{c |}{...}
 {res}      930
{txt}{ralign 9: 2021m7} {...}
{c |}{...}
 {res}      881
{txt}{hline 10}{c +}{hline 10}
{ralign 9:Total} {...}
{c |}{...}
 {res}    88388
{txt}{hline 10}{c BT}{hline 10}

{com}. 
. *******************************
. **  Generate Variables       **
. *******************************
. 
. gen Incmean = .
{txt}(88388 missing values generated)

{com}. gen Incvar = .
{txt}(88388 missing values generated)

{com}. gen Inciqr = .
{txt}(88388 missing values generated)

{com}. 
. gen Incmean_ch = .
{txt}(88388 missing values generated)

{com}. gen Incvar_ch = .
{txt}(88388 missing values generated)

{com}. gen Inciqr_ch = .
{txt}(88388 missing values generated)

{com}. 
. 
. gen Inc_mom = .
{txt}(88388 missing values generated)

{com}. gen Inc_mom_ch = .
{txt}(88388 missing values generated)

{com}. 
. *** take the log
. 
. foreach mom in var{c -(}
{txt}  2{com}. gen linc`mom'= log(inc`mom') 
{txt}  3{com}. gen lrinc`mom' = log(rinc`mom') 
{txt}  4{com}. {c )-}
{txt}(23357 missing values generated)
(27125 missing values generated)

{com}. 
. 
. foreach mom in iqr{c -(}
{txt}  2{com}. gen linc`mom'= log(inc`mom') 
{txt}  3{com}. {c )-}
{txt}(16198 missing values generated)

{com}. 
. label var linciqr "log perceived iqr"
{txt}
{com}. label var lincvar "log perceived risk"
{txt}
{com}. label var lrincvar "log perceived risk (real)"
{txt}
{com}. label var spending "expected growth in spending"
{txt}
{com}. 
. *************************************
. *** Poisson rate in expectations 
. **************************************
. 
. 
. gen exp_s = log(1-UEprobInd4m)/(-3) 
{txt}(82115 missing values generated)

{com}. * can use exp_eu from micro data 
. label var exp_s "expected Poisson separation rate"
{txt}
{com}. 
. gen exp_f =log(1-EUprobInd)/(-4)
{txt}(28367 missing values generated)

{com}. * can use exp_ue from micro data 
. label var exp_f "expected Poisson job-finding rate"
{txt}
{com}. 
. gen exp_s_1y = log(1-UEprobInd)/(-12) 
{txt}(23210 missing values generated)

{com}. * can use exp_eu from micro data 
. label var exp_s_1y "expected Poisson separation rate (1 year)"
{txt}
{com}. 
. *************************************
. *** Variables for overreaction test 
. **************************************
. 
. ** earing expectation 
. 
. gen incexp_rv = incmean - l1.incmean
{txt}(40569 missing values generated)

{com}. label var incexp_rv "revision in nominal wage growth expectation"
{txt}
{com}. 
. gen rincexp_rv = rincmean - l1.rincmean
{txt}(46127 missing values generated)

{com}. label var rincexp_rv "revision in real wage growth expectation"
{txt}
{com}. 
. ** earning risk 
. 
. gen incvar_rv = incvar - l1.incvar 
{txt}(41578 missing values generated)

{com}. label var incvar_rv "revision in nominal earning risk"
{txt}
{com}. 
. gen rincvar_rv = rincvar - l1.rincvar
{txt}(45438 missing values generated)

{com}. label var rincvar "revision in earning risk"
{txt}
{com}. 
. gen rincvar_all_fe = rincvar-rincvar_all_rl
{txt}(45951 missing values generated)

{com}. label var rincvar_all_fe "forecast error in earning risk"
{txt}
{com}. gen rincvar_sub_fe = rincvar-rincvar_sub_rl
{txt}(53378 missing values generated)

{com}. label var rincvar_all_fe "forecast error in earning risk"
{txt}
{com}. 
. ** negative fe means underestimation 
. 
. foreach var in prisk2_all trisk2_all prisk2_sub trisk2_sub rincvar_all_now rincvar_sub_now{c -(}
{txt}  2{com}. gen `var'_ch = `var'-l1.`var'
{txt}  3{com}. {c )-}
{txt}(32209 missing values generated)
(32209 missing values generated)
(43751 missing values generated)
(43751 missing values generated)
(39204 missing values generated)
(47478 missing values generated)

{com}. 
. ** separation risk
. gen exp_s_1y_fe = exp_s_1y - f1.s
{txt}(37103 missing values generated)

{com}. label var exp_s_1y_fe "forecast error of separation rate"
{txt}
{com}. 
. gen exp_s_1y_rv = exp_s_1y - l1.exp_s_1y
{txt}(38769 missing values generated)

{com}. label var exp_s_1y_rv "revision in separation rate"
{txt}
{com}. 
. gen exp_s_fe = exp_s - f4.s
{txt}(84853 missing values generated)

{com}. label var exp_s_fe "forecast error of separation rate"
{txt}
{com}. 
. gen exp_s_rv = exp_s - l4.exp_s
{txt}(86036 missing values generated)

{com}. label var exp_s_rv "revision in separation rate"
{txt}
{com}. 
. gen exp_f_fe = exp_f - f1.f
{txt}(41050 missing values generated)

{com}. label var exp_s_fe "forecast error of separation rate"
{txt}
{com}. 
. gen exp_f_rv = exp_f - l1.exp_f
{txt}(44035 missing values generated)

{com}. label var exp_f_rv "revision in separation rate"
{txt}
{com}. 
. ***********************************************
. **** Job experiences/transitions/search *****
. ***********************************************
. 
. gen emp_status = .
{txt}(88388 missing values generated)

{com}. 
. replace emp_status = 1 if Q10_1==1|Q10_2==1|Q10_5==1
{txt}(73466 real changes made)

{com}. replace emp_status = 2 if Q10_3==1|Q10_4==1
{txt}(3978 real changes made)

{com}. replace emp_status = 3 if Q10_6==1|Q10_7==1|Q10_8==1|Q10_9==1
{txt}(14321 real changes made)

{com}. 
. label define emp_status_lb 1 "employed" 2 "unemployed" 3 "non-working"
{txt}
{com}. label value emp_status emp_status_lb
{txt}
{com}. 
. gen e2u = cond(emp_status==2 & (l1.emp_status==1|l2.emp_status==1|l3.emp_status==1|l4.emp_status==1),1,0)
{txt}
{com}. label var e2u "employed since m-4 and unemployed now"
{txt}
{com}. 
. gen u2e = cond(emp_status==1 &  (l1.emp_status==2|l2.emp_status==2|l3.emp_status==2|l4.emp_status==2),1,0)
{txt}
{com}. label var u2e "unemployed since m-4 and employed now"
{txt}
{com}. 
. 
. gen e2um8 = cond(emp_status==2 & ///
>                  (l1.emp_status==1|l2.emp_status==1|l3.emp_status==1|l4.emp_status==1| ///
>                                   l5.emp_status==1|l6.emp_status==1|l7.emp_status==1|l8.emp_status==1),1,0)
{txt}
{com}. label var e2um8 "employed since m-8 and unemployed now"
{txt}
{com}. 
. gen u2em8 = cond(emp_status==1 &  ///
>                (l1.emp_status==2|l2.emp_status==2|l3.emp_status==2|l4.emp_status==2| ///
>                            l5.emp_status==2|l6.emp_status==2|l7.emp_status==2|l5.emp_status==2),1,0)
{txt}
{com}. label var u2em8 "unemployed since m-8 and employed now"
{txt}
{com}. 
. 
. gen e2um12 = cond(emp_status==2 & ///
>                  (l1.emp_status==1|l2.emp_status==1|l3.emp_status==1|l4.emp_status==1| ///
>                                   l5.emp_status==1|l6.emp_status==1|l7.emp_status==1|l8.emp_status==1| ///
>                                   l9.emp_status==1|l10.emp_status==1|l11.emp_status==1|l12.emp_status==1),1,0)
{txt}
{com}. label var e2um12 "employed since y-1 and unemployed now"
{txt}
{com}. 
. gen u2em12 = cond(emp_status==1 &  ///
>                (l1.emp_status==2|l2.emp_status==2|l3.emp_status==2|l4.emp_status==2| ///
>                            l5.emp_status==2|l6.emp_status==2|l7.emp_status==2|l5.emp_status==2| ///
>                             l9.emp_status==2|l10.emp_status==2|l11.emp_status==2|l12.emp_status==2),1,0)
{txt}
{com}. label var u2em12 "unemployed since y-1 and employed now"
{txt}
{com}. 
. *************************
. *** Exclude outliers *****
. *************************
. 
. local vars incvar rincvar l3
{txt}
{com}. 
. foreach var in `vars'{c -(}
{txt}  2{com}.       egen `var'pl=pctile(`var'),p(1)
{txt}  3{com}.           egen `var'pu=pctile(`var'),p(99)
{txt}  4{com}.           replace `var' = . if `var' <`var'pl | (`var' >`var'pu & `var'!=.)
{txt}  5{com}. {c )-}
{txt}(1965 real changes made, 1965 to missing)
(668 real changes made, 668 to missing)
(201 real changes made, 201 to missing)

{com}. 
. *************************
. ** macro variables normalization
. *****************************
. 
. replace he = he*l3.CPIAU/CPIAU
{txt}(74668 real changes made, 29486 to missing)

{com}. label var he "real hourly earning growth"
{txt}
{com}. 
. gen ue_chg = uerate - l3.uerate
{txt}(43206 missing values generated)

{com}. label var ue_chg "change in unemployment rate"
{txt}
{com}. 
. ************************
. ** group variables ****
. ************************
. ** age square
. gen age2 = age^2
{txt}
{com}. label var age2 "age squared"
{txt}
{com}. 
. 
. ***********************************
. ** new variables SCE realizations **
. **********************************
. 
. * log earning 
. gen wage_1y = l3*100/CPIAU
{txt}(78252 missing values generated)

{com}. label var wage_1y "average real annual earning from primary job"
{txt}
{com}. 
. ** average earning 
. egen wage_1y_av = mean(wage_1y), by(ID)
{txt}(38972 missing values generated)

{com}. label var wage_1y_av "average real annual earning across time"
{txt}
{com}. 
. ** income decile
. egen earning_gp = xtile(wage_1y_av), by(date) n(10) 
{txt}(38972 missing values generated)

{com}. label var earning_gp "decile of earning from low to high"
{txt}
{com}. 
. gen lwage_1y = log(wage_1y)
{txt}(78252 missing values generated)

{com}. label var lwage_1y "log average annual earning from primary job"
{txt}
{com}. 
. gen lwage_1y_gm4 = lwage_1y-l4.lwage_1y
{txt}(83475 missing values generated)

{com}. label var lwage_1y_gm4 "log annual earning growth from previous m-4 to m"
{txt}
{com}. 
. egen lwage_1y_gm4_sd = sd(lwage_1y_gm4), by(date)
{txt}(74776 missing values generated)

{com}. label var lwage_1y_gm4 "std log annual earning growth from previous m-4 to m"
{txt}
{com}. 
. ** generate cross-sectional std
. egen lwage_1y_sd = sd(lwage_1y), by(date)
{txt}(73838 missing values generated)

{com}. 
. ** mincer regressions 
. reghdfe lwage_1y age age2, a(i.gender i.edu_g) resid
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 3 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     8,751
{txt}Absorbing 2 HDFE groups{col 51}F({res}   2{txt},{res}   8745{txt}){col 67}= {res}     58.44
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.1281
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1276
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0132
{txt}{col 51}Root MSE{col 67}= {res}    0.9399

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lwage_1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}  .087877{col 26}{space 2} .0085779{col 37}{space 1}   10.24{col 46}{space 3}0.000{col 54}{space 4} .0710623{col 67}{space 3} .1046917
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.0009885{col 26}{space 2}  .000101{col 37}{space 1}   -9.78{col 46}{space 3}0.000{col 54}{space 4}-.0011865{col 67}{space 3}-.0007904
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.991126{col 26}{space 2} .1740459{col 37}{space 1}   45.91{col 46}{space 3}0.000{col 54}{space 4} 7.649955{col 67}{space 3} 8.332297
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}      gender{col 14}{c |}{space 1}        2{col 27}{space 1}        0{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{col 1}{text}       edu_g{col 14}{c |}{space 1}        3{col 27}{space 1}        1{col 39}{result}{space 1}        2{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}

{com}. predict lwage_1y_shk, residuals
{txt}(79637 missing values generated)

{com}. 
. * including aggregate shock
. reghdfe lwage_1y age age2, a(i.date i.gender i.edu_g) resid
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 4 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     8,751
{txt}Absorbing 3 HDFE groups{col 51}F({res}   2{txt},{res}   8730{txt}){col 67}= {res}     58.40
{txt}{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.1296
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1276
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0132
{txt}{col 51}Root MSE{col 67}= {res}    0.9399

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lwage_1y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}  .087862{col 26}{space 2}  .008584{col 37}{space 1}   10.24{col 46}{space 3}0.000{col 54}{space 4} .0710354{col 67}{space 3} .1046886
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.0009881{col 26}{space 2} .0001011{col 37}{space 1}   -9.77{col 46}{space 3}0.000{col 54}{space 4}-.0011863{col 67}{space 3}-.0007899
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.991048{col 26}{space 2} .1741738{col 37}{space 1}   45.88{col 46}{space 3}0.000{col 54}{space 4} 7.649627{col 67}{space 3}  8.33247
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}        date{col 14}{c |}{space 1}       16{col 27}{space 1}        0{col 39}{result}{space 1}       16{col 53}{text} {col 54}{c |}
{col 1}{text}      gender{col 14}{c |}{space 1}        2{col 27}{space 1}        1{col 39}{result}{space 1}        1{col 53}{text} {col 54}{c |}
{col 1}{text}       edu_g{col 14}{c |}{space 1}        3{col 27}{space 1}        1{col 39}{result}{space 1}        2{col 53}{text}?{col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
? = number of redundant parameters may be higher

{com}. predict lwage_1y_id_shk, residuals
{txt}(79637 missing values generated)

{com}. 
. gen lwage_1y_ag_shk = lwage_1y_shk- lwage_1y_id_shk
{txt}(79637 missing values generated)

{com}. 
. label var lwage_1y_shk "log wage shock"
{txt}
{com}. label var lwage_1y_id_shk "log wage idiosyncratic shock"
{txt}
{com}. label var lwage_1y_ag_shk "log wage aggregate shock"
{txt}
{com}. 
. ** first difference
. foreach var in lwage_1y_shk lwage_1y_id_shk lwage_1y_ag_shk{c -(}
{txt}  2{com}. gen `var'_gr = `var'- l4.`var'
{txt}  3{com}. {c )-}
{txt}(84294 missing values generated)
(84294 missing values generated)
(84294 missing values generated)

{com}. 
. label var lwage_1y_shk_gr "log growth of unexplained wage"
{txt}
{com}. label var lwage_1y_id_shk_gr "log growth of idiosyncratic unexplained wage"
{txt}
{com}. label var lwage_1y_ag_shk_gr "log growth of aggregate unexplained wage"
{txt}
{com}. 
. 
. ** inequality  
. gen lwage_1y_shk2 = log(lwage_1y_shk^2)
{txt}(79637 missing values generated)

{com}. label var lwage_1y_shk2 "squared log residuals"
{txt}
{com}. 
. ** volatility 
. gen lwage_1y_shk_gr2 = log(lwage_1y_shk_gr^2)
{txt}(84294 missing values generated)

{com}. label var lwage_1y_shk_gr2 "squared log shocks"
{txt}
{com}. 
. egen lwage_1y_shk_gr_sd = sd(lwage_1y_shk_gr), by(date)
{txt}(74776 missing values generated)

{com}. label var lwage_1y_shk_gr_sd "standard deviation of log shocks"
{txt}
{com}. 
. gen lwage_1y_shk_gr_var = lwage_1y_shk_gr_sd^2
{txt}(74776 missing values generated)

{com}. label var lwage_1y_shk_gr_sd "var of log shocks"
{txt}
{com}. 
. 
. /*
> ***********************************************
> ** summary chart of unconditional wages ********
> ************************************************
> 
> preserve
> 
> collapse (mean) lwage_1y lwage_1y_sd, by(date year month) 
> ** average log wage whole sample
> twoway  (connected lwage_1y date) if lwage_1y!=., title("The mean of log real wages") 
> graph export "${c -(}graph_folder{c )-}/log_wage_av.png", as(png) replace 
> 
> ** std log wage whole sample
> twoway  (connected lwage_1y_sd date) if lwage_1y_sd!=., title("The standard deviation of log real wages") 
> graph export "${c -(}graph_folder{c )-}/log_wage_sd.png", as(png) replace 
> restore 
> 
> 
> ************************************************
> ** summary chart of conditional wages ********
> ************************************************
> 
> preserve
> 
> collapse (mean) lwage_1y_shk_gr lwage_1y_shk_gr_sd, by(year month date) 
> ** average log wage shock whole sample
> twoway  (connected lwage_1y_shk_gr date) if lwage_1y_shk_gr!=., title("The mean of log real wage shocks") 
> graph export "${c -(}graph_folder{c )-}/log_wage_shk_gr.png", as(png) replace 
> 
> ** std log wage whole sample
> twoway  (connected lwage_1y_shk_gr_sd date) if lwage_1y_shk_gr_sd!=., title("The standard deviation of log real wage shocks") 
> graph export "${c -(}graph_folder{c )-}/log_wage_shk_gr_sd.png", as(png) replace
> restore 
> */
. 
. ***************************************
. **** earning level and risk perceptions
. ***************************************
. 
. gen incsd = sqrt(incvar)
{txt}(25322 missing values generated)

{com}. gen rincsd = sqrt(rincvar)
{txt}(27793 missing values generated)

{com}. gen rincsd_all_rl = sqrt(rincvar_all_rl)
{txt}(27222 missing values generated)

{com}. gen psd2_all_rl = sqrt(prisk2_all_rl)
{txt}(27222 missing values generated)

{com}. gen tsd2_all_rl = sqrt(trisk2_all_rl)
{txt}(27222 missing values generated)

{com}. 
. gen rincsd_sub_rl = sqrt(rincvar_sub_rl)
{txt}(38464 missing values generated)

{com}. gen psd2_sub_rl = sqrt(prisk2_sub_rl)
{txt}(38464 missing values generated)

{com}. gen tsd2_sub_rl = sqrt(trisk2_sub_rl)
{txt}(38464 missing values generated)

{com}. 
. 
. graph bar rincsd, ///
>            over(earning_gp,relabel(1 "10%" 2 "20%" 3 "30%" 4 "40%" 5 "50%" 6 "60%" 7 "70%" 8 "80%" 9 "90%" 10 "100%")) ///
>                    bar(1, color(navy)) ///
>                    title("Perceived risk by real earning") ///
>                    b1title("earning decile") ///
>                    ytitle("Average perceived risk (std)") 
{res}{txt}
{com}. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_earning.png", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/PIR/WorkingFolder/Graphs/ind/boxplot_rvar_earning.png written in PNG format)

{com}. 
. 
. graph bar rincsd incsd lwage_shk_gr_sd_age_sex rincsd_sub_rl psd2_sub_rl if educ!=1 & age_5yr>25, ///
>            over(age_5yr) over(gender,relabel(1 "Male" 2 "Female")) ///
>                    bar(1, color(navy)) ///
>                    bar(2, color(khaki)) ///
>                    bar(3, color(gray)) ///
>                    bar(4, color(cranberry)) ///
>                    bar(5, color(orange)) ///
>                    title("Perceived and realized risk by age",size(med)) ///
>                    ytitle("Average perceived risk (std)")  ///
>                    legend(row(2) label(1 "PR") label(2 "PR (nominal)") label(3 "volatility") label(4 "realized risk") label(5 "permanent risk"))
{res}{p 0 4 2}
{txt}(note:  named style
med not found in class
gsize,  default attributes used)
{p_end}
{res}{txt}
{com}. 
. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_compare_age.png", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/PIR/WorkingFolder/Graphs/ind/boxplot_rvar_compare_age.png written in PNG format)

{com}. 
. 
. graph bar rincsd incsd lwage_shk_gr_sd_age_sex rincsd_sub_rl psd2_sub_rl, ///
>            over(educ,relabel(1 "HS dropout" 2 "HS" 3 "College")) over(gender,relabel(1 "Male" 2 "Female")) ///
>                    bar(1, color(navy)) ///
>                    bar(2, color(khaki)) ///
>                    bar(3, color(gray)) ///
>                    bar(4, color(cranberry)) ///
>                    bar(5, color(orange)) ///
>                    title("Perceived and realized risk by education",size(med)) ///
>                    ytitle("Average perceived risk (std)")  ///
>                    legend(row(2) label(1 "PR") label(2 "PR (nominal)") label(3 "volatility")  label(4 "realized risk") label(5 "permanent risk"))
{res}{p 0 4 2}
{txt}(note:  named style
med not found in class
gsize,  default attributes used)
{p_end}
{res}{txt}
{com}. 
. graph export "${c -(}sum_graph_folder{c )-}/boxplot_rvar_compare_educ.png", as(png) replace 
{txt}(file /Users/Myworld/Dropbox/PIR/WorkingFolder/Graphs/ind/boxplot_rvar_compare_educ.png written in PNG format)

{com}. ddd
{err}unrecognized command:  ddd
{txt}{search r(199):r(199);}

end of do-file

{search r(199):r(199);}

{com}. clear

. 